[
  {
    "id": "1b8dc4696027908844934745",
    "country": "SAUDI ARABIA",
    "source_name": "Saudi Gazette",
    "source_slug": "saudi_gazette",
    "url": "https://saudigazette.com.sa/article/659036/saudi-arabia/increase-in-king-fahd-causeway-toll-fees-takes-into-effect",
    "title": "Increase in King Fahd Causeway toll fees takes into effect",
    "published_at": "2026-02-18T14:36:42+00:00",
    "author": "Saudi Gazette report",
    "summary": "DAMMAM — The King Fahd Causeway Authority has started implementing the revised toll fees from Wednesday, February 18. According to the new rates announced by the authority, the toll fee for cars and motorcycles will be SR35, while minibuses will cost SR55, large buses SR70, and trucks will be charged with SR7 per ton. The authority stated that the increase will not be applicable to students, persons with disabilities and daily frequent travelers. Previously, the bridge crossing fee was SR25 for small cars, after the authority raised it from SR20 in the beginning of 2016. This was for the first time the fee had been raised since the bridge was opened in 1986. The causeway authority recently announced the launch of new packages for travelers using the Causeway app, offering discounts of up to 40 percent on toll fees, effective from February 18. The authority explained that the new packages include three options. The Frequent Traveler Package offers a discount of up to 40 percent on toll fees and is designed for travelers who cross the bridge daily or almost daily. The package costs SR850 and is valid for one month or after 40 crossings (one way or return), whichever comes first.",
    "content_text": "DAMMAM — The King Fahd Causeway Authority has started implementing the revised toll fees from Wednesday, February 18. According to the new rates announced by the authority, the toll fee for cars and motorcycles will be SR35, while minibuses will cost SR55, large buses SR70, and trucks will be charged with SR7 per ton.\nThe authority stated that the increase will not be applicable to students, persons with disabilities and daily frequent travelers. Previously, the bridge crossing fee was SR25 for small cars, after the authority raised it from SR20 in the beginning of 2016. This was for the first time the fee had been raised since the bridge was opened in 1986.\nThe causeway authority recently announced the launch of new packages for travelers using the Causeway app, offering discounts of up to 40 percent on toll fees, effective from February 18. The authority explained that the new packages include three options. The Frequent Traveler Package offers a discount of up to 40 percent on toll fees and is designed for travelers who cross the bridge daily or almost daily. The package costs SR850 and is valid for one month or after 40 crossings (one way or return), whichever comes first.",
    "content_length": 1195,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://saudigazette.com.sa/rssFeed/0",
      "fetched_at": "2026-02-18T19:03:00.559227+00:00",
      "rss": {
        "published_at": "2026-02-18T14:36:42+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "15eca71f7e370ed1f15e7eba",
    "country": "SAUDI ARABIA",
    "source_name": "Saudi Gazette",
    "source_slug": "saudi_gazette",
    "url": "https://saudigazette.com.sa/article/659035/saudi-arabia/commerce-ministry-carries-out-over-37000-inspection-tours-for-ramadan",
    "title": "Commerce Ministry carries out over 37,000 inspection tours for Ramadan",
    "published_at": "2026-02-18T14:16:50+00:00",
    "author": "Saudi Gazette report",
    "summary": "RIYADH — The Ministry of Commerce has carried out over 37,000 inspection and supply monitoring visits across Saudi Arabia over the past two months to ensure the availability of essential goods for the Ramadan 1447 AH season. Targeting retail outlets, central markets, and gas stations along routes to Makkah and Madinah, these efforts verify regulatory compliance and prevent price manipulation. The ministry has deployed specialized teams to maintain a steady supply of Ramadan-related products and protect consumer interests throughout the holy month.",
    "content_text": "Commerce Ministry carries out over 37,000 inspection tours for Ramadan\nFebruary 18, 2026 | 05:16 PM\nThe Ministry of Commerce has carried out over 37,000 inspection and supply monitoring visits across Saudi Arabia over the past two months to ensure the availability of essential goods for the Ramadan 1447 AH season.\n3 minute read\nAA\nResizeRIYADH — The Ministry of Commerce has carried out over 37,000 inspection and supply monitoring visits across Saudi Arabia over the past two months to ensure the availability of essential goods for the Ramadan 1447 AH season.\nTargeting retail outlets, central markets, and gas stations along routes to Makkah and Madinah, these efforts verify regulatory compliance and prevent price manipulation. The ministry has deployed specialized teams to maintain a steady supply of Ramadan-related products and protect consumer interests throughout the holy month.",
    "content_length": 892,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://saudigazette.com.sa/rssFeed/0",
      "fetched_at": "2026-02-18T19:03:00.559259+00:00",
      "rss": {
        "published_at": "2026-02-18T14:16:50+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "c25840818632ec5371180e42",
    "country": "SAUDI ARABIA",
    "source_name": "Saudi Gazette",
    "source_slug": "saudi_gazette",
    "url": "https://saudigazette.com.sa/article/659034/saudi-arabia/maysan-elders-recall-ramadan-crescent-sightings-in-1930s-villages",
    "title": "Elderly residents in Maysan recall Ramadan crescent sightings of the 1930s",
    "published_at": "2026-02-18T14:01:53+00:00",
    "author": "Saudi Gazette",
    "summary": "MAYSAN — In the mountainous villages of Maysan Governorate, elderly residents recall memories of Ramadan in the 1930s when the start of the holy month was confirmed solely by the naked eye.Sharifah bint Atiyah Al-Thaqafi, nearly a century old and a resident of Lykah village in the Thaqif Center, recounted that long before modern technology and unified official announcements, the arrival of Ramadan was determined through direct visual sighting of the crescent moon. **media[2665037]** Speaking to the Saudi Press Agency during a visit to her village, Al-Thaqafi said that as sunset approached, men and their children would climb nearby elevations, including the peaks of the Shahdan Mountains, scanning the horizon for the first glimpse of the moon. Women remained at home preparing iftar and suhoor while awaiting confirmation in an atmosphere marked by quiet supplication.Once the crescent was sighted, celebrations echoed across the villages. Residents exchanged congratulations, lit firewood atop mountain summits and chanted takbir and poetry to relay the news to neighboring communities.The traditions, she said, reflected a strong social fabric rooted in cooperation and shared experience. The sighting of the crescent extended beyond a religious observance to become a unifying moment that set the rhythm for family gatherings, nightly prayers and communal iftar and suhoor meals throughout Ramadan.Today, methods for observing the crescent have evolved. Madis Al-Thaqafi, spokesperson for the Majardah Thaqif Astronomical Observatory, said that reliance on direct visual sighting has gradually been complemented by astronomical telescopes, digital imaging and specialized computational tools that provide greater precision in tracking the moon’s formation.Despite these advances, elders’ recollections in Maysan remain a living record of a time when religious practice was deeply interwoven with daily life.The tradition of crescent sighting continues to symbolize continuity between generations, linking present practices with longstanding customs that shaped the community’s collective identity in welcoming the holy month.",
    "content_text": "MAYSAN — In the mountainous villages of Maysan Governorate, elderly residents recall memories of Ramadan in the 1930s when the start of the holy month was confirmed solely by the naked eye.\nSharifah bint Atiyah Al-Thaqafi, nearly a century old and a resident of Lykah village in the Thaqif Center, recounted that long before modern technology and unified official announcements, the arrival of Ramadan was determined through direct visual sighting of the crescent moon.\nSpeaking to the Saudi Press Agency during a visit to her village, Al-Thaqafi said that as sunset approached, men and their children would climb nearby elevations, including the peaks of the Shahdan Mountains, scanning the horizon for the first glimpse of the moon. Women remained at home preparing iftar and suhoor while awaiting confirmation in an atmosphere marked by quiet supplication.\nOnce the crescent was sighted, celebrations echoed across the villages. Residents exchanged congratulations, lit firewood atop mountain summits and chanted takbir and poetry to relay the news to neighboring communities.\nThe traditions, she said, reflected a strong social fabric rooted in cooperation and shared experience. The sighting of the crescent extended beyond a religious observance to become a unifying moment that set the rhythm for family gatherings, nightly prayers and communal iftar and suhoor meals throughout Ramadan.\nToday, methods for observing the crescent have evolved. Madis Al-Thaqafi, spokesperson for the Majardah Thaqif Astronomical Observatory, said that reliance on direct visual sighting has gradually been complemented by astronomical telescopes, digital imaging and specialized computational tools that provide greater precision in tracking the moon’s formation.\nDespite these advances, elders’ recollections in Maysan remain a living record of a time when religious practice was deeply interwoven with daily life.\nThe tradition of crescent sighting continues to symbolize continuity between generations, linking present practices with longstanding customs that shaped the community’s collective identity in welcoming the holy month.",
    "content_length": 2124,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://saudigazette.com.sa/rssFeed/0",
      "fetched_at": "2026-02-18T19:03:00.559275+00:00",
      "rss": {
        "published_at": "2026-02-18T14:01:53+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "24dc33b8ccf4b7efe7616efb",
    "country": "SAUDI ARABIA",
    "source_name": "Saudi Gazette",
    "source_slug": "saudi_gazette",
    "url": "https://saudigazette.com.sa/article/659033/saudi-arabia/third-makkah-halal-forum-concludes-with-signing-of-15-strategic-cooperation-agreements",
    "title": "Third Makkah Halal Forum concludes with signing of 15 strategic cooperation agreements",
    "published_at": "2026-02-18T13:57:11+00:00",
    "author": "Saudi Gazette report",
    "summary": "MAKKAH — The third edition of the Makkah Halal Forum concluded at the Makkah Chamber of Commerce and Industry Exhibition and Events Center, drawing prominent international leaders and industry experts. The event marked a major transformation, evolving from a dialogue platform into a results-driven decision-making forum. It concluded with the signing of 15 strategic cooperation agreements between local and international entities, aimed at strengthening economic integration, unifying standards, enhancing product quality, and reinforcing the credibility of halal certification systems.The forum witnessed significant growth in participation, attracting thousands of visitors from around the world. A total of 170 exhibitors representing 15 countries showcased cutting-edge innovations and services across the halal value chain, highlighting the Saudi market’s growing investment appeal and its competitive, innovation-driven environment. In its closing recommendations, the forum reaffirmed its commitment to advancing the halal sector as an integrated global system that aligns ethical values with economic growth. It emphasized promoting responsible and sustainable development, strengthening transparency and standardization to build market trust, and expanding international cooperation and knowledge exchange. These efforts support the objectives of Saudi Vision 2030 and further solidify the Kingdom’s position as a leading global hub in the halal industry.",
    "content_text": "MAKKAH — The third edition of the Makkah Halal Forum concluded at the Makkah Chamber of Commerce and Industry Exhibition and Events Center, drawing prominent international leaders and industry experts.\nThe event marked a major transformation, evolving from a dialogue platform into a results-driven decision-making forum. It concluded with the signing of 15 strategic cooperation agreements between local and international entities, aimed at strengthening economic integration, unifying standards, enhancing product quality, and reinforcing the credibility of halal certification systems.\nThe forum witnessed significant growth in participation, attracting thousands of visitors from around the world. A total of 170 exhibitors representing 15 countries showcased cutting-edge innovations and services across the halal value chain, highlighting the Saudi market’s growing investment appeal and its competitive, innovation-driven environment.\nIn its closing recommendations, the forum reaffirmed its commitment to advancing the halal sector as an integrated global system that aligns ethical values with economic growth. It emphasized promoting responsible and sustainable development, strengthening transparency and standardization to build market trust, and expanding international cooperation and knowledge exchange. These efforts support the objectives of Saudi Vision 2030 and further solidify the Kingdom’s position as a leading global hub in the halal industry.",
    "content_length": 1467,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://saudigazette.com.sa/rssFeed/0",
      "fetched_at": "2026-02-18T19:03:00.559294+00:00",
      "rss": {
        "published_at": "2026-02-18T13:57:11+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "419e5425f52644bbb05dbfc3",
    "country": "SAUDI ARABIA",
    "source_name": "Saudi Gazette",
    "source_slug": "saudi_gazette",
    "url": "https://saudigazette.com.sa/article/659032/saudi-arabia/saudi-media-ministry-launches-94-overseas-scholarships-under-media-scholarship-track",
    "title": "Saudi Media Ministry allocates 94 overseas scholarships under public-private partnership program",
    "published_at": "2026-02-18T13:53:31+00:00",
    "author": "Saudi Gazette",
    "summary": "RIYADH — The Ministry of Media announced the allocation of 94 scholarship seats across academic and training programs in the United States, the United Kingdom, Canada and Spain under the Media Scholarship track (Wa’ed).Minister of Media Salman Al-Dossary on Wednesday sponsored the signing of cooperation agreements between the ministry and nine media companies, marking what officials described as a national model of public-private partnership aimed at investing in human capital and strengthening the media sector’s contribution to the national economy.The agreements signal a shift in the ministry’s role from a regulatory body to an enabler and growth catalyst by linking academic education and practical training to direct employment opportunities.The initiative seeks to raise the productivity of media companies and develop specialized Saudi talent capable of leading transformation in the media and creative industries.The agreements were signed with MBC Group, One Group, Al-Zhuhur Media, Hawadee, Shibh Al-Jazira, Salham, La’bah, Jathr Production and Waves.The program provides 94 seats distributed across various academic and training pathways, including 21 master’s seats in the United Kingdom, the United States and Spain; 56 bachelor’s seats in the United States and the United Kingdom; 11 diploma seats in Canada and Spain; and six training seats in the United States and Spain.Deputy Minister of Media for Media Sector Development Israa Assiri said the media industry has become a key driver of the creative economy, with value chains extending from production and distribution to technology, platform development and marketing.She said the Media Scholarship track enables companies to design programs aligned with their employment needs, ensuring closer alignment between educational outcomes and labor market requirements, while enhancing the sector’s sustainability and competitiveness locally and internationally.The agreements activate the Media Scholarship track launched at the end of the third quarter of 2025, supporting Vision 2030 goals to diversify the economy, increase the contribution of non-oil sectors and position the Kingdom as a regional hub for media and content production.Details of available programs and application procedures will be announced through the participating companies’ social media accounts, with submissions to be made via the Ministry of Education’s “Safeer” platform.",
    "content_text": "RIYADH — The Ministry of Media announced the allocation of 94 scholarship seats across academic and training programs in the United States, the United Kingdom, Canada and Spain under the Media Scholarship track (Wa’ed).\nMinister of Media Salman Al-Dossary on Wednesday sponsored the signing of cooperation agreements between the ministry and nine media companies, marking what officials described as a national model of public-private partnership aimed at investing in human capital and strengthening the media sector’s contribution to the national economy.\nThe agreements signal a shift in the ministry’s role from a regulatory body to an enabler and growth catalyst by linking academic education and practical training to direct employment opportunities.\nThe initiative seeks to raise the productivity of media companies and develop specialized Saudi talent capable of leading transformation in the media and creative industries.\nThe agreements were signed with MBC Group, One Group, Al-Zhuhur Media, Hawadee, Shibh Al-Jazira, Salham, La’bah, Jathr Production and Waves.\nThe program provides 94 seats distributed across various academic and training pathways, including 21 master’s seats in the United Kingdom, the United States and Spain; 56 bachelor’s seats in the United States and the United Kingdom; 11 diploma seats in Canada and Spain; and six training seats in the United States and Spain.\nDeputy Minister of Media for Media Sector Development Israa Assiri said the media industry has become a key driver of the creative economy, with value chains extending from production and distribution to technology, platform development and marketing.\nShe said the Media Scholarship track enables companies to design programs aligned with their employment needs, ensuring closer alignment between educational outcomes and labor market requirements, while enhancing the sector’s sustainability and competitiveness locally and internationally.\nThe agreements activate the Media Scholarship track launched at the end of the third quarter of 2025, supporting Vision 2030 goals to diversify the economy, increase the contribution of non-oil sectors and position the Kingdom as a regional hub for media and content production.\nDetails of available programs and application procedures will be announced through the participating companies’ social media accounts, with submissions to be made via the Ministry of Education’s “Safeer” platform.",
    "content_length": 2434,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://saudigazette.com.sa/rssFeed/0",
      "fetched_at": "2026-02-18T19:03:00.559307+00:00",
      "rss": {
        "published_at": "2026-02-18T13:53:31+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  }
]