[
  {
    "id": "e16b7f52985692b61ba5ac68",
    "country": "UNITED STATES",
    "source_name": "CBS News",
    "source_slug": "cbs_news",
    "url": "https://www.cbsnews.com/news/lake-erie-shipwreck-found-clough/",
    "title": "Lake Erie shipwreck identified in area where explorer died while diving",
    "published_at": "2026-02-18T18:55:03+00:00",
    "author": "Kerry Breen",
    "summary": "The wreck of the stone-hauling vessel is in the same area where the founder of the Cleveland Underwater Explorers died in 2024.",
    "content_text": "Lake Erie shipwreck identified in area where explorer died in diving accident\nA long-lost shipwreck has been identified in Lake Erie, the National Museum of the Great Lakes and the Cleveland Underwater Explorers said Wednesday. The wreck is in the same area where the founder of the exploration organization died in June 2024.\nThe wreck has been confirmed to be that of the Clough, a stone-hauling sailing vessel that was built in Ohio in 1867 and sank a year later, according to the museum. The ship was 125 feet long and 26.5 feet wide. It had three masts and was rigged with square sails. It was transporting stone when it sank on September 15, 1868, the museum said.\nThe museum shared photos that show the steering wheel and hull of the ship underwater, covered in growth.\nCleveland Underwater Explorers founder David VanZandt was working on the wreck's identification when he died, the museum said. CBS News reported that VanZandt, 70, was \"diving on a newly found shipwreck\" when he \"failed to return to the boat and suffered a fatal diving accident.\" The U.S. Coast Guard said its crews and state agencies helped search for VanZandt. Local divers were the ones to find his body, nearly four hours after he was reported missing.\nThe museum said that while the wreck site is \"associated with the tragic loss,\" it and the Cleveland Underwater Explorers were \"committed to completing the identification process with care, accuracy, and respect.\"\n\"This discovery represents both a significant chapter in Great Lakes maritime history and a meaningful continuation of David VanZandt's legacy,\" said Carrie Sowden, the director of archaeology and research at the National Museum of the Great Lakes in a news release.\nThe museum and the Cleveland Underwater Explorers have been locating and identifying shipwrecks in Lake Erie since 2001. Before confirming the identity of the Clough, they held several site visits, created a detailed map of the area and conducted \"extensive historical research,\" according to the museum.\nThe discovery will be detailed in a \"micro-exhibit\" highlighting the Clough and the identification process, the organizations said. The exhibit begins at the museum on Wednesday and will run until mid-April. The Cleveland Underwater Explorers said the display will offer \"a rare behind-the-scenes look at underwater exploration and historical research, connecting modern discovery with 19th-century Great Lakes commerce.\"",
    "content_length": 2442,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.cbsnews.com/latest/rss/main",
      "fetched_at": "2026-02-18T19:09:22.291273+00:00",
      "rss": {
        "published_at": "2026-02-18T18:55:03+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "e583bbd7cd026dd5d7df8fb6",
    "country": "UNITED STATES",
    "source_name": "CBS News",
    "source_slug": "cbs_news",
    "url": "https://www.cbsnews.com/news/todays-heloc-and-home-equity-loan-interest-rates-february-18-2026/",
    "title": "What are today's HELOC and home equity loan interest rates: February 18, 2026?",
    "published_at": "2026-02-18T18:47:19+00:00",
    "author": "Matt Richardson",
    "summary": "Want to borrow equity with a HELOC or home equity loan now? These are the interest rates you'll need to know first.",
    "content_text": "What are today's HELOC and home equity loan interest rates: February 18, 2026?\nThere are few cost-effective ways to borrow money in today's economy. Personal loans, long a reliable way to help make ends meet, now come with interest rates over 12% on average and possibly higher for those without good credit. Credit card interest rates, meanwhile, are comfortably over 20%, near a record high, and are unlikely to decline at any point soon. Neither, then, provides an affordable way to borrow money now, especially if you need a large, five-figure amount.\nHomeowners, however, have two cost-effective options worth exploring right now: home equity lines of credit (HELOCs) and home equity loans. Home equity levels in 2025 reached a record high, giving the average homeowner hundreds of thousands of dollars to leverage. And interest rates on both products are comfortably under 10% now, making either much cheaper than a personal loan or a credit card. If used for eligible home repair projects, the interest paid on either may also be tax-deductible. In other words, HELOCs and home equity loans offer homeowners two of the most affordable ways to borrow now (and may continue to in the future).\nBefore getting started, however, it helps to know what the interest rates are for both products. Below, we'll detail what to know right now.\nSee how much home equity you could borrow with a HELOC or loan online now.\nWhat are today's HELOC interest rates?\nThe average HELOC interest rate is 7.24% as of February 18, 2026, according to Money. If borrowers shop around online now, however, they may be able to find even lower rates. That said, it's important to note that HELOC interest rates are variable, meaning that they will change monthly for borrowers based on market conditions.\nBut while that may have been a significant drawback in the rising interest rate environment of recent years, it could be a positive feature now that interest rates are declining again. And with online marketplaces listing rates, lenders, terms and more in all one location, it may be easier than ever to compare your HELOC options now.\nSee how low your current HELOC rate offers are here.\nWhat are today's home equity loan interest rates?\nThe average home equity loan interest rate is 6.96% as of February 18, 2026, according to Money. That makes a home equity loan not only your cheapest way to borrow home equity right now but also one of the least expensive ways to borrow money overall. Unlike a HELOC, this rate is fixed, meaning that borrowers won't need to worry about any adverse changes that could cause their rate and payment to rise again.\nStill, home equity loan borrowers won't be able to exploit today's cooling rate climate the way they would with a HELOC, either, as they'll need to refinance their loan (and pay refinancing closing costs) to lock in a lower rate in the future. Carefully consider both options, then, and look beyond today's rates to best determine which product makes the most sense for you now and in the future.\nThe bottom line\nThe average HELOC interest rate is 7.24% as of February 18, 2026, while the median home equity loan interest rate stands at just 6.96%. With these being averages, however, and rates changing based on repayment terms, you may be able to secure more competitive rates by shopping around online now. Just remember, no matter which product you choose, to only borrow an amount that you can easily afford to repay. With your home serving as collateral in these exchanges, you must be able to make payments as agreed to in order to avoid foreclosure risks.",
    "content_length": 3596,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "LOW",
    "evidence_numeric": 25.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 28.75,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.cbsnews.com/latest/rss/main",
      "fetched_at": "2026-02-18T19:09:22.291294+00:00",
      "rss": {
        "published_at": "2026-02-18T18:47:19+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "c8ab8cace8ab7584738441bb",
    "country": "UNITED STATES",
    "source_name": "CBS News",
    "source_slug": "cbs_news",
    "url": "https://www.cbsnews.com/news/les-wexner-jeffrey-epstein-house-testimony/",
    "title": "Les Wexner, longtime Epstein benefactor, tells Congress he was \"duped\"",
    "published_at": "2026-02-18T18:43:17+00:00",
    "author": "Kaia Hubbard",
    "summary": "Billionaire retail tycoon Les Wexner testified before a House committee Wednesday as part of the panel's investigation into Jeffrey Epstein.",
    "content_text": "Les Wexner, longtime Epstein benefactor, tells Congress he was \"duped by a world-class con man\"\nWashington — Billionaire retail tycoon Les Wexner, a longtime benefactor of Jeffrey Epstein, told House lawmakers that he was \"duped by a world-class con man\" and knew nothing of Epstein's crimes, according to his prepared testimony before the House Oversight Committee.\nWexner, who hired Epstein to manage his money, was among members of Epstein's inner circle who were subpoenaed for testimony last month. Members of the Oversight Committee and staff members deposed Wexner behind closed doors in his home state of Ohio on Wednesday.\nWexner, 88, previously led the former parent company of Victoria's Secret and worked with Epstein beginning in the mid-1980s. In his prepared statement, which CBS News obtained, Wexner outlined how he cut ties with Epstein in the aftermath of Epstein's 2006 arrest. Documents show the two men stayed in touch, but Wexner said they never spoke again.\nWexner said he was pleased to testify before the panel Wednesday because it gave him the opportunity to \"set the record straight.\"\n\"Over the years, I have been the subject of outrageous untrue statements and hurtful rumor, innuendo, and speculation,\" Wexner said. \"Let me state from the start: I was naïve, foolish, and gullible to put any trust in Jeffrey Epstein. He was a con man. And while I was conned, I have done nothing wrong and have nothing to hide.\"\nWexner said he \"completely and irrevocably cut ties with Epstein\" almost 20 years ago after he learned about his abuse. He said he never witnessed or had knowledge of Epstein's \"criminal activity,\" nor was he a participant or co-conspirator in any illegal activities. Wexner said Epstein \"lived a double life,\" and that \"the side of Epstein that he chose to reveal to me was far different from the predator he eventually was exposed to be.\"\n\"To my enormous embarrassment and regret I, like many others, was duped by a world-class con man,\" Wexner said. \"I cannot undo that part of my personal history even as I regret ever having met him.\"\nDemocrats on the committee held a news conference during the deposition and expressed skepticism about Wexner's testimony. Rep. Stephen Lynch of Massachusetts claimed that much of the evidence within the Epstein files points to Wexner's involvement. He argued that Wexner \"gave Epstein credibility\" and the ability to \"commit some of the crimes that he did.\"\n\"In an investigation you usually follow the documents and you follow the money, and much of that evidence, and all of that money, leads us to this location,\" Lynch said.\nLynch said \"there was a deep trust between these two men.\" And while he acknowledged that there may be questions about whether Wexner \"was involved in the crimes directly,\" he said \"there is no question in my mind, given the evidence so far, that Les Wexner knew about this and failed to stop it and gave Epstein license and the ability to commit these crimes.\"\nStill, Rep. Jasmine Crockett, a Texas Democrat, said \"we are running into dead ends at this moment\" when it comes to following the money. She said once the record of the testimony is released, the public will \"most likely be left with more questions than answers.\"\n\"It is almost inconceivable to be missing the amounts of money that are missing and somehow Mr. Wexner [had] no idea,\" Crockett said.\nDemocratic Rep. Dave Min of California argued that Wexner's claim that he was not aware of Epstein's abuse is \"just not credible.\"\n\"I realize he's an elderly gentleman, memories fade,\" Min said. \"But the reputation of Jeffrey Epstein is very clear. Everyone around Jeffrey Epstein knew exactly what he was up to.\"\nRep. Robert Garcia of California, the top Democrat on the committee, said there were no Republican members of Congress at the deposition, though he said there were GOP staff members.\nThe deposition came after the Justice Department released more than 3 million pages of files related to Epstein under the Epstein Files Transparency Act. Last week, GOP Rep. Thomas Massie of Kentucky, who was among the lawmakers who led the push to force the release of the files, pointed to a 2019 FBI document that was initially redacted and referred to Wexner as a \"co-conspirator.\"\nMassie questioned Attorney General Pam Bondi about the redaction days later when she testified before the House Judiciary Committee. Bondi said that the Justice Department unredacted Wexner's name within 40 minutes of Massie raising the issue. She also said she believes Wexner's name was listed more than 4,000 times in the documents.\nWexner has not been charged with a crime and has long said he cut ties with Epstein after his crimes were made public. A legal representative for Wexner told CBS News that a federal prosecutor told Wexner's legal counsel that he was being viewed as a \"source of information about Epstein and was not a target in any respect.\"\n\"Mr. Wexner cooperated fully by providing background information on Epstein and was never contacted again,\" the representative said.\nGhislaine Maxwell, a longtime associate of Epstein's, testified before the panel last week. She invoked her Fifth Amendment right against self-incrimination and refused to answer questions.",
    "content_length": 5240,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 38.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.cbsnews.com/latest/rss/main",
      "fetched_at": "2026-02-18T19:09:22.291305+00:00",
      "rss": {
        "published_at": "2026-02-18T18:43:17+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "e97fe83bad4bf8a0056f7aa1",
    "country": "UNITED STATES",
    "source_name": "CBS News",
    "source_slug": "cbs_news",
    "url": "https://www.cbsnews.com/news/robert-duvall-the-cowboy-tango/",
    "title": "Robert Duvall: The Cowboy Tango",
    "published_at": "2026-02-18T18:16:05+00:00",
    "author": "Rita Braver; Ellen Crean",
    "summary": "Actor zeroes in on Westerns ... but he can dance, too.",
    "content_text": "Robert Duvall: The Cowboy Tango\nRobert Duvall won raves for \"The Great Santini\" back in 1979. From Marines to cowboys, Duvall can play just about any role — including, it turns out, gracious host, as CBS News Sunday Morning correspondent Rita Braver learned during a visit to his farm,\nYou can call him Duvall, or Bob, or Bobby. But his childhood nickname was Bodge.\n\"My brother couldn't say 'Bobby,' so he said 'Bodgy,'\" Duvall explains. \"My old man called me Bernie. That was another nickname. We were into nicknames.\"\nWith all those nicknames, it's no wonder that Duvall has been able to transform himself into so many characters in more than 80 films, including the overbearing Marine pilot in \"The Great Santini\"; an evangelist preacher in \"The Apostle\"; and Duvall's favorite role, Gus McCrae, the philosopher cowboy in \"Lonesome Dove,\" who could ride and shoot with the best of them,\nNow Duvall has made another epic Western called \"Broken Trail\" for the AMC network. This time, he plays a cowboy named Print Ritter who goes on a horse drive across the west with his nephew, played by Thomas Haden Church. Duvall describes the movie as a trip during which they \"pick people up along the way … kind of a character-driven piece of two men and their journey.\"\nThey even rescue a group of terrified Chinese immigrant girls from forced prostitution:\nIt was Duvall who came up with the idea for the movie, He is also executive producer, and says he exercised his right to re-edit the film, He thought the first version was exactly opposite of how he'd conceived of the story.\nWhat was \"the opposite vision,\" in his opinion?\n\"More gunfights, you know. More action, less emphasis on humor, less emphasis on behavior. And we got a lot of resistant but we did it, and 90 percent of what you see is our edit — my edit.\"\nFor 75-year-old Duvall, this project is especially important because he calls it the closing chapter of his Western trilogy, along with \"Lonesome Dove\" and the 2003 release \"Open Range.\"\nHe says he thinks the Western genre is important because \"it's ours. It's ours… It's American. The English have Shakespeare, the French have Moliere, the Russians have Chekhov. The Western is ours.\"\nBut despite his love of the West, Duvall makes his home in the rolling countryside of Virginia, on about 360 acres. \"It's not a lot in Texas,\" he says. \"It's a lot here, though. It's a lot here.\"\nDid he ever feel that not living in Hollywood means that he's not around the action and he might miss out on something?\n\"Well, sometimes,\" Duvall says. \"When you go to a party there, somebody will say, 'Oh, I got a part for you.' Nine times out of 10, it's all hot air. Sometimes being there all the time will lead to a part, but it doesn't really hurt.\"\nIn Virginia, he says, he's \"always, always thinking, 'What's next? What's next?'\"\nVirginia was one of many places Duvall spent time when he was growing up, His dad was in the Navy. In fact, it was his parents who suggested he go into acting. Duvall went to study in New York, where he hung out with other fledgling actors like Gene Hackman and Dustin Hoffman.\n\"I knew Gene. A wonderful guy,\" recalls Duvall. \"We'd look for jobs and then we'd end up forgetting the job and going to a 42nd Street double feature. Then Dustin came back and slept on his kitchen floor. And some of those were good times. But now, once you make it, I never see those guys… It's strange, it's strange.\"\nHe ended up doing well in theater and in television. But most Americans got to know Duvall through his film work. In 1962, in \"To Kill a Mockingbird,\" he played the role of Boo Radley, the neighborhood crazy man who turns out to be a hero.\nBut a decade later, after a string of other films, Duvall was cast as Tom Hagen, the family counselor in \"The Godfather,\" a role that earned him an Oscar nomination, He got another nod a few years later for playing Lt. Col Kilgore in \"Apocalypse Now,\" in which he delivered the famous line, \"I love the smell of napalm in the morning. It smells like victory.\"\nSays Duvall, \"People come up to me and say it to me as if they're the only ones in the world besides me that know that line.\"\nHe has had six Academy Award nominations in all. But the movie for which he won was \"Tender Mercies,\" in which he played Mac Sledge, a down-at-the-heels former country-western singer.\nHe sang every song himself. That was part of his deal.\n\"They were trying to get around it,\" says Duvall, \"but I said, \"No, no. This has to be part of it. You cannot dub later. I have to do that.' Yeah.\"\nTell him that people constantly refer to him as one of the great actors of our time, and Duvall counters, \"Well, that's all relative. It's a matter of opinion, you know.\"\nBut, when he looks at it objectively, he says, \"What makes what I do work? It's this, what we're doing right now: talking and listening. … That's the beginning and the end. The beginning and the end is to be simple.\"\nOn a personal level, life has not been so simple for Robert Duvall.\nSomehow, Braver points out to him, along with everything else, he found time to get married — a lot.\n\"Oh, I thought you meant in the movies,\" Duvall says. \"No. A lot? A lot? Yeah, well, I've lived a lot.\"\nHis fourth wife, 42 years his junior, is Luciana Pedraza. They met in Argentina, but it was he who got her interested in one of his favorite pastimes: tango, the Argentine national dance. He even cast her in his film, \"Assassination Tango,\" a film Duvall wrote and directed.\nThey tango well together — like professionals. Duvall points out that Pedrama once represented her province in the Miss Argentina competition and she won a category called \"Miss Elegance.\"\n\"They're big into elegance,\" Duvall says. \"Elegance is a word they still use there.\"\nMeanwhile, Duvall just keeps going.\n\"It's been a good career, a wonderful career. And it's not over yet… There's no drool to be wiped, you know, so I mean, I mean I got things I want to do,\" he says.\n\"It's like the line from 'Lonesome Dove,' hopefully: The older the violin, the sweeter the music.\"",
    "content_length": 6054,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 38.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.cbsnews.com/latest/rss/main",
      "fetched_at": "2026-02-18T19:09:22.291314+00:00",
      "rss": {
        "published_at": "2026-02-18T18:16:05+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "66cd4623bb4e9a47f84e5dc5",
    "country": "UNITED STATES",
    "source_name": "CBS News",
    "source_slug": "cbs_news",
    "url": "https://www.cbsnews.com/video/billionaire-les-wexner-to-testify-before-key-house-committee-as-part-of-epstein-probe/",
    "title": "Billionaire Les Wexner to testify before key House committee as part of Epstein probe",
    "published_at": "2026-02-18T18:16:00+00:00",
    "author": "CBS News",
    "summary": "Billionaire retail tycoon Les Wexner is set to testify Wednesday before the House Oversight and Government Reform Committee over his relationship with Jeffrey Epstein. CBS News' Taurean Small has more.",
    "content_text": "Billionaire Les Wexner to testify before key House committee as part of Epstein probe\nBillionaire retail tycoon Les Wexner is set to testify Wednesday before the House Oversight and Government Reform Committee over his relationship with Jeffrey Epstein. CBS News' Taurean Small has more.",
    "content_length": 287,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "LOW",
    "evidence_numeric": 25.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 28.75,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.cbsnews.com/latest/rss/main",
      "fetched_at": "2026-02-18T19:09:22.291324+00:00",
      "rss": {
        "published_at": "2026-02-18T18:16:00+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  }
]