[
  {
    "id": "b073a29cf974e62e7c75ad6e",
    "country": "UNITED STATES",
    "source_name": "CNN",
    "source_slug": "cnn",
    "url": "https://www.cnn.com/2023/04/18/health/teen-misuse-adhd-meds-wellness/index.html",
    "title": "ADHD medication abuse in schools is a 'wake-up call'",
    "published_at": "2023-04-25T17:44:36+00:00",
    "author": "Sandee LaMotte",
    "summary": "At some middle and high schools in the United States, 1 in 4 teens report they've abused prescription stimulants for attention deficit hyperactivity disorder during the year prior, a new study found.",
    "content_text": "At some middle and high schools in the United States, 1 in 4 teens report they’ve abused prescription stimulants for attention deficit hyperactivity disorder during the year prior, a new study found.\n“This is the first national study to look at the nonmedical use of prescription stimulants by students in middle and high school, and we found a tremendous, wide range of misuse,” said lead author Sean Esteban McCabe, director of the Center for the Study of Drugs, Alcohol, Smoking and Health at the University of Michigan in Ann Arbor.\n“In some schools there was little to no misuse of stimulants, while in other schools more than 25% of students had used stimulants in nonmedical ways,” said McCabe, who is also a professor of nursing at the University of Michigan School of Nursing. “This study is a major wake-up call.”\nNonmedical uses of stimulants can include taking more than a normal dose to get high, or taking the medication with alcohol or other drugs to boost a high, prior studies have found.\nStudents also overuse medications or “use a pill that someone gave them due to a sense of stress around academics — they are trying to stay up late and study or finish papers,” said pediatrician Dr. Deepa Camenga, associate director of pediatric programs at the Yale Program in Addiction Medicine in New Haven, Connecticut.\n“We know this is happening in colleges. A major takeaway of the new study is that misuse and sharing of stimulant prescription medications is happening in middle and high schools, not just college,” said Camenga, who was not involved with the study.\nWide range of abuse\nPublished Tuesday in the journal JAMA Network Open, the study analyzed data collected between 2005 and 2020 by Monitoring the Future, a federal survey that has measured drug and alcohol use among secondary school students nationwide each year since 1975.\nIn the data set used for this study, questionnaires were given to more than 230,000 teens in eighth, 10th and 12th grades in a nationally representative sample of 3,284 secondary schools.\nSchools with the highest rates of teens using prescribed ADHD medications were about 36% more likely to have students misusing prescription stimulants during the past year, the study found. Schools with few to no students currently using such treatments had much less of an issue, but it didn’t disappear, McCabe said.\n“We know that the two biggest sources are leftover medications, perhaps from family members such as siblings, and asking peers, who may attend other schools,” he said.\nSchools in the suburbs in all regions of the United States except the Northeast had higher rates of teen misuse of ADHD medications, as did schools where typically one or more parent had a college degree, according to the study.\nSchools with more White students and those who had medium levels of student binge drinking were also more likely to see teen abuse of stimulants.\nOn an individual level, students who said they had used marijuana in the past 30 days were four times as likely to abuse ADHD medications than teens who did not use weed, according to the analysis.\nIn addition, adolescents who said they used ADHD medications currently or in the past were about 2.5% more likely to have misused the stimulants when compared with peers who had never used stimulants, the study found.\n“But these findings were not being driven solely by teens with ADHD misusing their medications,” McCabe said. “We still found a significant association, even when we excluded students who were never prescribed ADHD therapy.”\nData collection for the study was through 2020. Since then, new statistics show prescriptions for stimulants surged 10% during 2021 across most age groups. At the same time, there has been a nationwide shortage of Adderall, one of the most popular ADHD drugs, leaving many patients unable to fill or refill their prescriptions.\nDangers of misuse\nThe stakes are high: Taking stimulant medications improperly over time can result in stimulant use disorder, which can lead to anxiety, depression, psychosis and seizures, experts say.\nIf overused or combined with alcohol or other drugs, there can be sudden health consequences. Side effects can include “paranoia, dangerously high body temperatures, and an irregular heartbeat, especially if stimulants are taken in large doses or in ways other than swallowing a pill,” according to the Substance Abuse and Mental Health Services Administration.\nResearch has also shown people who misuse ADHD medications are highly likely to have multiple substance use disorders.\nAbuse of stimulant drugs has grown over the past two decades, experts say, as more adolescents are diagnosed and prescribed those medications — studies have shown 1 in every 9 high school seniors report taking stimulant therapy for ADHD, McCabe said.\nFor children with ADHD who use their medications appropriately, stimulants can be effective treatment. They are “protective for the health of a child,” Camenga said. “Those adolescents diagnosed and treated correctly and monitored do very well — they have a lower risk of new mental health problems or new substance use disorders.”\nWhat parents and caregivers can do\nThe solution to the problem of stimulant misuse among middle and high school teens isn’t to limit use of the medications for the children who really need them, McCabe stressed.\n“Instead, we need to look very long and hard at school strategies that are more or less effective in curbing stimulant medication misuse,” he said. “Parents can make sure the schools their kids attend have safe storage for medication and strict dispensing policies. And ask about prevalence of misuse — that data is available for every school.”\nFamilies can also help by talking to their children about how to handle peers who approach them wanting a pill or two to party or pull an all-night study session, he added.\n“You’d be surprised how many kids do not know what to say,” McCabe said. “Parents can role-play with their kids to give them options on what to say so they are ready when it happens.”\nParents and guardians should always store controlled medications in a lockbox, and should not be afraid to count pills and stay on top of early refills, he added.\n“Finally, if parents suspect any type of misuse, they should contact their child’s prescriber right away,” McCabe said. “That child should be screened and assessed immediately.”",
    "content_length": 6395,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 10.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 11.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "http://rss.cnn.com/rss/cnn_topstories.rss",
      "fetched_at": "2026-02-18T19:07:40.278436+00:00",
      "rss": {
        "published_at": "2023-04-25T17:44:36+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "e179a946b0bd317d38b98d12",
    "country": "UNITED STATES",
    "source_name": "CNN",
    "source_slug": "cnn",
    "url": "https://www.cnn.com/2023/04/18/us/benadryl-tiktok-challenge-teen-death-wellness/index.html",
    "title": "A 13-year-old dies after participating in a Benadryl TikTok 'challenge'",
    "published_at": "2023-04-19T15:01:06+00:00",
    "author": "Michelle Watson; Carma Hassan",
    "summary": "A 13-year-old in Ohio has died after \"he took a bunch of Benadryl,\" trying a dangerous TikTok challenge that's circulating online, according to a CNN affiliate and a GoFundMe account from his family.",
    "content_text": "A 13-year-old in Ohio has died after “he took a bunch of Benadryl,” trying a dangerous TikTok challenge that’s circulating online, according to a CNN affiliate and a GoFundMe account from his family.\nJacob Stevens was participating in a TikTok challenge with some friends at home when he ingested the antihistamine, the family donation account states. Jacob was on a ventilator for almost a week before he died, according to WSYX.\nCNN has not independently confirmed his cause of death.\nOverdosing on Benadryl can result in “serious heart problems, seizures, coma, or even death,” the US Food and Drug Administration said in a 2020 warning to the public about the deadly “Benadryl Challenge” on TikTok.\nJacob’s grandmother is doing anything she can “to make sure another child doesn’t go through” with the challenge, she told CNN affiliate WSYX.\nIn a statement to CNN, TikTok said, “Our deepest sympathies go out to the family. At TikTok, we strictly prohibit and remove content that promotes dangerous behavior with the safety of our community as a priority. We have never seen this type of content trend on our platform and have blocked searches for years to help discourage copycat behavior. Our team of 40,000 safety professionals works to remove violations of our Community Guidelines and we encourage our community to report any content or accounts they’re concerned about.”\nThe maker of Benadryl, Johnson & Johnson, has called the challenge “dangerous.”\n“We understand that consumers may have heard about an online ‘challenge’ involving the misuse or abuse of diphenhydramine,” the undated online statement reads.\n“The challenge, which involves ingestion of excessive quantities of diphenhydramine, is a dangerous trend and should be stopped immediately. BENADRYL® products and other diphenhydramine products should only be used as directed by the label.”\n“We are working with TikTok and other social platforms to remove content that showcases this behavior,” the statement added. “We will look to partner across industry and with key stakeholders to address this dangerous behavior.”\nCNN has reached out to the Stevens family and Columbus Public Health for comment.\nThe FDA’s 2020 warning said the agency had “contacted TikTok and strongly urged them to remove the videos from their platform and to be vigilant to remove additional videos that may be posted.”\nBenadryl is an antihistamine used to treat symptoms such as a runny nose or sneezing from upper respiratory allergies, hay fever or the common cold. It’s safe and effective when used as recommended, the FDA said.\n“Diphenhydramine is marketed under the brand-name Benadryl, store brands, and generics. It is also available in combination with pain relievers, fever reducers, and decongestants,” the agency said.\nConsumers and parents should store Benadryl and other over-the-counter medications and prescription medicines out of the reach of children, the FDA said.\nCNN’s Jamie Gumbrecht and Travis Nichols contributed to this report.",
    "content_length": 3001,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 10.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 11.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "http://rss.cnn.com/rss/cnn_topstories.rss",
      "fetched_at": "2026-02-18T19:07:40.278388+00:00",
      "rss": {
        "published_at": "2023-04-19T15:01:06+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "86009017859e06fb4814353a",
    "country": "UNITED STATES",
    "source_name": "CNN",
    "source_slug": "cnn",
    "url": "https://www.cnn.com/business/live-news/fox-news-dominion-trial-04-18-23/index.html",
    "title": "Some on-air claims about Dominion Voting Systems were false, Fox News acknowledges in statement after deal is announced",
    "published_at": "2023-04-19T12:44:51+00:00",
    "author": "Catherine Thorbecke; Mike Hayes; Maureen Chowdhury; Marshall Cohen; Oliver Darcy; Jon Passantino; Elise Hammond; Tori B Powell; CNN’s Danny Freeman; CNN’s Liam Reilly; Laura Dolan; Analysis; CNN's Nicki Brown; Delaware; CNN's Ramishah Maruf; Liam Reilly; CNN's Eric Levenson",
    "summary": null,
    "content_text": "Fox News agrees to pay $787.5 million to settle defamation lawsuit with Dominion Voting Systems\n02:50\nWhat we covered here\nFox News will pay more than $787 million to Dominion Voting Systems after the sides hammered out a last-minute settlement Tuesday in the explosive defamation case launched against the right-wing network.\nFox acknowledged the court’s rulings finding “certain claims about Dominion to be false.” However, the network will not have to admit on air that it spread election lies, a Dominion rep said.\nBy settling, influential Fox executives and prominent on-air personalities will be spared from testifying about their 2020 election coverage, which was filled with lies about voter fraud.\nDominion also has pending lawsuits against right-wing networks Newsmax and OAN, as well as against Trump allies Rudy Giuliani, Sidney Powell and Mike Lindell.\nOur live coverage has ended. Follow the latest US media news hereor read about today’s settlement in the updates below.\n39 Posts\nHere's the ruling about Fox's on-air lies it acknowledged after settling defamation case\nFrom CNN's Marshall Cohen\nPeople walk by the News Corporation headquarters, home to Fox News, on April 18, in New York City.\n(Spencer Platt/Getty Images)\nIn a statement made Tuesday after Fox News settled the defamation case brought by Dominion Voting Systems, Fox said:\n“We acknowledge the Court’s rulings finding certain claims about Dominion to be false.”\nSo, what did those rulings say?\nThis is about the topic of falsity. To win a defamation case, you need to prove a few things. Most importantly, you need to prove the statements were false and that they were made with actual malice, otherwise known as a reckless disregard for the truth.\nIn a major pretrial ruling on March 31, Delaware Superior Court Judge Eric Davis ruled Dominion had successfully proven that all 20 statements mentioned in its lawsuit against Fox were false.\nLink Copied!\nFox settlement papers were signed minutes before announcement, Dominion lawyer says\nFrom CNN’s Danny Freeman\nDominion Voting Systems’ co-lead counsel Justin Nelson said he and Dominion’s other attorneys were expecting to go to trial against Fox News on Tuesday.\nThe final deal to settle the case with the right-wing network for $787.5 million came late in the day, and the settlement papers with Fox were signed just “minutes” before the agreement was announced, he said.\nPrior to the last-minute settlement, Nelson told CNN he and other attorneys had been preparing opening statements – even during the two-and-a-half-hour courtroom delay after the lunch recess.\nLink Copied!\nHere's how it looked inside the courtroom during the Fox vs Dominion case today\nFox News will pay more than $787 million to Dominion Voting Systems after lawyers from both sides hammered out a last-minute settlement of the defamation case launched against the right-wing network.\nThe deal was announced hours after the jury was sworn in at the Delaware Superior Court. Rumors of a settlement swirled in the courthouse when, after a lunch break, the proceedings dramatically ground to a halt for nearly three hours with no explanation, while the parties apparently hammered out an accord.\nCNN’s Bill Hennessy, court sketch artist, captured scenes from inside the courtroom:\nDelaware Superior Court Judge Eric Davis, center, with Dominion attorney Justin Nelson, left, and Fox attorney Dan Webb, right.\n(Sketch by Bill Hennessy)\nMembers of the public are seen in the foreground, with Delaware Superior Court Judge Eric Davis on the far right. On the left are smudged glass panels to obscure the jurors and protect their identity.\n(Sketch by Bill Hennessy)\nLawyers for both sides talk amongst themselves. Lawyers for Dominion are seated on the left side of the room, with Fox's lawyers on the right.\n(Sketch by Bill Hennessy)\nDan Webb, attorney for Fox, looks at his phone.\n(Sketch by Bill Hennessy)\nLink Copied!\nFox News settlement is the first time anyone has \"paid the price\" for election lies, Dominion's lead counsel says\nJustin Nelson, Dominion's lead counsel, appears on CNN.\n(CNN)\nDominion Voting Systems had two goals in its defamation case against Fox News — accountability and “trying to make Dominion whole,” said Justin Nelson, the lead counsel election technology company.\nBoth were accomplished in this settlement, he told CNN on Tuesday.\nThe payment of more than $787 million by Fox News to Dominion and the network’s statement acknowledging that its coverage of the 2020 election was false was “a strong message of accountability” and an important victory for the employees of his client’s company.\nWhile the settlement does not stipulate that Fox’s anchors must acknowledge the lies on air, Nelson said it was a consequential outcome for the network.\nThe texts and emails that emerged during the litigation process from inside the Fox network were valuable, he said. “And what today has shown is that you have to pay a price if you’re telling lies.”\nPrevious court filings revealed messages that showed that the most prominent stars and highest-ranking executives at Fox News privately ridiculed claims of election fraud in the 2020 election, despite the right-wing channel allowing lies about the presidential contest to be promoted on its air.\nHe said the settlement with Fox sends a “strong message” to other right-wing outlets in which Dominion has ongoing legal disputes.\nLink Copied!\nFox-Dominion defamation settlement is largest involving US media company\nFrom CNN's Jon Passantino\nFox News’ payment of $787.5 million to Dominion Voting Systems is the largest publicly known defamation settlement in US history involving a media company.\nNotably, in 2017, ABC News paid $177 million after its years-long legal dispute with South Dakota-based meat processor Beef Products Inc. over its textured meat product that the network referred to as “pink slime.”\nAt the time, the settlement was believed to be the biggest amount ever paid in a media defamation case in the United States.\nLink Copied!\nFox anchors not required to acknowledge lies told about Dominion as part of settlement, Dominion rep says\nFrom CNN’s Oliver Darcy\nFox News anchors will not have to acknowledge on-air that it told election lies about Dominion Voting Systems as part of the terms of its settlement, a representative for the election technology company told CNN.\nFox News did acknowledge in its statement that falsehoods were broadcast.\nBut top anchors at the right-wing talk channel will not be required as part of the settlement to acknowledge on air the lies broadcast in the wake of the 2020 election.\nLink Copied!\n\"Fox has admitted to telling lies,\" Dominion CEO says\nFrom CNN's Jon Passantino\nDominion CEO John Poulos, joined by members of the Dominion Voting Systems legal team, speaks outside the Leonard Williams Justice Center in Wilmington, Delaware, on April 18.\n(Andrew Caballero-Reynolds/AFP/Getty Images)\n“Fox has admitted to telling lies about Dominion,” said the company CEO John Poulos on Tuesday, following the last-minute $787.5 million settlement with the right-wing network.\nLink Copied!\nSmartmatic says its pending case will further expose Fox News' wrongdoing after Dominion settlement\nFrom CNN's Jon Passantino\nSmartmatic representative demonstrates his company's system on August 30, 2018, at a meeting of the Secure, Accessible & Fair Elections Commission in Grovetown, Georgia.\n(Bob Andres/Atlanta Journal-Constitution/AP/FILE)\nSmartmatic, the voting technology company that is suing Fox News for $2.7 billion for defamation said its pending case will further expose wrongdoing by the right-wing network, following the last-minute settlement in the case brought by Dominion Voting Systems.\nLink Copied!\nDominion attorney says settlement represents a \"ringing endorsement for truth and accountability\"\nFrom CNN’s Liam Reilly and Laura Dolan\nAttorney Justin Nelson\n(Matt Rourke/AP)\nThe settlement for more than $787 million with Fox News represents “a ringing endorsement for truth and accountability,” the attorney representing Dominion Voting Systems said Tuesday.\nNelson said that more than two years ago a “torrent of lies” had swept Dominion and election officials across America, causing “grievous harm to Dominion and the country.”\nNelson also said the country must “remain ever vigilant to find common ground.”\n“For our democracy to endure for another 250 years and, hopefully much longer, we must share a commitment to facts,” Nelson added.\nLink Copied!\nAnalysis: This is an unequivocal rebuke of Fox News\nAnalysis From CNN's Elie Honig\nDaniel Webb, lawyer for Fox News, center, leaves the Leonard Williams Justice Center in Wilmington, Delaware, on April 18.\n(Andrew Caballero-Reynolds/AFP/Getty Images)\nThe $787.5 million settlement in the Fox-Dominion case is an unequivocal rebuke of the right-wing news network and its journalism, said Elie Honig, former assistant US attorney for the Southern District of New York.\n“Translated it means we got caught lying by the judge – and I think that’s exactly why we are seeing this absolutely jaw-dropping number,” Honig told CNN’s Jake Tapper.\nAlthough the amount is about half of what Dominion was asking for, it’s still an astonishing sum, he said.\nLink Copied!\nDominion still has pending lawsuits against election deniers such as Rudy Giuliani and Sidney Powell\nFrom CNN's Marshall Cohen\nDominion Voting Systems still has pending lawsuits against right-wing networks Newsmax and OAN, as well as against Trump allies Rudy Giuliani, Sidney Powell and Mike Lindell.\nAll of these parties and entities deny wrongdoing and are fighting the lawsuits.\nLink Copied!\n\"Fox has admitted to telling lies,\" Dominion CEO says\nFrom CNN's Nicki Brown\nJohn Poulos, the CEO of Dominion Voting Systems\n(CNN)\nFollowing the announcement of a $787.5 million dollar settlement in the Fox News-Dominion case, John Poulos, the CEO of Dominion Voting Systems, said Fox News “admitted to telling lies” about the company.\n“Nothing can ever make up for that,” Poulos added at a news conference following court.\n“I cannot thank the election officials that we serve enough. Without them, there is no democracy,” he said.\nLink Copied!\nOn-air claims about Dominion Voting Systems were false, Fox News says in statement\nFrom CNN's Jon Passantino\nFox News has issued a statement on its settlement with Dominion Voting Systems acknowledging that some of the right-wing network’s on-air statements about Dominion were false.\nFor context: The statement was referring to Judge Eric Davis’ recent ruling that 20 Fox News broadcasts from late 2020 contained blatantly untrue assertions that Dominion rigged the presidential election. But Fox won’t have to admit on-air that it spread lies about Dominion, a Dominion representative told CNN.\nLink Copied!\nFox News-Dominion settlement totals more than $787 million, Dominion lawyer says\nFrom CNN's Nicki Brown\nDominion attorney Justin Nelson speaks during a press conference.\n(CNN)\nThe settlement between Fox News and Dominion Voting Systems totals $787,500,000, according to Dominion attorney Justin Nelson.\nThe settlement represents “vindication and accountability,” Nelson said in a news conference Tuesday afternoon.\n“The truth matters, lies have consequences,” Nelson said\n“Over two years ago, a torrent of lies swept Dominion and election officials across America into an alternative universe of conspiracy theories, causing grievous harm,” Nelson added.\nLink Copied!\nJudge praises lawyers from both sides as Fox-Dominion case ends\nFrom CNN's Marshall Cohen\nJudge Eric Davis (center) depicted earlier today in an artist sketch before finishing jury selection in the Delaware Superior Court.\n(Elizabeth Williams/AP)\nDelaware Superior Court Judge Eric Davis praised both sides after they abruptly settled the defamation case between Fox News and Dominion Voting Systems at the last second.\nHe said, “I have been on the bench since 2010… I think this is the best lawyering I’ve had, ever.”\n“I would be proud to be your judge in the future,” Davis said, his final words before leaving the bench.\nThe hearing is now over. The case is now over.\nLink Copied!\nJUST IN: Settlement has been reached in Fox-Dominion defamation case\nFrom CNN's Marshall Cohen\nReporters and members of the public outside of the Leonard Williams Justice Center where Dominion Voting Systems is suing Fox News in Delaware Superior Court today in Wilmington, Delaware.\n(Chip Somodevilla/Getty Images)\nA last-second settlement has been reached in Dominion Voting Systems’ historic defamation lawsuit against Fox News, the parties announced Tuesday in court.\nThe settlement was apparently brokered while the trial was on the brink of opening statements in Wilmington, Delaware.\nAfter swearing in the jury earlier Tuesday, an unexplained hours-long delay paused proceedings in court, which yet again triggered rampant speculation that a deal was quietly in the works.\nWhat this means: The last-minute deal means the closely watched case is effectively over and won’t proceed to trial. By settling with Dominion, influential Fox News executives and prominent on-air personalities will be spared from testifying about their 2020 election coverage, which was filled with lies about voter fraud.\nDetails of the settlement were not immediately available and might never become public.\nMore on the case: In its lawsuit, Dominion sought $1.6 billion in damages from Fox News. The right-wing network argued vociferously in pretrial proceedings that this number was inflated and didn’t come close to accurately capturing the potential losses that Dominion could have suffered as a result of Fox’s 2020 broadcasts.\nFox News and Fox Corporation — its parent company, which was also a defendant — say they never defamed Dominion, and say the case is a meritless assault on press freedoms. They denied Dominion’s claim that they promoted these election conspiracies to save their falling ratings after the 2020 election.\nWhile the Dominion case is now over, Fox News is still facing a second major defamation lawsuit from Smartmatic, another voting technology company that was smeared on Fox shows after the 2020 election. That case is still in the discovery process, and a trial isn’t expected anytime soon.\nLink Copied!\nCourt back in session after unexplained delay of more than two hours\nFrom CNN's Marshall Cohen in Wilmington, Delaware\nThe Fox-Dominion trial has resumed, after an unexplained delay of more than two hours.\nLink Copied!\nFox and Dominion lawyers briefly huddle in court as delay drags on\nFrom CNN's Marshall Cohen in Wilmington, Delaware\nFox News attorney Dan Webb (left) and Justin Nelson, attorney for Dominion Voting Systems (right), as they arrived with their legal teams outside of the Delaware Superior Court in Wilmington earlier today.\nThe unexplained delay in the Fox News-Dominion defamation trial has surpassed 90 minutes.\nMoments ago in court, CNN observed a top Fox lawyer showing a piece of paper —presumably a note — to a top Dominion lawyer.\nA few minutes later, they both stepped out of the courtroom, into a private, secured area for court staff. Moments later, they walked back into court together. It is not known what they privately discussed, if anything.\nThe lawyers — Fox attorney Dan Webb and Dominion attorney Justin Nelson —subsequently huddled at Dominion’s table for a few minutes, in public view. They were talking to each other, but it is not known what they are saying.\nBoth men are now sitting at their respective tables, looking at their phones.\nJudge formally names special master to investigate whether Fox withheld evidence from Dominion\nFrom CNN's Marshall Cohen in Wilmington, Delaware\nDelaware Superior Court Judge Eric Davis has formally named a special master to investigate whether Fox News withheld evidence from Dominion Voting Systems, according to court filings.\nCNN reported last week that the judge was likely to launch this inquiry, which revolves around whether Fox intentionally suppressed evidence that it was legally obligated to provide to Dominion. The dispute escalated after audiotapes emerged of Fox host Maria Bartiromo talking to Rudy Giuliani in 2020.\nThe order, which was posted on the docket earlier in the day as jury selection began in the trial, directed attorney John Elzufon to lead the inquiry. Elzufon previously served as special master to handle routine evidentiary issues in the case.\nElzufon is required to finish his probe and submit a report by May 15.\nThe judge’s order indicates that the special master has the power to take depositions as part of his inquiry – and the special master will be allowed to depose anyone he thinks is appropriate.\nFox is required to pay for all expenses related to the investigation, according to Davis’ order.\nFox lawyers say they never withheld anything from Dominion, and that when new evidence emerged at a late stage, they turned it over as quickly as possible.\nLink Copied!\nFox-Dominion trial has not yet moved to opening statements after unexplained slowdown in proceedings\nFrom CNN's Marshall Cohen in Wilmington, Delaware\nA general view of the Leonard L. Williams Justice Center in Wilmington, Delaware, as media members stand outside, on April 18.\n(Mark Makela/Reuters)\nThe court in the Dominion-Fox defamation trial reconvened as planned at 1:30 p.m. ET in Wilmington, Delaware, after a lunch break, but there has been an unexplained slowdown in the proceedings.\nThe trial has not yet moved to opening statements, though that is expected next.\nLawyers for both sides have been present in the courtroom since things reconvened about one hour ago.\nThey have been looking at their phones, talking among their colleagues and waiting.",
    "content_length": 17721,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 10.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 16.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "http://rss.cnn.com/rss/cnn_topstories.rss",
      "fetched_at": "2026-02-18T19:07:40.278262+00:00",
      "rss": {
        "published_at": "2023-04-19T12:44:51+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "e5484aa249200bdb59936b2f",
    "country": "UNITED STATES",
    "source_name": "CNN",
    "source_slug": "cnn",
    "url": "https://www.cnn.com/2023/04/18/politics/us-warns-russia-zaporizhzhia-nuclear-plant/index.html",
    "title": "US warns Russia not to touch American nuclear technology at Ukrainian nuclear plant",
    "published_at": "2023-04-19T08:35:33+00:00",
    "author": "Natasha Bertrand; Tim Lister",
    "summary": "The US has sensitive nuclear technology at a nuclear power plant inside Ukraine and is warning Russia not to touch it, according to a letter the US Department of Energy sent to Russia's state-owned nuclear energy firm Rosatom last month.",
    "content_text": "The US has sensitive nuclear technology at a nuclear power plant inside Ukraine and is warning Russia not to touch it, according to a letter the US Department of Energy sent to Russia’s state-owned nuclear energy firm Rosatom last month.\nIn the letter, which was reviewed by CNN and is dated March 17, 2023, the director of the Energy Department’s Office of Nonproliferation Policy, Andrea Ferkile, tells Rosatom’s director general that the Zaporizhzhia Nuclear Power Plant in Enerhodar “contains US-origin nuclear technical data that is export-controlled by the United States Government.”\nGoods, software and technology are subject to US export controls when it is possible for them to be used in a way that undermines US national security interests.\nThe Energy Department letter comes as Russian forces continue to control the plant, which is the largest nuclear power station in Europe and sits in a part of the Zaporizhzhia region that Russia occupied after its invasion of Ukraine last February. The plant has frequently been disconnected from Ukraine’s power grid due to intense Russian shelling in the area, raising fears across Europe of a nuclear accident.\nWhile the plant is still physically operated by Ukrainian staff, Rosatom manages it. The Energy Department warned Rosatom in the letter that it is “unlawful” for any Russian citizens or entities to handle the US technology.\nCNN has reached out to Rosatom for comment.\n“It is unlawful under United States law for non-authorized persons, including, but not limited to, Russian citizens and Russian entities,” the letter says, “such as Rosatom and its subsidiaries, to knowingly and willfully access, possess, control, export, store, seize, review, re-export, ship, transfer, copy, manipulate such technology or technical data, or direct, or authorize others to do the same, without such Russian entities becoming authorized recipients by the Secretary of the US Department of Energy.”\nIt is not clear whether Rosatom has responded to the letter. The Energy Department’s National Nuclear Security Administration told CNN in a statement that the letter is authentic.\nThe letters were first reported by the news outlet RBC Ukraine.\n“The Department of Energy’s National Nuclear Security Administration can confirm that the letter is legitimate,” said Shayela Hassan, the deputy director of public affairs for the National Nuclear Security Administration.\nShe added: “The Secretary of Energy has the statutory responsibility for authorizing the transfer of unclassified civilian nuclear technology and assistance to foreign atomic energy activities. DOE does not comment on regulatory activities.”\nAnother letter from Ferkile to the Energy Department’s Inspector General, reviewed by CNN and dated October 24, 2022, outlines the technology the US has exported to Ukraine for use in the Zaporizhzhia plant and reiterates that the department has “no record of any current authorization to transfer this technology and technical data to any Russian national or entity.”\nThe Energy Department’s Office of Nuclear Energy has been public about the US’ support for the plant, and stated on its website in June 2021 that “the United States helped implement new maintenance procedures and operations at the reactor that should ultimately strengthen energy security” in Ukraine.\nCORRECTION: A previous version of this story misattributed the news outlet that first reported the letters. It was RBC Ukraine.",
    "content_length": 3455,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 10.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 16.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "http://rss.cnn.com/rss/cnn_topstories.rss",
      "fetched_at": "2026-02-18T19:07:40.278522+00:00",
      "rss": {
        "published_at": "2023-04-19T08:35:33+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "dbe33fde25885a061c8d90b9",
    "country": "UNITED STATES",
    "source_name": "CNN",
    "source_slug": "cnn",
    "url": "https://www.cnn.com/2023/04/18/media/fox-dominion-settlement/index.html",
    "title": "Judge in Fox News-Dominion defamation trial: 'The parties have resolved their case'",
    "published_at": "2023-04-19T08:28:17+00:00",
    "author": "Marshall Cohen; Oliver Darcy",
    "summary": "The judge just announced in court that a settlement has been reached in the historic defamation case between Fox News and Dominion Voting Systems.",
    "content_text": "Fox News reached a last-second settlement with Dominion Voting Systems on Tuesday as the case raced toward opening statements, paying more than $787 million to end a colossal two-year legal battle that publicly shredded the right-wing network’s credibility.\nFox News’ $787.5 million settlement with Dominion Voting Systems is the largest publicly known defamation settlement in US history involving a media company.\nThe deal was announced hours after the jury was sworn in at the Delaware Superior Court. Rumors of a settlement swirled in the courthouse when, after a lunch break, the proceedings dramatically ground to a halt for nearly three hours with no explanation, while the parties apparently hammered out an accord.\n“The parties have resolved their case,” Judge Eric Davis said, before dismissing the 12-member jury, crediting them with giving the parties an impetus to reach a settlement, effusively praising the lawyers from both sides, and gaveling out the so-called media “trial of the century” before it could even begin.\nThe groundbreaking settlement “represents vindication and accountability,” Dominion lawyer Justin Nelson said. “For our democracy to endure for another 250 years, and hopefully much longer, we must share a commitment to facts… Today represents a ringing endorsement for truth and for democracy.”\nThe right-wing network said in a statement that it “acknowledge[s] the Court’s rulings finding certain claims about Dominion to be false,” referring to Davis’ recent ruling that 20 Fox News broadcasts from late 2020 contained blatantly untrue assertions that Dominion rigged the presidential election. But Fox won’t have to admit on-air that it spread lies about Dominion, a Dominion representative told CNN.\nThe $787.5 million payout is roughly half of the $1.6 billion that Dominion initially sought, though it is nearly 10 times the company’s valuation from 2018, and roughly eight times its annual revenue in 2021, according to court filings.\nFox avoids painful six-week trial\nThe last-minute agreement means the closely watched case is over and won’t proceed to trial. By settling with Dominion, influential Fox News executives and prominent on-air personalities will be spared from testifying about their 2020 election coverage, which was filled with lies about voter fraud.\nThe witness list included Fox Corporation chairman Rupert Murdoch, his CEO son Lachlan Murdoch, and top Fox hosts like Sean Hannity and Tucker Carlson. Damning emails, texts, and deposition testimony made public during the case revealed that these figures, and many others at Fox, privately said in 2020 that the vote-rigging claims against Dominion were asinine. But the lies were spread on-air anyway.\nRupert Murdoch thought the election denialism was “really crazy,” even as Fox personalities peddled those same claims to millions of viewers. Carlson said he “passionately” hates Donald Trump, whose presidency was a “disaster.” Fox hosts, producers, fact-checkers, and senior executives privately said in the on-air claims of a stolen election were “kooky,” “dangerously reckless” and “mind-blowingly nuts.”\nThese revelations generated months of blistering headlines for Fox as the case moved toward trial. By settling now, Fox deprived Dominion a chance to further expose its dishonesty with a weeks-long trial.\n“This settlement reflects Fox’s continued commitment to the highest journalistic standards,” Fox said in a statement Tuesday. “We are hopeful that our decision to resolve this dispute with Dominion amicably, instead of the acrimony of a divisive trial, allows the country to move forward from these issues.”\nFox News and Fox Corporation – its parent company, which was also a defendant – maintain they never defamed Dominion, and say the case was a meritless assault on First Amendment press freedoms.\nDramatic days in Delaware\nSpeculation of a settlement reached a fever pitch in recent days, especially after the court on Sunday announced a one-day delay to the start of the trial, which was originally set to begin on Monday.\nThe jury selection process wrapped up as planned Tuesday morning, and both sides prepped for opening statements. They even briefly tangled over objections to specific slides in their presentations. But when the proceedings didn’t promptly resume after lunch, the chances of a deal seemed to rise by the minute, even though the top lawyers from both sides sat in the courtroom, looking at their phones, and waiting.\nThe racially diverse jury of six men and six women was brought back into the court, ready for their front-row seat to a historic trial. But Davis, the judge, instead told the panel they helped spur a settlement.\n“Your presence here, short compared to what you thought, and uneventful in a certain sense, was extremely important,” Davis said. “Without you, the parties would not have been able to resolve their situation.”\nMany on the Dominion side cast the settlement as a victory for democracy and for truth itself.\n“Fox has admitted to telling lies about Dominion that caused enormous damage to my company, our employees, and the customers that we serve,” Dominion CEO John Poulos said Tuesday outside court.\nWhile the Dominion case is now over, Fox News is still facing a second major defamation lawsuit from Smartmatic, another voting technology company that was similarly smeared on Fox News’ shows after the 2020 election. That case is still in the discovery process, and a trial isn’t expected anytime soon.\nFor its part, Dominion still has pending lawsuits against right-wing TV networks Newsmax and OAN, as well as against Trump allies Rudy Giuliani, Sidney Powell and Mike Lindell. They all deny wrongdoing.\nCNN’s Liam Reilly and Danny Freeman contributed to this story.",
    "content_length": 5753,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 10.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 16.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "http://rss.cnn.com/rss/cnn_topstories.rss",
      "fetched_at": "2026-02-18T19:07:40.278310+00:00",
      "rss": {
        "published_at": "2023-04-19T08:28:17+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  }
]