[
  {
    "id": "84b4a47fb243e97cefe2c7ec",
    "country": "UNITED ARAB EMIRATES",
    "source_name": "Gulf News",
    "source_slug": "gulf_news",
    "url": "https://gulfnews.com/uae/ramadan/morocco-announces-thursday-as-first-day-of-ramadan-1.500448024",
    "title": "Morocco announces Thursday as first day of Ramadan",
    "published_at": "2026-02-18T18:49:48+00:00",
    "author": "Khitam Al Amir",
    "summary": null,
    "content_text": "With over 30 years of journalistic experience spanning from Jordan to the UAE, Khitam has spent the past 22 years reporting on national and regional news from Dubai, with a strong focus on the UAE, GCC and broader Arab affairs.\nAs Chief News Editor, she brings extensive expertise in delivering breaking and engaging news to readers. Beginning her tenure as a translator, she advanced through roles as Senior Translator and Chief Translator before transitioning to editorial positions, culminating in her current leadership role. Her responsibilities encompass monitoring breaking news across the UAE and the broader Arab region, ensuring timely and accurate dissemination to the public.\nBorn into a family of journalists, Khitam's passion for news was ignited early in life. A defining moment in her youth occurred in September 1985 when she had the opportunity to converse with the late British Prime Minister Margaret Thatcher during her visit to a Palestinian refugee camp north of Amman. During this encounter, Khitam shared her family's experiences of displacement from their home in Palestine and their subsequent refuge in Jordan. This poignant interaction not only deepened her understanding of geopolitical issues but also solidified her commitment to pursuing a career in journalism, aiming to shed light on the stories of those affected by regional conflicts.\nKhitam’s commitment to accurate and timely reporting drives her to seek out news that interests readers, making her a trusted source for news on the UAE and the broader Gulf region.",
    "content_length": 1553,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://prod-qt-images.s3.amazonaws.com/production/gulfnews/feed.xml",
      "fetched_at": "2026-02-18T19:03:19.716147+00:00",
      "rss": {
        "published_at": "2026-02-18T18:49:48+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "a97cd4d565556502638ab5b2",
    "country": "UNITED ARAB EMIRATES",
    "source_name": "Gulf News",
    "source_slug": "gulf_news",
    "url": "https://gulfnews.com/uae/india-declares-first-day-of-ramadan-1.500448009",
    "title": "India declares first day of Ramadan",
    "published_at": "2026-02-18T18:29:41+00:00",
    "author": "Karishma H. Nandkeolyar",
    "summary": null,
    "content_text": "Karishma Nandkeolyar is a lifestyle and entertainment journalist with a lifelong love for storytelling — she wrote her first “book” at age six and has been chasing the next sentence ever since. Known for her sharp wit, thoughtful takes, and ability to find the humor in just about anything, she covers everything from celebrity culture and internet trends to everyday lifestyle moments that make you go, “Same.”\nHer work blends insight with a conversational tone that feels like catching up with your cleverest friend — if your friend also had a deadline and a latte in hand. Off-duty, Karishma is a proud dog mom who fully believes her pup has a personality worth documenting, and yes, she does narrate those inner monologues out loud.\nWhether she’s writing features, curating content, or crafting the perfect headline, Karishma brings curiosity, creativity, and just the right amount of sarcasm to the mix.",
    "content_length": 908,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "LOW",
    "evidence_numeric": 25.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 28.75,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://prod-qt-images.s3.amazonaws.com/production/gulfnews/feed.xml",
      "fetched_at": "2026-02-18T19:03:19.716167+00:00",
      "rss": {
        "published_at": "2026-02-18T18:29:41+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "0fab525acd1dc62a3c4cba92",
    "country": "UNITED ARAB EMIRATES",
    "source_name": "Gulf News",
    "source_slug": "gulf_news",
    "url": "https://gulfnews.com/uae/client-wins-case-against-immigration-consultancy-in-dubai-court-1.500447996",
    "title": "Client wins case against immigration consultancy in Dubai court",
    "published_at": "2026-02-18T18:16:49+00:00",
    "author": "Aghaddir Ali",
    "summary": null,
    "content_text": "Court cancels two service agreements and mandates refund\nThe Dubai Court of First Instance has ordered an immigration services company to refund Dh92,886 to a client after finding that the firm breached its contractual obligations, in addition to paying Dh10,000 in compensation and annual interest of 5 per cent from the date the judgment becomes final until full settlement. The court also rejected a request to grant immediate enforcement of the ruling without a guarantee.\nAccording to court records, an Arab national filed a civil lawsuit seeking cancellation of two agreements he had concluded with the defendant company for immigration consultancy services. The original contract concerned assistance in obtaining permanent residency in Canada, which was later amended to cover an application for a United Kingdom skilled worker visa. The claimant stated that he had paid the full contractual amount but did not receive the agreed services.\nThe plaintiff requested the court to order the company to refund approximately Dh92,000 and award Dh50,000 in compensation for material and moral damages, together with legal interest of 9 per cent from the date of filing the claim until payment, in addition to court fees, expenses and legal costs, and sought provisional enforcement of the judgment.\nIn his statement of claim, the plaintiff said he entered into a services agreement with the company in May 2023 for Canadian permanent residency processing in return for Canadian dollar 16,500, which he paid in full. He alleged that the company failed to undertake substantive procedural steps or achieve any tangible progress, constituting a material breach that rendered the contract devoid of purpose. An addendum signed in December 2023 expressly stipulated that the company would refund the full amount if the agreed services were not delivered.\nThe claimant further stated that, in an attempt to resolve the dispute amicably, the company proposed an alternative agreement in October 2024 to process a UK skilled worker visa application. He accepted the proposal in good faith; however, he maintained that the company failed to take any serious action for more than six months and did not provide proof that an application had been lodged with the competent authorities despite repeated follow-ups.\nCourt documents also showed that the company acknowledged via email that the total amount paid by the claimant was Dh92,886 and offered to repay the sum in three instalments. Although the claimant agreed to the arrangement, the company failed to honour the proposed repayment schedule.\nIn its reasoning, the court held that the claimant had established payment of the claimed amount and that the defendant had failed to perform the contractual services stipulated in the agreements, amounting to a breach warranting rescission. Accordingly, the court ordered termination of both agreements, restitution of the paid amount as a legal consequence of rescission, and compensation of Dh10,000 for damages sustained by the claimant, together with annual interest of 5 per cent from the date the judgment becomes final until full payment.",
    "content_length": 3136,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://prod-qt-images.s3.amazonaws.com/production/gulfnews/feed.xml",
      "fetched_at": "2026-02-18T19:03:19.716179+00:00",
      "rss": {
        "published_at": "2026-02-18T18:16:49+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "e85f08e5e09a86cfb40db312",
    "country": "UNITED ARAB EMIRATES",
    "source_name": "Gulf News",
    "source_slug": "gulf_news",
    "url": "https://gulfnews.com/uae/dubai-announces-temporary-closure-on-emirates-road-1.500447991",
    "title": "Dubai announces temporary closure on Emirates Road",
    "published_at": "2026-02-18T18:11:49+00:00",
    "author": "Karishma H. Nandkeolyar",
    "summary": null,
    "content_text": "Authorities have urged motorists to use alternative routes\nDubai is constantly updating and upgrading its road arterial system. On Feb 19, Thursday, the lane from Dubai towards Sharjah on Emirates Road will be closed at Bridge No. (7) as part of the Emirates Road enhancement works.\nAuthorities have urged motorists to use alternative routes and adhere to traffic instructions and safety regulations to ensure smooth traffic flow and the safety of all road users.",
    "content_length": 463,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "LOW",
    "evidence_numeric": 25.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 28.75,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://prod-qt-images.s3.amazonaws.com/production/gulfnews/feed.xml",
      "fetched_at": "2026-02-18T19:03:19.716188+00:00",
      "rss": {
        "published_at": "2026-02-18T18:11:49+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "2b1a3d6a01fbbd1e7622a667",
    "country": "UNITED ARAB EMIRATES",
    "source_name": "Gulf News",
    "source_slug": "gulf_news",
    "url": "https://gulfnews.com/world/bangladesh-pm-names-cabinet-after-election-win-1.500447089",
    "title": "Bangladesh PM names cabinet after election win",
    "published_at": "2026-02-18T18:00:27+00:00",
    "author": "AFP",
    "summary": "Bangladesh PM names cabinet after election win",
    "content_text": "His 50-member cabinet includes Amir Khasru Mahmud Chowdhury\nPrime Minister Tarique Rahman vowed on Wednesday to uphold the rule of law in Bangladesh and overhaul the battered economy in his first speech to the nation since taking office.\nRahman, leader of the Bangladesh Nationalist Party (BNP) was sworn into office on Tuesday after a landslide election victory, taking over from the interim administration that had led the country of 170 million people since a 2024 uprising that toppled the government of Sheikh Hasina.\n\"There will be no partisan or political dominance, no coercion or force; the rule of law will be the final word in running the country,\" Rahman said.\nThe BNP coalition won 212 seats, compared with 77 for the Jamaat-e-Islami-led alliance.\n\"Those who voted for the BNP so that it could form a new government, those who did not vote for it, and even those who did not vote at all — all have equal rights over this government,\" Rahman said in a television broadcast.\n\"The BNP government believes that irrespective of party orientation, ideology, religion, or philosophy, these belong to individuals, but the country belongs to everyone. In this country, as a Bangladeshi citizen, you have the same rights as I do.\"\nRahman has named a former commerce minister to steer the country's troubled economy and kept the defence portfolio for himself as he formed his first cabinet.\n\"The new government has taken office amid the ruins of a fragile economy battered by corruption and misrule, a weak governance structure, and deteriorating law and order,\" Rahman added.\nHis 50-member cabinet includes Amir Khasru Mahmud Chowdhury, 76, a businessman and veteran lawmaker who has now returned to the finance ministry.\nChowdhury is tasked with reviving growth after months of turmoil that rattled investor confidence in the world's second-largest garment exporter.\nHe had previously served in the cabinet of Rahman's late mother, three-time prime minister Khaleda Zia, but was forced to resign in 2004.\nAccording to media reports, his resignation came after he had granted permission for Taiwan to open a commercial office in Dhaka. Chowdhury has not spoken publicly about the issue.\nHe was also arrested several times during Sheikh Hasina's 15-year rule, as her government regularly targeted opposition leaders in cases often decried as politically motivated.\nRahman, 60, has appointed himself defence minister, as his government faces a daunting list of challenges including improving security and healing rifts in a country polarised by years of bitter rivalry.\nBangladesh is squeezed between India -- where border tensions are high -- and Myanmar, where clashes have spilled over into frontier areas.\nBangladesh is home to more than a million Rohingya refugees who have fled Myanmar.\nKhalilur Rahman is the foreign minister, an experienced diplomat and former UN official who holds degrees from universities in Dhaka and the United States.\nKhalilur Rahman held the security portfolio in the caretaker government and helped mediate trade talks with the United States.\nHe faces the tricky task of balancing regional relations after ties with India soured during the interim government, and Dhaka deepened engagement with New Delhi's arch-enemy Pakistan.\nIndia's Foreign Minister Subrahmanyam Jaishankar congratulated his counterpart on Wednesday, saying in a statement that they would work together to \"advance our cooperation\".\nOther members of the cabinet include veteran politicians, former ministers and lawmakers, as well as academics and several party workers.",
    "content_length": 3574,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Finance Ministry",
      "Cabinet",
      "Defence",
      "BNP",
      "clashes",
      "arrested"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Finance Ministry",
      "Cabinet",
      "Defence",
      "BNP"
    ],
    "keywords_threat_matched": [
      "clashes",
      "arrested"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Pakistan",
      "Finance Ministry",
      "Cabinet",
      "Defence",
      "BNP"
    ],
    "kw_threat_hits": [
      "clashes",
      "arrested"
    ],
    "relevance_score": 58.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 48.0,
    "prepriority_score": 72.3,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://prod-qt-images.s3.amazonaws.com/production/gulfnews/feed.xml",
      "fetched_at": "2026-02-18T19:03:19.716197+00:00",
      "rss": {
        "published_at": "2026-02-18T18:00:27+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Finance Ministry",
        "Cabinet",
        "Defence",
        "BNP"
      ],
      "kw_threat_hits": [
        "clashes",
        "arrested"
      ],
      "kw_shortlisted": true
    }
  }
]