[
  {
    "id": "779fd73ecec7d61f2db0a24e",
    "country": "PAKISTAN",
    "source_name": "Business Recorder",
    "source_slug": "business_recorder",
    "url": "https://www.brecorder.com/news/40407919/textile-exporters-reject-new-levy-on-off-grid-captive-power-plants",
    "title": "Textile exporters reject new levy on off-grid captive power plants",
    "published_at": "2026-02-18T18:22:04+00:00",
    "author": "none@none.com (BR Web Desk)",
    "summary": "<p><strong>The Pakistan Textile Council (PTC), a forum representing textile and apparel exporters, opposed <a href=\"https://www.brecorder.com/news/40407844/govt-slaps-rs1243mmbtu-new-levy-on-off-grid-captive-power-plants\">the Petroleum Division’s decision of imposing a Rs1,243 per MMBtu levy</a> on off-grid captive power plants for December 2025 under the Off-Grid (Captive Power Plants) Levy Act, 2025.</strong></p>\n<p>“This is a policy-induced shock to Pakistan’s productive economy. At a time when the country is striving under Uraan Pakistan to raise exports to $60 billion, the government has chosen to impose one of the highest gas levies in recent history on the very industries that generate foreign exchange, create employment, and sustain industrial growth,” the PTC said in a press release.</p>\n<p>“Within months, the levy has escalated from Rs402 per MMBtu to Rs1,243 per MMBtu — with a built-in increase to 20%.”</p>\n<p>The PTC said results were already visible as export-sector gas demand had collapsed, national linepack breached danger thresholds, 300 MMCFD of domestic gas curtailed, LNG cargoes being diverted, and gas utilities were facing throughput shocks.</p>\n<p>“The levy ‘over and above’ OGRA’s notified sale price. destroys tariff finality. If regulator-notified prices can be topped up at will through executive notification, then no energy price in Pakistan is final. Investors cannot hedge it. Industry cannot plan for it. Banks cannot finance against it. This creates sovereign overlay risk in an already fragile economy,” PTC chairman Fawad Anwar was quoted as saying in the press release.</p>\n<p>The PTC urged the government to restore regulator-led pricing without executive overlays, protect high-efficiency cogeneration, remove cross-subsidy from commodity pricing, and align energy policy with export competitiveness and macroeconomic stability.</p>",
    "content_text": null,
    "content_length": 0,
    "extraction_method": "rss",
    "extraction_notes": [
      "fetch failed: RuntimeError: HTTP 403"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "OGRA",
      "Levies"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "OGRA",
      "Levies"
    ],
    "keywords_threat_matched": [],
    "national_relevant": true,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [
      "Pakistan",
      "OGRA",
      "Levies"
    ],
    "kw_threat_hits": [],
    "relevance_score": 72.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 18.0,
    "prepriority_score": 71.8,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.brecorder.com/feeds/latest-news",
      "fetched_at": "2026-02-18T18:43:53.658973+00:00",
      "rss": {
        "published_at": "2026-02-18T18:22:04+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "OGRA",
        "Levies"
      ],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "2db0bc33b480e0eb2bf5dade",
    "country": "PAKISTAN",
    "source_name": "Business Recorder",
    "source_slug": "business_recorder",
    "url": "https://www.brecorder.com/news/40407892/t20-world-cup-farhan-helps-pakistan-seal-super-eight-spot-with-namibia-rout",
    "title": "T20 World Cup: Farhan helps Pakistan seal Super Eight spot with Namibia rout",
    "published_at": "2026-02-18T17:15:00+00:00",
    "author": "none@none.com (AFP)",
    "summary": "<p><strong>COLOMBO: Sahibzada Farhan hit a magnificent unbeaten century to help Pakistan seal the final Super Eight berth at the T20 World Cup with a thumping 102-run win over Namibia in Colombo on Wednesday.</strong></p>\n<p>Farhan scored 100 not out off 58 balls with four sixes and 10 fours as Pakistan posted  199-3 before they routed Namibia for 97 in 17.3 overs.</p>\n<p>Pakistan’s victory took them to six points from four games in Group A and eliminated the United States, who finished with four points.</p>\n<p>India also have six points and play the Netherlands in the group’s final game later Wednesday.</p>\n<p>The defending champions India, South Africa, Zimbabwe and the West Indies will play each other in the Super eights Group 1, hosted in India.</p>\n<p>Pakistan join New Zealand, England and co-hosts Sri Lanka in Group 2, hosted in Sri Lanka.</p>\n<p><strong>READ MORE: <a href=\"https://www.brecorder.com/news/40407726/usman-tariq-confident-pakistan-can-bounce-back-after-india-drubbing\">Usman Tariq confident Pakistan can bounce back after India drubbing</a></strong></p>\n<p>After a morale-shattering 61-run defeat against India, Pakistan needed a victory to avoid an early exit, which was achieved with ease as spinners Usman Tariq (4-16) and Shadab Khan (3-19) tore through the Namibia batting.</p>\n<p>Louren Steenkamp scored 23 while Alexander Busing-Volschenk was the only other batsman to reach double figures with 20.</p>\n<p>Farhan earlier blasted a six and a four off pace bowler Jack Brassell to enter the 90s before taking a single off Gerhard Erasmus to complete his hundred in the final over.</p>\n<p>Farhan is the only second Pakistani to score a T20 World Cup century after Ahmed Shehzad in 2014 against Bangladesh.</p>\n<p>Shadab Khan, promoted to number five with Babar Azam left out, hit three sixes and a four in his 36 not out off 22 balls as Pakistan smashed 42 from the last three overs.</p>\n<p>Farhan put on 40 for the opening wicket with Saim Ayub (14) before consolidating the innings during a 67-run second wicket stand with captain Salman Agha (38).</p>\n<p>Pakistan also left out pace bowler Shaheen Shah Afridi after a poor show in the first three matches, including conceding 31 in two overs in the defeat against India on Sunday.</p>\n<p>Farhan’s ton means this is the first T20 World Cup in which three centuries have been scored.</p>\n<p>He followed Sri Lanka’s Pathum Nissanka, who scored a hundred against Australia on Monday, and Canada’s Yuvraj Sama who reached three figures against New Zealand on Tuesday.</p>",
    "content_text": null,
    "content_length": 0,
    "extraction_method": "rss",
    "extraction_notes": [
      "fetch failed: RuntimeError: HTTP 403"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Pakistani"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Pakistani"
    ],
    "keywords_threat_matched": [],
    "national_relevant": true,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [
      "Pakistan",
      "Pakistani"
    ],
    "kw_threat_hits": [],
    "relevance_score": 70.0,
    "evidence_strength": "LOW",
    "evidence_numeric": 25.0,
    "urgency_score": 100.0,
    "keyword_intensity": 12.0,
    "prepriority_score": 64.95,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.brecorder.com/feeds/latest-news",
      "fetched_at": "2026-02-18T18:43:53.659248+00:00",
      "rss": {
        "published_at": "2026-02-18T17:15:00+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Pakistani"
      ],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "429be580bdd3f36b5a3671e7",
    "country": "PAKISTAN",
    "source_name": "Business Recorder",
    "source_slug": "business_recorder",
    "url": "https://www.brecorder.com/news/40407918/sbp-announces-office-banking-hours-for-ramadan",
    "title": "SBP announces office, banking hours for Ramadan",
    "published_at": "2026-02-18T16:57:19+00:00",
    "author": "none@none.com (BR Web Desk)",
    "summary": "<p><strong>State Bank of Pakistan (SBP) on Wednesday announced revised office and business (banking) hours for the month of Ramadan 2026, which will be observed by all banks, development finance institutions (DFIs) and microfinance banks across the country.</strong></p>\n<p>According to a circular issued by the central bank, SBP offices will remain open from 9:00 am to 3:00 pm, Monday to Thursday, without break during Ramadan. On Fridays, office hours will be from 9:00 am to 12:30 pm, without break.</p>\n<p>The central bank further advised banks to observe the following business (banking) hours for public dealing during the holy month: from 9:00 am to 2:00 pm, Monday to Thursday, without break. On Fridays, banking hours for public dealing will be from 9:00 am to 12:30 pm, without break.</p>\n<p>The SBP said that after the month of Ramadan-ul-Mubarak, the above timings will automatically revert to pre-Ramadan schedule.</p>\n<p>Earlier, the Central Ruet-e-Hilal Committee announced that the <a href=\"https://www.brecorder.com/news/40407902/ramadan-moon-sighted-first-fast-in-pakistan-on-thursday-feb-19\">Ramadan 2026 moon has been sighted</a> and the first day of fasting will be observed on Thursday, February 19.</p>",
    "content_text": null,
    "content_length": 0,
    "extraction_method": "rss",
    "extraction_notes": [
      "fetch failed: RuntimeError: HTTP 403"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "SBP",
      "State Bank of Pakistan"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "SBP",
      "State Bank of Pakistan"
    ],
    "keywords_threat_matched": [],
    "national_relevant": true,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [
      "Pakistan",
      "SBP",
      "State Bank of Pakistan"
    ],
    "kw_threat_hits": [],
    "relevance_score": 56.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 18.0,
    "prepriority_score": 63.8,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.brecorder.com/feeds/latest-news",
      "fetched_at": "2026-02-18T18:43:53.658994+00:00",
      "rss": {
        "published_at": "2026-02-18T16:57:19+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "SBP",
        "State Bank of Pakistan"
      ],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "1f0266ee967082127a153238",
    "country": "PAKISTAN",
    "source_name": "Business Recorder",
    "source_slug": "business_recorder",
    "url": "https://www.brecorder.com/news/40407917/govt-industry-dialogue-key-to-sustainable-growth-minister",
    "title": "Govt–industry dialogue key to sustainable growth: minister",
    "published_at": "2026-02-18T16:49:23+00:00",
    "author": "none@none.com (BR Web Desk)",
    "summary": "<p><strong>State Minister for Finance and Railways Bilal Azhar Kayani underscored the importance of dialogue between the government and industry, saying economic decision-making could not take place in isolation and that sustainable growth depends on consistent engagement.</strong></p>\n<p>He passed these remarks speaking to a policy dialogue titled ‘From budget lines to bottom lines: turning policy into growth.’ The session, part of ‘Reset: reimagining reform, growth, and competitiveness,” organised by the Lahore University of Management Sciences (LUMS) and the American Business Forum, brought together policymakers, economists, and industry leaders.</p>\n<p>“Decision-making cannot occur in isolation…exports, growth, and job creation must be driven by the private sector, with government focused on creating an enabling environment through consistent engagement and predictable policies,” the minister was quoted as saying in a press release.</p>\n<p>Also present at the event, Ali Naseer, Chief Strategy Officer at JazzWorld, said Pakistan’s core challenge was not the absence of policy, but the frequent reversal of it.</p>\n<p>“One of the worst things that has happened to Pakistan is policy inconsistency,” he said, noting that even well-designed frameworks were often shelved within a few years, undermining investor confidence and long-term competitiveness.</p>\n<p>Naseer stressed that durable growth required rules-based frameworks, regulatory predictability, and continuity beyond political cycles.</p>\n<p><strong>Also read: <a href=\"https://www.brecorder.com/news/40332581/regulatory-reforms-public-private-dialogue-in-key-agricultural-markets-held\">Regulatory reforms: Public-private dialogue in key agricultural markets held</a></strong></p>\n<p>He described digital infrastructure as economic infrastructure, underpinning financial services, healthtech, education technology, e-commerce, and emerging artificial intelligence (AI) applications.</p>\n<p>Naseer welcomed the government’s approach to spectrum policy, observing that the upcoming auction reflects improved design and greater sensitivity to sector realities, including more competitive reserve pricing.</p>\n<p>Meanwhile, Dr Stefan Dercon, Professor of Economic Policy at the University of Oxford, cautioned that while headline indicators such as inflation and near-term growth projections showed relative stability, structural constraints continued to cap Pakistan’s long-term trajectory.</p>\n<p>He noted that low investment, modest export performance, and regulatory inefficiencies limit sustainable expansion, arguing that productivity gains and export competitiveness were essential for durable growth.</p>\n<p>Businesses, he observed, seek policy certainty rather than short-term stimulus, and reforms must be sustained rather than episodic.</p>",
    "content_text": null,
    "content_length": 0,
    "extraction_method": "rss",
    "extraction_notes": [
      "fetch failed: RuntimeError: HTTP 403"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Lahore"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Lahore"
    ],
    "keywords_threat_matched": [],
    "national_relevant": true,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [
      "Pakistan",
      "Lahore"
    ],
    "kw_threat_hits": [],
    "relevance_score": 79.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 12.0,
    "prepriority_score": 74.7,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.brecorder.com/feeds/latest-news",
      "fetched_at": "2026-02-18T18:43:53.659006+00:00",
      "rss": {
        "published_at": "2026-02-18T16:49:23+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Lahore"
      ],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "5498d0facba30633f758d8ae",
    "country": "PAKISTAN",
    "source_name": "Business Recorder",
    "source_slug": "business_recorder",
    "url": "https://www.brecorder.com/news/40407883/intra-day-update-rupee-records-gain-against-us-dollar",
    "title": "Rupee sees marginal gain against US dollar",
    "published_at": "2026-02-18T15:54:47+00:00",
    "author": "none@none.com (Recorder Report)",
    "summary": "<h3>Rupee's Performance Against US Dollar Since 04 March 2025</h3>\n    <canvas id=\"closingRatesChart\"></canvas>\n    \n\n\n\n<p><strong>The Pakistani rupee registered marginal gain against the US dollar, appreciaiting 0.01% in the inter-bank market on Wednesday.</strong></p>\n<p>At close, the local currency settled at 279.57, a gain of Re0.03 against the greenback.</p>\n<p><a href=\"https://www.brecorder.com/news/40407701/rupee-sees-marginal-gain-against-us-dollar\">On Tuesday</a>, the local currency closed at 279.60, according to the State Bank of Pakistan (SBP).</p>\n<p>Meanwhile, <a href=\"https://www.brecorder.com/news/40407662/dollar-holds-gains-in-thin-trading-as-markets-await-fed-minutes-us-gdp\"><u>the dollar held its ground on Wednesday</u></a> as geopolitical risks kept markets on edge and investors awaited minutes from the Federal Reserve for signals on future rate cuts.</p>\n<p><a href=\"https://www.brecorder.com/news/40407408/yen-softens-after-strong-week-dollar-steady-as-traders-weigh-rate-outlook\"><u>The yen</u></a> was steady after data showing a rebound in Japanese manufacturer sentiment and President Donald Trump announced the first tranche of mega-investments Tokyo is making in the US.</p>\n<p>The dollar index, which measures the greenback against a basket of currencies, was little changed at 97.16 after a two-day advance. The euro slid <a href=\"https://www.brecorder.com/news/40407855/dollar-firm-as-focus-turns-to-peace-talks-kiwi-hit-by-rbnzs-easy-stance\">0.06% to $1.1846</a>.</p>\n<p>The yen held steady at 153.23 per dollar, and sterling weakened 0.07% to $1.3558, after a 0.5% slide in the previous session.</p>\n<p>Oil prices gained nearly 3% on Wednesday after peace talks between Ukraine and Russia in Geneva ended after only two hours and as investor concerns persisted about the prospect of conflict between the US and Iran.</p>\n<p>The US-mediated talks over Ukraine in Switzerland took place as US President Donald Trump has twice in recent days suggested it was up to <u>Ukraine</u> to take steps to ensure their success. President Volodymyr Zelenskiy described them as “difficult.”</p>\n<p>Brent crude oil futures were up $1.96, or 2.9%, to $69.38 a barrel at 1440 GMT, while US West Texas Intermediate (WTI) crude gained $1.75, or 2.8%, to $64.08. Both contracts fell to two-week lows on Tuesday.</p>\n<p><strong>Inter-bank market rates for dollar on Wednesday</strong></p>\n<p>BID Rs 279.57</p>\n<p>OFFER Rs 279.77</p>\n<p><strong>Open-market movement</strong></p>\n<p>In the open market, the PKR gained 3 paise for buying and 4 paise for selling against USD, closing at 280.07 and 280.62, respectively.</p>\n<p>Against Euro, the PKR gained 11 paise for buying and 16 paise for selling, closing at 331.11 and 333.97, respectively.</p>\n<p>Against UAE Dirham, the PKR gained 2 paise for buying and lost 1 paisa for selling, closing at 76.45 and 77.21, respectively.</p>\n<p>Against Saudi Riyal, the PKR gained 1 paisa for buying and lost 1 paisa for selling, closing at 74.73 and 75.34, respectively.</p>\n<p><strong>Open-market rates for dollar on Wednesday</strong></p>\n<p>BID Rs 280.07</p>\n<p>OFFER Rs 280.62</p>",
    "content_text": null,
    "content_length": 0,
    "extraction_method": "rss",
    "extraction_notes": [
      "fetch failed: RuntimeError: HTTP 403"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Pakistani",
      "SBP",
      "State Bank of Pakistan"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Pakistani",
      "SBP",
      "State Bank of Pakistan"
    ],
    "keywords_threat_matched": [],
    "national_relevant": true,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [
      "Pakistan",
      "Pakistani",
      "SBP",
      "State Bank of Pakistan"
    ],
    "kw_threat_hits": [],
    "relevance_score": 58.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 24.0,
    "prepriority_score": 69.9,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.brecorder.com/feeds/latest-news",
      "fetched_at": "2026-02-18T18:43:53.659210+00:00",
      "rss": {
        "published_at": "2026-02-18T15:54:47+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Pakistani",
        "SBP",
        "State Bank of Pakistan"
      ],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  }
]