[
  {
    "id": "df3e79880cb4977df38ee086",
    "country": "PAKISTAN",
    "source_name": "Dawn",
    "source_slug": "dawn",
    "url": "https://www.dawn.com/news/1974186/pta-says-5g-spectrum-auction-to-be-held-on-march-10",
    "title": "PTA says 5G spectrum auction to be held on March 10",
    "published_at": "2026-02-18T18:47:50+00:00",
    "author": "none@none.com (Kalbe Ali)",
    "summary": "<p>ISLAMABAD: The Pakistan Telecommunication Authority (PTA) said on Wednesday that 5G spectrum auction would be held on March 10 and no changes were likely to be made in the schedule, saying that the sale was likely to fetch between $300-$700 million.</p>\n<p>The authority is offering 597 megahertz (MHz) in several bands in the upcoming auction and three existing telecom operators have been mandated to obtain a minimum of 100 MHz in the auction process.</p>\n<p>“With the prescribed rate, even if 300 MHz is obtained by the telecommunication operators without any competitive bidding, the government will get $300 million,” PTA Director General Licensing retired brigadier Aamir Shahzad told a media briefing.</p>\n<p>“And if all the 597 MHz is sold at auction at a slightly competitive rate, $700 million will be available for the government, but this scenario is less likely to happen,” he added.</p>\n<p>Shahzad said that the auction would be conducted using a multi-round electronic clock auction format, with the main allocation stage starting on March 10. He said the 2600 MHz and 3500 MHz bands would be offered during the first round.</p>\n<p>He added that after the auction process, the rollout of 5G services would take between three and six months as certain infrastructure was needed for the fresh spectrum.</p>\n<p>Meanwhile, PTA Chairman Hafeezur Rehman said that the auction would lead to improved quality of service and data speed.</p>\n<p>“Around 50 million new users have been added in the system during the last five years, but only 10MHz was increased in the 2021 spectrum auction,” the PTA chairman said.</p>\n<p>“Improved data service and enhanced coverage will also increase average revenue per user (ARPU) for telecommunication operators,” he said.</p>\n<p>The ARPU is a key performance indicator that measures the average revenue generated by a company from each consumer within a specific timeframe, monthly or annually.</p>\n<p>“We started with $0.7 and now the ARPU has reached $1.3. Therefore, it is likely to increase as more data is consumed by the subscribers,” Rehman said.</p>\n<p>“The authority expects mobile broadband speeds to improve by around 25 per cent following the auction,” he said.</p>\n<p>He said that the government had offered many incentives to telecom companies in the new spectrum auction, but obligations to improve the quality of service as well as coverage area had been increased.</p>\n<p>“This will help the country to embrace further upgradations like 6G and not like 5G, where we have been delayed,” the PTA Chairman said.</p>\n<p>He added the government had also eliminated the right-of-way fee that used to be around Rs36,000 per kilometre annually; this, he said, would encourage fiberisation projects.</p>\n<p>The chairman also said that telecom operators had already placed orders for 5G equipment, while local manufacturing of 5G-enabled smartphones had commenced, with 500,000 to 600,000 units produced so far.</p>\n<p>He said the other measures being taken to facilitate the faster rollout of services after the auction were options for spectrum sharing, relaxation of certain regulatory terms and incentives for network expansion.</p>\n<p>“Operators have been given one year to make the necessary capital investments without upfront spectrum payments, allowing them to focus on improving service quality,” Rehman added.</p>\n    <figure class=\"media  w-full sm:w-1/2  media--right  media--embed  media--uneven\">\n        <div class=\"media__item  media__item--newskitlink  \">    </div>\n        \n    </figure>\n<p>However, the operators will have to expand 5G coverage to additional cities apart from Islamabad, Karachi, Lahore, Peshawar and Quetta, while fiber-to-the-site ratios will increase from 20 per cent to 35pc by 2035.</p>\n<p>Besides, the minimum download speeds for 4G service have been increased from four megabytes per second (Mbps) to 20Mbps in 2026–27 and to 50Mbps by 2030–35.</p>\n<p>For 5G, minimum download speeds will rise from 50Mbps initially to 100Mbps by 2030–35, with latency targets reduced to 35 milliseconds. Upload speeds are benchmarked at 20pc of download speeds across both technologies.</p>",
    "content_text": null,
    "content_length": 0,
    "extraction_method": "rss",
    "extraction_notes": [
      "fetch failed: RuntimeError: HTTP 403",
      "LLM_ERROR: ValueError: Requested tokens (1283) exceed context window of 1024"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Islamabad",
      "Karachi",
      "Lahore",
      "Peshawar",
      "Quetta"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Islamabad",
      "Karachi",
      "Lahore",
      "Peshawar",
      "Quetta"
    ],
    "keywords_threat_matched": [],
    "national_relevant": true,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [
      "Pakistan",
      "Islamabad",
      "Karachi",
      "Lahore",
      "Peshawar",
      "Quetta"
    ],
    "kw_threat_hits": [],
    "relevance_score": 100.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 36.0,
    "prepriority_score": 92.1,
    "prepriority_bucket": "CRITICAL",
    "threat_score": 0.0,
    "threat_level": "LOW",
    "threat_vector": "OTHER",
    "one_liner_threat": "",
    "reasons": [],
    "risk_index": 54.0,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.dawn.com/feeds/home/",
      "fetched_at": "2026-02-18T18:48:19.097937+00:00",
      "rss": {
        "published_at": "2026-02-18T18:47:50+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Islamabad",
        "Karachi",
        "Lahore",
        "Peshawar",
        "Quetta"
      ],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "379cb190dd8e880594472ef5",
    "country": "PAKISTAN",
    "source_name": "Dawn",
    "source_slug": "dawn",
    "url": "https://www.dawn.com/news/1974194/ahead-of-inaugural-board-of-peace-meeting-asif-says-recognition-of-israel-not-on-the-cards-at-all",
    "title": "Ahead of inaugural Board of Peace meeting, Asif says recognition of Israel ‘not on the cards at all’",
    "published_at": "2026-02-18T18:43:28+00:00",
    "author": "none@none.com (News Desk)",
    "summary": "<p>Defence Minister Khawaja Asif said on Wednesday that recognition of Israel by Pakistan was “not on the cards at all” as he highlighted the country’s support for the Palestinian cause.</p>\n<p>The minister made the remarks in an interview with <em>France 24</em>. The comments come as the inaugural meeting of the Board of Peace, led by US President Donald Trump, will be held in Washington on February 19. Prime Minister Shehbaz Sharif and Deputy Prime Minister Ishaq Dar will be <a href=\"https://www.dawn.com/news/1972727/pm-shehbaz-to-attend-inaugural-board-of-peace-meeting-in-us-confirms-fo\">attending </a>the meeting.</p>\n    <figure class=\"media  w-full  w-full  media--left  media--embed  \">\n        <div class=\"media__item  media__item--youtube  \"></div>\n        \n    </figure>\n<p>In the interview, Asif was asked about Pakistan’s decision to join the Board of Peace and if the country would contribute troops for a military force in Gaza.</p>\n<p>“I don’t see any problem in that. It all depends on what sort of terms of reference are drafted for that peace force,” he said, highlighting that Pakistan was a part of UN peacekeeping missions.</p>\n<p>“So we have that experience. Palestine is a cause that is very close to our hearts. We have been demonstrating solidarity with them for many, many, many decades,” he said.</p>\n<p>He said that Pakistan had supported the cause of Palestine on countless international forums.</p>\n<p>“So this is something worth attempting. This is a good opportunity. Let’s hope it brings us closer to the two-state solution in the Middle East,” he said.</p>\n<p>The interviewer then pointed out that many Muslim countries had normalised ties with Israel and asked whether this was on the table for Pakistan.</p>\n<p>“No, not yet. You know, I do not see this option even being considered by Pakistan. Maybe, in the future, when there is a total paradigm shift and two states are established and Palestinians have the right of self-determination, their own homeland,” he said.</p>\n<p>“At the moment, it is not on the cards at all,” he said.</p>\n<h2><a class=\"heading-permalink\" href=\"#india-waging-proxy-war\" id=\"india-waging-proxy-war\" title=\"Permalink\"></a>‘India waging proxy war’</h2>\n<p>The minister was then asked about the security situation in the country, including the <a href=\"https://www.dawn.com/news/1971418\">attack at an imambargah in Islamabad</a>.</p>\n<p>In response, Asif said that there were almost “all franchises of terrorism” in neighbouring Afghanistan, which he attributed to the “non-seriousness” of the Afghan Taliban government. He said that the Afghan Taliban was providing terrorists safe haven on their soil.</p>\n<p>“Nothing can happen from across the border from Afghanistan … any attack in Pakistan, it has the blessings of the Afghan government,” he said.</p>\n<p>Asked about Pakistan’s <a href=\"https://www.dawn.com/news/1949107\">strikes</a> in Afghanistan, the minister said, “We always have that option and we can exercise that option. We won’t hesitate.”</p>\n<p>He further said that if terrorist outfits were operating from Afghan soil, the responsibility lay with Kabul’s rulers.</p>\n<p>Asked about India, the minister highlighted the <a href=\"https://www.dawn.com/news/1910509\">military conflict</a> between Pakistan and India in May 2025.</p>\n<p>“Our air force practically decimated whatever attempt they were making to invade Pakistan. So now they are waging a proxy war against Pakistan,” he said.</p>\n<p>“Delhi and Kabul and all these terrorist outfits are on the same page,” he said.</p>\n<p>He said that friendly countries had attempted to mediate between Islamabad and Kabul but “these attempts did not produce any results”.</p>\n<p>He said that the Afghan Taliban had accepted that the banned Tehreek-i-Taliban Pakistan (TTP) was operating from their territory.</p>\n<p>“They indirectly said that they had no control over them. We told them that allow us to deal with them … they accepted their responsibility verbally, but whatever we agreed upon … they are not ready to give it in writing,” he said.</p>",
    "content_text": null,
    "content_length": 0,
    "extraction_method": "rss",
    "extraction_notes": [
      "fetch failed: RuntimeError: HTTP 403",
      "LLM_ERROR: ValueError: Requested tokens (1264) exceed context window of 1024"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Islamabad",
      "Defence",
      "Military",
      "attack",
      "terrorism",
      "terrorist",
      "terrorists"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Islamabad",
      "Defence",
      "Military"
    ],
    "keywords_threat_matched": [
      "attack",
      "terrorism",
      "terrorist",
      "terrorists"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Pakistan",
      "Islamabad",
      "Defence",
      "Military"
    ],
    "kw_threat_hits": [
      "attack",
      "terrorism",
      "terrorist",
      "terrorists"
    ],
    "relevance_score": 100.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 60.0,
    "prepriority_score": 94.5,
    "prepriority_bucket": "CRITICAL",
    "threat_score": 0.0,
    "threat_level": "LOW",
    "threat_vector": "OTHER",
    "one_liner_threat": "",
    "reasons": [],
    "risk_index": 54.0,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.dawn.com/feeds/home/",
      "fetched_at": "2026-02-18T18:48:19.097905+00:00",
      "rss": {
        "published_at": "2026-02-18T18:43:28+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Islamabad",
        "Defence",
        "Military"
      ],
      "kw_threat_hits": [
        "attack",
        "terrorism",
        "terrorist",
        "terrorists"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "87a723c0f441b2112ee74d44",
    "country": "PAKISTAN",
    "source_name": "Dawn",
    "source_slug": "dawn",
    "url": "https://www.dawn.com/news/1974189/no-basant-celebrations-before-february-2027-says-punjab-information-minister",
    "title": "No Basant celebrations before February 2027, says Punjab information minister",
    "published_at": "2026-02-18T17:11:13+00:00",
    "author": "none@none.com (News Desk)",
    "summary": "<p>Punjab Information Minister Azma Bokhari on Wednesday said that the Basant festival, which was revived by the provincial government earlier this month in Lahore after an 18-year hiatus, would now be celebrated in February 2027.</p>\n<p>“I want to state categorically … that Basant will be celebrated in February 2027. No suggestion for celebrating it before that is under consideration,” she said in a video message posted by the Punjab government’s official account on X.</p>\n    <figure class=\"media  w-full  w-full  media--left  media--embed  media--uneven media--tweet\">\n        <div class=\"media__item  media__item--twitter  \"><span>\n    <blockquote class=\"twitter-tweet\" lang=\"en\">\n        <a href=\"https://twitter.com/GovtofPunjabPK/status/2024135339510583399\"></a>\n    </blockquote>\n</span></div>\n        \n    </figure>\n<p>She also noted that people in a couple of cities had <a href=\"https://www.dawn.com/news/1973042\">celebrated the festival </a>over the last few days.</p>\n<p>“We did not give a harsh reaction at that as there were no losses reported,” Bokhari added.</p>\n<p>The Punjab minister highlighted people’s “excitement” for the festival and said she shared the same sentiment.</p>\n<p>Bokhari reiterated that the Basant would be celebrated in February 2027 and would be “bigger and better than the one held this year”.</p>\n<p>The three-day Basant festival was celebrated in Lahore from February 6-8, following the Punjab government’s <a href=\"https://www.dawn.com/news/1964063\"><u>decision</u></a> to lift a ban on the historic event after 18 years, with strict regulations.</p>\n<p>Subsequently, Punjab Chief Minister Maryam Nawaz Sharif had praised authorities for organising a “safe Basant” <a href=\"https://www.dawn.com/news/1971867/basant-festivities-in-lahore-can-continue-till-5am-on-monday-announces-punjab-cm-maryam\"><u>festival </u></a>in Lahore. She also stated that there was not a single death caused by injuries from kite strings during the festival.</p>",
    "content_text": null,
    "content_length": 0,
    "extraction_method": "rss",
    "extraction_notes": [
      "fetch failed: RuntimeError: HTTP 403"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Lahore",
      "Punjab",
      "Chief Minister",
      "Provincial Government",
      "death"
    ],
    "keywords_national_matched": [
      "Lahore",
      "Punjab",
      "Chief Minister",
      "Provincial Government"
    ],
    "keywords_threat_matched": [
      "death"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Lahore",
      "Punjab",
      "Chief Minister",
      "Provincial Government"
    ],
    "kw_threat_hits": [
      "death"
    ],
    "relevance_score": 75.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 33.0,
    "prepriority_score": 79.3,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.dawn.com/feeds/home/",
      "fetched_at": "2026-02-18T18:48:19.097966+00:00",
      "rss": {
        "published_at": "2026-02-18T17:11:13+00:00"
      },
      "kw_national_hits": [
        "Lahore",
        "Punjab",
        "Chief Minister",
        "Provincial Government"
      ],
      "kw_threat_hits": [
        "death"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "6959264ddae8e13e4257a5cf",
    "country": "PAKISTAN",
    "source_name": "Dawn",
    "source_slug": "dawn",
    "url": "https://www.dawn.com/news/1974187/our-goal-win-t20-world-cup-says-shadab-as-pakistan-into-super-eights",
    "title": "Our goal? Win T20 World Cup, says Shadab as Pakistan into Super Eights",
    "published_at": "2026-02-18T16:22:37+00:00",
    "author": "none@none.com (AFP)",
    "summary": "<p>Shadab Khan said Pakistan believed they could go on and win the T20 World Cup after their <a href=\"https://www.dawn.com/live/t20-worldcup-2026\">best performance of the tournament </a>secured the last Super Eights berth on Wednesday.</p>\n<p>Pakistan bowled out Namibia for 97 to win by a colossal 102 runs in Colombo and bounce back in style after a <a href=\"https://www.dawn.com/live/t20-worldcup-2026\">defeat</a> to arch-rivals India had left them in danger of elimination.</p>\n<p>Pakistan rode on an undefeated maiden T20 international century by opener Sahibzada Farhan to post 199-3.</p>\n    <figure class=\"media  w-full sm:w-1/2  media--right  media--embed  media--uneven\">\n        <div class=\"media__item  media__item--newskitlink  \">    </div>\n        \n    </figure>\n<p>Spinners Usman Tariq and Shadab Khan then shared seven wickets to rout Namibia in 17.3 overs.</p>\n<p>“We didn’t take this game lightly after so much talk about one match against India,” said Shadab, who scored a brisk 22-ball 36 and grabbed 3-19.</p>\n<p>“We are on the right track to achieve the goal of winning the World Cup and we are following a process,” he added.</p>\n<p>Shadab warned that the Super Eights, which Pakistan will begin with a match against New Zealand in Colombo on Saturday before facing England and co-hosts Sri Lanka next week, will be a step up.</p>\n<p>“There are eight good teams so it will be a tough stage and all matches will be high-pressure games,” said Shadab.</p>\n<p>Meanwhile, skipper Salman Agha was beaming when he described the win as a “complete performance”.</p>\n<p>“We started really well and in the middle, we put partnerships on and then finished well,” he said.</p>\n<p>“Sahibzada has been outstanding, the way he’s been batting for us for the last six months. He scored a hundred today and I’m very happy for him,” he said.</p>\n<p>“When it comes to bowling, we were lethal and we were ruthless. We bowled in the right areas.”</p>\n<p>Namibia captain Gerhard Erasmus admitted there were lessons to be learned as they head home after losing all four of their group matches.</p>\n<p>“I think for us, it’s always about nailing those specialist positions,” said Erasmus.</p>\n<p>“It has been a great learning experience and will help us in future.”</p>\n<p>Erasmus said Namibia were now looking forward to the ODI World Cup next year, which they will co-host with South Africa and Zimbabwe.</p>\n<p>“There is a lot of cricket around and lots of really exciting things happening in and around cricket in Namibia, which gives the boys a lot of pleasing things to play for,” he said.</p>",
    "content_text": null,
    "content_length": 0,
    "extraction_method": "rss",
    "extraction_notes": [
      "fetch failed: RuntimeError: HTTP 403"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan"
    ],
    "keywords_national_matched": [
      "Pakistan"
    ],
    "keywords_threat_matched": [],
    "national_relevant": true,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [
      "Pakistan"
    ],
    "kw_threat_hits": [],
    "relevance_score": 60.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 6.0,
    "prepriority_score": 64.6,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.dawn.com/feeds/home/",
      "fetched_at": "2026-02-18T18:48:19.097926+00:00",
      "rss": {
        "published_at": "2026-02-18T16:22:37+00:00"
      },
      "kw_national_hits": [
        "Pakistan"
      ],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "cc9b41f792b2656cb31e69d8",
    "country": "PAKISTAN",
    "source_name": "Dawn",
    "source_slug": "dawn",
    "url": "https://www.dawn.com/news/1974092/ramazan-moon-sighted-holy-month-to-begin-in-pakistan-on-thursday",
    "title": "Ramazan moon sighted; holy month to begin in Pakistan on Thursday",
    "published_at": "2026-02-18T15:58:11+00:00",
    "author": "none@none.com (News Desk)",
    "summary": "<p>The Central Ruet-i-Hilal Committee announced on Wednesday that the Ramazan moon was sighted, and the holy month would begin in Pakistan on Thursday (February 19).</p>\n<p>The announcement was made by committee chairman, Maulana Abdul Khabir Azad, as it met in Peshawar for the moon sighting.</p>\n<p>Speaking to the media after the meeting, Azad said that the skies were clear in some areas and cloudy in others.</p>\n    <figure class=\"media  w-full  w-full  media--left  media--embed  \">\n        <div class=\"media__item  media__item--youtube  \"></div>\n        \n    </figure>\n<p>He said that testimonies were received from several parts of the country, including Quetta, Islamabad, Waziristan, Dir, Karachi, Buner, Mardan and Tando Allahyar.</p>\n<p>“Therefore, it was decided with consensus that the first day of Ramazan would be on Thursday,” he said.</p>\n<p>Separately, according to the <a class=\"link--external\" href=\"https://www.thedailystar.net/news/bangladesh/news/ramadan-begins-tomorrow-moon-sighted-4109261\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><em>Daily Star</em></a>, the crescent moon was sighted in Bangladesh, while <a class=\"link--external\" href=\"https://www.thehindu.com/news/national/ramzan-fasts-to-begin-in-india-from-february-19/article70648078.ece\" rel=\"noopener noreferrer\" target=\"_blank\"><em>The Hindu</em></a> reported that it was also spotted in India.</p>\n    <figure class=\"media  w-full sm:w-1/2  media--right  media--embed  media--uneven\">\n        <div class=\"media__item  media__item--newskitlink  \">    </div>\n        \n    </figure>\n<p>Saudi Arabia, Oman, Qatar, the United Arab Emirates and Afghanistan observed their first day of fasting on Wednesday after the crescent moon was <a href=\"https://www.dawn.com/news/1973918/ramazan-moon-sighted-in-saudi-arabia-uae\">sighted</a> on Tuesday night.</p>\n<p>Prime Minister Shehbaz Sharif extended “heartfelt” greetings to the nation, as well as Muslims around the world, on the beginning of Ramazan, state-run <em>APP</em> reported.</p>\n<p>He said the holy month was a blessing from God and gave Muslims an opportunity to “renew the values of devotion and humility in worship, righteousness and piety and spiritual purification”.</p>\n<p>“Fasting is not merely the observance of a religious obligation; rather, it is practical training in patience, discipline and a sense of responsibility in our daily lives,” the PM said.</p>\n<p>He added that the government had launched a Ramazan Package to “provide maximum possible support to the vulnerable groups”.</p>\n<p>“Under this initiative, financial assistance will be provided to deserving individuals in a dignified manner through digital wallets, ensuring that every household,” he said.</p>\n<p>President Asif Ali Zardari also extended greetings to the nation and the Muslim Ummah, describing the sacred month as a period of mercy, forgiveness, and salvation,  according to <em>APP</em>.</p>\n<p>“At a time when Pakistan faces various social and economic challenges, Ramazan brings a message of hope, patience, and collective solidarity,” the report quoted the president as saying.</p>\n<p>He expressed the resolve that “the nation should rise above personal interests and give priority to national and collective welfare”.</p>\n<p>In a post on X, PPP Chairman Bilawal Bhutto-Zardari congratulated the Muslim Ummah on the month of Ramazan.</p>\n    <figure class=\"media  w-full  w-full  media--left  media--embed  media--uneven media--tweet\">\n        <div class=\"media__item  media__item--twitter  \"><span>\n    <blockquote class=\"twitter-tweet\" lang=\"en\">\n        <a href=\"https://twitter.com/BBhuttoZardari/status/2024112009759903990\"></a>\n    </blockquote>\n</span></div>\n        \n    </figure>\n<p>National Assembly Speaker Sardar Ayaz Sadiq also extended felicitations to the people of Pakistan and the Muslim Ummah on the commencement of the holy month.</p>\n<p>He appealed to the public to “demonstrate patience, avoid hoarding and profiteering, and ensure the availability of essential commodities at reasonable prices”.</p>\n    <figure class=\"media  w-full  w-full  media--left  media--embed  media--uneven media--tweet\">\n        <div class=\"media__item  media__item--twitter  \"><span>\n    <blockquote class=\"twitter-tweet\" lang=\"en\">\n        <a href=\"https://twitter.com/NAofPakistan/status/2024136698725310530\"></a>\n    </blockquote>\n</span></div>\n        \n    </figure>\n<p>Earlier this month, based on the moon’s expected age, the Space and Upper Atmosphere Research Commission (Suparco) had <a href=\"https://www.dawn.com/news/1972917\">predicted</a> that the first day of Ramazan was “likely to fall” on February 19.</p>\n<p>It is worth mentioning that Prime Minister Shehbaz Sharif has announced a Rs38 billion <a href=\"https://www.dawn.com/news/1973178\">Ramazan Relief Package</a> for 12.1 million deserving families across the four provinces as well as Gilgit-Baltistan (GB) and Azad Jammu and Kashmir (AJK).</p>\n<p>“Every deserving family will receive Rs13,000 through a digital wallet or bank transfer, without discrimination based on party affiliation or point of view,” he said.</p>",
    "content_text": null,
    "content_length": 0,
    "extraction_method": "rss",
    "extraction_notes": [
      "fetch failed: ConnectionError: ('Connection aborted.', RemoteDisconnected('Remote end closed connection without response'))",
      "LLM_ERROR: ValueError: Requested tokens (1617) exceed context window of 1024"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Islamabad",
      "Karachi",
      "Peshawar",
      "Quetta",
      "Mardan",
      "Gilgit",
      "Gilgit-Baltistan",
      "GB",
      "Azad Jammu and Kashmir",
      "AJK",
      "National Assembly",
      "Kashmir",
      "PPP"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Islamabad",
      "Karachi",
      "Peshawar",
      "Quetta",
      "Mardan",
      "Gilgit",
      "Gilgit-Baltistan",
      "GB",
      "Azad Jammu and Kashmir",
      "AJK",
      "National Assembly",
      "Kashmir",
      "PPP"
    ],
    "keywords_threat_matched": [],
    "national_relevant": true,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [
      "Pakistan",
      "Islamabad",
      "Karachi",
      "Peshawar",
      "Quetta",
      "Mardan",
      "Gilgit",
      "Gilgit-Baltistan",
      "GB",
      "Azad Jammu and Kashmir",
      "AJK",
      "National Assembly",
      "Kashmir",
      "PPP"
    ],
    "kw_threat_hits": [],
    "relevance_score": 100.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 60.0,
    "prepriority_score": 94.5,
    "prepriority_bucket": "CRITICAL",
    "threat_score": 0.0,
    "threat_level": "LOW",
    "threat_vector": "OTHER",
    "one_liner_threat": "",
    "reasons": [],
    "risk_index": 54.0,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.dawn.com/feeds/home/",
      "fetched_at": "2026-02-18T18:48:19.097947+00:00",
      "rss": {
        "published_at": "2026-02-18T15:58:11+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Islamabad",
        "Karachi",
        "Peshawar",
        "Quetta",
        "Mardan",
        "Gilgit",
        "Gilgit-Baltistan",
        "GB",
        "Azad Jammu and Kashmir",
        "AJK",
        "National Assembly",
        "Kashmir",
        "PPP"
      ],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  }
]