[
  {
    "id": "ca88be02fa198e598477c954",
    "country": "PAKISTAN",
    "source_name": "The Express Tribune",
    "source_slug": "the_express_tribune",
    "url": "https://tribune.com.pk/story/2593305/fbr-permits-stranded-afghan-transit-shipments-to-move-from-chaman-and-quetta-to-ports",
    "title": "FBR permits stranded Afghan transit shipments to move from Chaman and Quetta to ports",
    "published_at": "2026-02-18T11:23:35+00:00",
    "author": "Ehtesham Mufti",
    "summary": "Stuck commercial goods will now be moved to the ports of Karachi",
    "content_text": "FBR permits stranded Afghan transit shipments to move from Chaman and Quetta to ports\nStuck commercial goods will now be moved to the ports of Karachi\nThe Federal Board of Revenue (FBR) has allowed the re-export of Afghan transit trade consignments, that had remained stranded for months at Chaman and Quetta, through Karachi's ports.\nThe main border crossings with Afghanistan have remained closed to regular trade and transit since October 10, 2025, following deadly clashes along the frontier after Kabul failed to stem terrorist attacks in Pakistan originating from its soil.\nOn Oct 16, the FBR officially suspended all Afghan Transit Trade operations from Karachi’s ports. All gate passes for Afghan transit consignments were cancelled and clearance of such cargo was halted at Karachi Port and Port Qasim.\nRead: K-P urges talks to revive Afghan border trade\nAlthough a ceasefire was discussed in talks hosted by Qatar and Turkiye, trade has not resumed since then. More than 10,000 Pakistani and Afghan traders, along with transit trade shipments, were reportedly stranded at Karachi port, resulting in losses amounting to billions of rupees.\nHowever, the FBR has now permitted the reverse movement and subsequent re-export of the stranded consignments in a notificated issued on Tuesday.\n“Reverse movement of all stranded Afghan transit trade cargo has been allowed for its subsequent re-export from Karachi port and Port Qasim Terminal,” said the notification issued by the Directorate of Transit Trade.\nAccording to the orders, commercial goods belonging to several countries that were stuck in Chaman and Quetta will now be moved to the ports of Karachi.\nThe notification directed concerned tracking and monitoring companies to end the trip of the stranded cargo at Halting Station, Chaman, and NLC Dry Port, Quetta, and then initiate the reverse movement from those stations to Karachi ports.\nThe FBR stated that the reverse movement of transit trade goods would be carried out in accordance with all applicable rules and regulations. For the transportation of transit goods from the borders, bonded carriers would be required to submit applications to the FBR.\nUnder the directives, one customs official will accompany every convoy of up to 15 vehicles during the transfer. “A sepoy shall be deputed with each convoy of up to 15 vehicles who will only be responsible to collect manual acknowledgment on manual transport notes for record,” the notification said.\nThe FBR further directed that tracking companies must submit certificates confirming that all monitoring devices were functional and that the consignment was “good to go”. It added that all payments related to tracking and monitoring devices for the reverse journey of each container must be fully cleared.\nA manual transport note will be issued for each bonded vehicle carrying transit trade goods, containing complete details of the vehicle and the driver. Each manual transport note will be signed by the sealing officer of the Directorate of Transit Trade, Quetta.\nContainers carrying transit goods will be cleared after thorough inspection by the customs department. The representative or bonded carrier will also issue a duly signed carrier manifest for each vehicle and certify in writing that the stranded cargo remained safe and that all seals are intact.\n“Customs staff at Quetta/Chaman will inspect PCCSS and shipper seals and if any seal is found to be tampered or broken, or where any discrepancy is observed in weight or scanning report, such consignment shall be subject to proper examination,” the notification stated.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
    "content_length": 3757,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)",
      "LLM_PARSE_ERROR: could not extract JSON"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Karachi",
      "Quetta",
      "FBR",
      "Afghan border",
      "terrorist",
      "clashes"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Karachi",
      "Quetta",
      "FBR",
      "Afghan border"
    ],
    "keywords_threat_matched": [
      "terrorist",
      "clashes"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Karachi",
      "Quetta",
      "FBR",
      "Afghan border"
    ],
    "kw_threat_hits": [
      "terrorist",
      "clashes"
    ],
    "relevance_score": 100.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 60.0,
    "prepriority_score": 94.5,
    "prepriority_bucket": "CRITICAL",
    "threat_score": 0.0,
    "threat_level": "LOW",
    "threat_vector": "OTHER",
    "one_liner_threat": "",
    "reasons": [],
    "risk_index": 54.0,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://tribune.com.pk/feed/home",
      "fetched_at": "2026-02-18T18:40:03.932061+00:00",
      "rss": {
        "published_at": "2026-02-18T11:23:35+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Pakistani",
        "PK",
        "Karachi",
        "Quetta",
        "FBR",
        "Afghan border"
      ],
      "kw_threat_hits": [
        "terrorist",
        "clashes"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "80b4c40ca985bcdbf7c7943b",
    "country": "PAKISTAN",
    "source_name": "The Express Tribune",
    "source_slug": "the_express_tribune",
    "url": "https://tribune.com.pk/story/2593304/uae-president-re-emerges-in-video-with-us-senator-after-rumours-about-health",
    "title": "UAE president re-emerges in video with US senator after rumours about health",
    "published_at": "2026-02-18T11:03:06+00:00",
    "author": "AFP",
    "summary": "'Not only is he alive, but he is also well and as sharp as I've ever seen him,' says US Senator Lindsey Graham",
    "content_text": "UAE president re-emerges in video with US senator after rumours about health\n'Not only is he alive, but he is also well and as sharp as I've ever seen him,' says US Senator Lindsey Graham\nEmirati President Mohamed bin Zayed Al Nahyan appeared in a meeting with a United States senator on Wednesday, making a first appearance since rumours about his health spread following a now-deleted Turkish presidency statement.\nEarlier this month, Turkiye's President Recep Tayyip Erdogan went to Saudi Arabia and was meant to later visit the neighbouring United Arab Emirates, amid an ongoing rift between the two Gulf powers.\nBut on Sunday, Erdogan said he was postponing his Abu Dhabi trip because the Emirati leader had a \"health problem\" — in a statement that was later deleted.\nThe incident fuelled rumours online about Sheikh Mohamed's health, with his Wikipedia page even briefly being edited to say he was dead.\nOn Wednesday, the presidential court shared video footage of the Emirati president, smiling alongside US Republican Senator Lindsey Graham during a meeting at Qasr Al Shati in Abu Dhabi.\nThe UAE's official WAM news agency also shared photographs of the meeting, in which Sheikh Mohamed appeared alongside Graham.\nUAE President receives US Senator Lindsey Graham#WamNews https://t.co/yNuv6DUh6S pic.twitter.com/wTlChxsHLJ\n— WAM English (@WAMNEWS_ENG) February 18, 2026\n\"To those who are perpetuating false narratives against the United Arab Emirates and President Sheikh MohamedBin Zayed personally, you are full of it,\" Graham said on X.\n\"I met with him today for an hour and a half. Not only is he alive, but he is also well and as sharp as I've ever seen him,\" added Graham, who said he was heading to Saudi Arabia next.\nTo those who are perpetuating false narratives against the United Arab Emirates and President Sheikh @MohamedBinZayed personally, you are full of it. I met with him today for an hour and a half. Not only is he alive, but he is also well and as sharp as I’ve ever seen him. To…\n— Lindsey Graham (@LindseyGrahamSC) February 18, 2026\nThe Emirati leader's team on Saturday evening released photos taken the same day showing Sheikh Mohamed, known as MBZ, smiling and apparently in good health, with Sheikh Tamim bin Hamad Al Thani, the emir of Qatar.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
    "content_length": 2427,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "PK",
      "dead"
    ],
    "keywords_national_matched": [
      "PK"
    ],
    "keywords_threat_matched": [
      "dead"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "PK"
    ],
    "kw_threat_hits": [
      "dead"
    ],
    "relevance_score": 20.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 15.0,
    "prepriority_score": 50.0,
    "prepriority_bucket": "MEDIUM",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://tribune.com.pk/feed/home",
      "fetched_at": "2026-02-18T18:40:03.932286+00:00",
      "rss": {
        "published_at": "2026-02-18T11:03:06+00:00"
      },
      "kw_national_hits": [
        "PK"
      ],
      "kw_threat_hits": [
        "dead"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "725f88c22013f835136f34f5",
    "country": "PAKISTAN",
    "source_name": "The Express Tribune",
    "source_slug": "the_express_tribune",
    "url": "https://tribune.com.pk/story/2593301/pakistan-wont-hesitate-to-conduct-new-strikes-on-afghanistan-khawaja-asif-says",
    "title": "Pakistan 'won't hesitate' to carry out more air strikes in Afghanistan, says Khawaja Asif",
    "published_at": "2026-02-18T10:30:04+00:00",
    "author": "Web Desk",
    "summary": "Defence minister says war with India remains 'a possibility' as New Delhi, Kabul align on striking Pakistan",
    "content_text": "Pakistan 'won't hesitate' to carry out more air strikes in Afghanistan, says Khawaja Asif\nDefence minister says war with India remains 'a possibility' as New Delhi, Kabul align on striking Pakistan\nDefence Minister Khawaja Asif on Wednesday said Pakistan would not hesitate to conduct more air strikes in Afghanistan if no action was taken by Kabul against militants on its soil to ensure peace.\nThe federal government has been consistently raising its voice on international forums against terrorist sanctuaries operating in Afghanistan and using its soil to launch attacks on Pakistan — a development attested to by the United Nations Security Council.\nRecently, a suicide bomber struck the Imambargah Khadijah al-Kubra during Friday prayers in Islamabad, killing 36 people and injuring around 169 others. The attack was the deadliest in Islamabad in more than a decade and the deadliest nationwide since the Peshawar mosque bombing in January 2023.\nImmediately following the blast, raids were conducted in Nowshera and Peshawar, resulting in the arrest of four facilitators. The Daesh-linked mastermind, an Afghan national, was also captured. Interior Minister Mohsin Naqvi stated that the network behind the blast was trained in Afghanistan and that authorities had gathered intelligence on the suspects prior to the attack.\nIn an an interview with FRANCE 24 today on the entire situation, the defence minister said: \"Any attack in Pakistan, it has the blessings of Afghan government.\"\nQuestioned about alleged air strikes by Pakistan in Afghanistan last year and whether such an option was on the table again, Asif said: \"We always have that option and we can exercise that option. There is absolutely, we won't hesitate ... If someone in Kabul can underwrite peace, obviously there will be no hostilities, but they continue to patronise, continue to become co-conspirators. They have the control of the whole of Afghanistan. If these outfits are operating from their soil, they have the responsibility. They cannot deny the responsibility.\"\nIn August last year, Afghan officials claimed that two drone strikes had hit the house of a man in Shinwar district, Nangarhar province. The Afghan government had summoned Pakistan’s Ambassador in Kabul to lodge a formal protest against what it had claimed were Pakistani military strikes in Nangarhar and Khost provinces.\nIn November, the Afghan Taliban regime had again accused Pakistan of launching air strikes. Taliban spokesperson Zabihullah Mujahid said that Pakistan had \"bombed\" Afghanistan's Khost province and carried out air strikes in Kunar and Paktika. In response, Pakistan had vehemently dismissed Kabul's allegations, insisting that Islamabad neither carried out covert cross-border operations nor targeted civilians.\nIn his interview, Asif further stated that all the terrorist factions currently operating in Afghanistan, including the East Turkestan Islamic Movement (ETIM), Tehreek-e-Taliban Pakistan (TTP) Pakistan, TTP Afghanistan, Islamic State and Daesh, along with a dozen or more smaller groups, were present due to the attitude and non-seriousness of the Kabul government in curbing terrorism.\n\"They have actually provided them safe havens on their soil,\" Asif said.\nResponding to questions about India’s alleged involvement in supporting terrorists in Afghanistan, Asif said, “After the four-day conflict in May last year, India was badly beaten. Their humiliation on the international stage was clear after being defeated by a state much smaller in geography and even in army strength. Our air force practically decimated their attempts to invade Pakistan. As a result, India is now waging a proxy war against Pakistan.\"\nAsif added that India, along with Kabul and terrorist outfits operating in Afghanistan, were \"on the same page\".\n\"However, India will not accept this reality. How can you expect them to accept it? They will continue to deny it, but they have very good relations with Kabul. Now, we are facing a proxy war, and we will continue to deal with it.\"\nAlso Read: Security czar sees India's hand in series of attacks\nAsif said that Pakistan had no contact with India, direct or indirect. He said that war with India was still \"a possibility\" in such conditions.\n\"We approached friendly countries that tried to mediate between Pakistan and Afghanistan,\" he said. \"I’ve been part of attempts in Istanbul, Doha and even Kabul. But these attempts did not yield results. They acknowledged that TTP is operating from their territory and indirectly admitted they do not have control over them.\"\nHe added, \"We told them, then let us deal with them. Allow us to handle them if you can’t control them.\"\nPakistan’s contribution to Gaza Peace Board\nWhen asked about the potential for Pakistan to contribute to the Gaza Peace Board, Asif said he sees no problem with it, but it depended on the \"terms of reference\" for the peace force.\n“We have been participating for many years. Pakistan was the number one contributor to the United Nations peacekeeping forces in Africa, East Timor, Somalia, Congo, and multiple other locations. We have that experience,\" Asif said.\nHe continued, \"Gaza and Palestine are causes very close to our hearts, as they are for the people of Pakistan. We have shown solidarity with them for many decades.\" Asif stressed that Pakistan had consistently supported Palestine in all global forums. \"This is a good opportunity, and we hope it will bring us closer to achieving a two-state solution in the Middle East.\"\nOn the question of normalisation of relations between several Muslim countries and Israel, Asif said that he did see \"this option being even considered by Pakistan\" unless Palestinians were granted \"the right of self-determination in their own homeland\" within the framework of a two-state solution.\nRead More: Pakistan open to diplomacy, not war with Afghanistan\nOn the topic of Pakistan's political system, Asif reflected on the historical role of the military in politics, particularly during the 1950s and 1960s.\n\"There were times when the establishment intervened and took control. But that is not happening now,\" he said. \"The current situation, with the threat of terrorism from Afghanistan and India, and an economy that was in shambles three years ago, is different.\"\nAsif described the current system as a \"hybrid arrangement\", where national institutions, including the military, cooperated with the elected government.\n\"The armed forces are the most important national institution and they are helping the political government,\" he said. \"There is absolutely no military rule. My boss is the prime minister,\" Asif concluded.\nPakistan’s allegations against Afghanistan, India of supporting terrorism\nPakistan has repeatedly pointed to an Afghanistan–India nexus behind terrorism in the country.\nIn November 2024, Inter-Services Public Relations Director-General Lieutenant General Ahmed Sharif Chaudhry had issued a warning that the Afghan regime was a threat not just to Pakistan but to the entire region and the world, citing the abandonment of $7.2 billion worth of American military equipment during the US withdrawal.\nLt Gen Chaudhry reiterated that the Afghan regime was harbouring “Non-State Actors” who posed a threat to various countries in the region, noting the Taliban’s failure to establish an inclusive state and government post-2021. He stressed that Pakistan's issue was with the Afghan Taliban regime, not the Afghan people.\nRead More: Afghan regime poses threat to region, world: DG ISPR\nAfter the conflict with India in May 2025, Field Marshal Asim Munir had said that Pakistan would never be coerced, and that all inimical designs to derail the country's counterterrorism efforts would be “comprehensively defeated”.\nAlso Read: India's 'hydro terrorism' untenable: COAS\nHe had said Pakistan’s military remained prepared to respond across the full spectrum of conflict. He particularly criticised India’s growing tendency to resort to unprovoked military aggression, cautioning that strategic stability in South Asia was increasingly fragile and hinged on justice, especially in Kashmir.\nAfter recent terrorist attacks in Balochistan, Naqvi had once again blamed India for a coordinated terror campaign in the province.\n“These were not ordinary terrorists. India is behind these attacks. I can tell you for certain that India planned these attacks along with these terrorists,” he said.\nHe added that authorities would pursue every individual involved, as well as those directing them from behind the scenes.\nRead This: Security czar sees India's hand in series of attacks\nNaqvi further claimed that India was the “main country” behind terrorism, saying it not only provides financial support to terrorists but also assists them in planning and strategising.\nIn 2023, a UN report also revealed that the TTP had established a new base in K-P in mid-2023. The report shed light on close ties not only between the TTP and the Afghan Taliban but also with anti-Pakistani groups and al Qaeda.\nRead This: The breeding ground for terror\nThe report further revealed that some Taliban members had also joined the TTP, perceiving it as a religious obligation to provide support.\nInterlocutors reported that TTP members and their families received regular aid packages from the Taliban.\nImportantly, the UN report noted a significant increase in Afghan nationals in the TTP ranks. This supported Pakistan’s stance that a growing number of Afghan nationals were involved in suicide attacks in the country.\nMore recently, a UNSC report said that attacks on Pakistan by the TTP from Afghanistan have increased, endorsing Islamabad's long-running complaints about militant sanctuaries across the border. The 37th report by the Analytical Support and Sanctions Monitoring Team, dated February 4, not only endorsed Islamabad's stance that Afghanistan had become a sanctuary for militants who used its territory to launch attacks on Pakistan, but also came at a time when the country is facing a renewed spate of violence.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
    "content_length": 10199,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)",
      "LLM_ERROR: ValueError: Requested tokens (1489) exceed context window of 1024",
      "LLM_ERROR: ValueError: Requested tokens (1489) exceed context window of 1024"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Peshawar",
      "Nowshera",
      "Balochistan",
      "Federal Government",
      "DG ISPR",
      "ISPR",
      "Armed Forces",
      "Defence",
      "Military",
      "COAS",
      "Kashmir",
      "attack",
      "armed",
      "militant",
      "militants",
      "terror",
      "terrorism",
      "terrorist",
      "terrorists",
      "blast",
      "bombing",
      "bombed",
      "suicide",
      "suicide bomber",
      "killing",
      "counterterrorism",
      "arrest",
      "suspects",
      "hostilities",
      "threat",
      "warning"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Peshawar",
      "Nowshera",
      "Balochistan",
      "Federal Government",
      "DG ISPR",
      "ISPR",
      "Armed Forces",
      "Defence",
      "Military",
      "COAS",
      "Kashmir"
    ],
    "keywords_threat_matched": [
      "attack",
      "armed",
      "militant",
      "militants",
      "terror",
      "terrorism",
      "terrorist",
      "terrorists",
      "blast",
      "bombing",
      "bombed",
      "suicide",
      "suicide bomber",
      "killing",
      "counterterrorism",
      "arrest",
      "suspects",
      "hostilities",
      "threat",
      "warning"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Peshawar",
      "Nowshera",
      "Balochistan",
      "Federal Government",
      "DG ISPR",
      "ISPR",
      "Armed Forces",
      "Defence",
      "Military",
      "COAS",
      "Kashmir"
    ],
    "kw_threat_hits": [
      "attack",
      "armed",
      "militant",
      "militants",
      "terror",
      "terrorism",
      "terrorist",
      "terrorists",
      "blast",
      "bombing",
      "bombed",
      "suicide",
      "suicide bomber",
      "killing",
      "counterterrorism",
      "arrest",
      "suspects",
      "hostilities",
      "threat",
      "warning"
    ],
    "relevance_score": 100.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 100.0,
    "prepriority_score": 98.5,
    "prepriority_bucket": "CRITICAL",
    "threat_score": 0.0,
    "threat_level": "LOW",
    "threat_vector": "OTHER",
    "one_liner_threat": "",
    "reasons": [],
    "risk_index": 54.0,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://tribune.com.pk/feed/home",
      "fetched_at": "2026-02-18T18:40:03.932019+00:00",
      "rss": {
        "published_at": "2026-02-18T10:30:04+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Pakistani",
        "PK",
        "Islamabad",
        "Peshawar",
        "Nowshera",
        "Balochistan",
        "Federal Government",
        "DG ISPR",
        "ISPR",
        "Armed Forces",
        "Defence",
        "Military",
        "COAS",
        "Kashmir"
      ],
      "kw_threat_hits": [
        "attack",
        "armed",
        "militant",
        "militants",
        "terror",
        "terrorism",
        "terrorist",
        "terrorists",
        "blast",
        "bombing",
        "bombed",
        "suicide",
        "suicide bomber",
        "killing",
        "counterterrorism",
        "arrest",
        "suspects",
        "hostilities",
        "threat",
        "warning"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "8ba41cf8e4b1b0c79a51ae30",
    "country": "PAKISTAN",
    "source_name": "The Express Tribune",
    "source_slug": "the_express_tribune",
    "url": "https://tribune.com.pk/story/2593300/bisp-increases-rs1000-cash-support-for-beneficiaries-from-1st-of-ramazan",
    "title": "BISP increases Rs1,000 cash support for beneficiaries from 1st of Ramazan",
    "published_at": "2026-02-18T10:26:17+00:00",
    "author": "Razya Khan",
    "summary": "Also hikes Rs500 in stipend for students enrolled at Benazir Educational Scholarships and Nashonuma Programme",
    "content_text": "BISP increases Rs1,000 cash support for beneficiaries from 1st of Ramazan\nAlso hikes Rs500 in stipend for students enrolled at Benazir Educational Scholarships and Nashonuma Programme\nThe Benazir Income Support Programme (BISP) on Wednesday raised cash support for its beneficiaries, increasing the quarterly amount under the Benazir Kafalat Programme by Rs1,000, bringing the new stipend to Rs14,500 starting from the first of Ramazan.\nAdditionally, BISP announced a Rs500 increase in stipends for recipients of the Benazir Educational Scholarships and the Benazir Nashonuma Programme. These enhancements aim to provide more financial relief to the program's beneficiaries, particularly as the holy month of Ramazan approaches.\nچیئرپرسن بینظیر انکم سپورٹ پروگرام سینیٹر روبینہ خالد کی زیرِ صدارت آج بی آئی ایس پی ہیڈکوارٹرز، اسلام آباد میں لائیو ای۔کچہری منعقد ہوئی.سینیٹر روبینہ خالد نے لائیو ای۔کچہری کے آغاز میں خطاب کرتے ہوئے اعلان کیا کہ بینظیر کفالت پروگرام کی سہ ماہی قسط میں ایک ہزار روپے کا اضافہ کر… pic.twitter.com/jjTrOR0nGm\n— Benazir Income Support Programme (@bisp_pakistan) February 18, 2026\nThe decision was disclosed during a live e-Katcheri session held at the BISP Headquarters in Islamabad, led by Chairperson Senator Rubina Khalid.\nThe e-Katcheris are interactive sessions designed to address the concerns of the public, understand the challenges faced by beneficiaries and ensure the timely resolution of any issues.\nWith the revised increase of Rs1,000, the quarterly stipend for eligible women under the Benazir Kafalat Programme was raised from Rs13,500 to Rs14,500. Meanwhile, the stipends under the Benazir Educational Scholarships for girls in the primary section were increased by Rs500, bringing the total to Rs3,000. For secondary-level students, the stipend was increased to Rs3,800.\nAddressing the session’s participants, Senator Rubina highlighted the importance of the financial support, particularly during Ramazan.\n\"A significant enhancement in financial assistance is being provided under BISP in view of the upcoming holy month of Ramazan,\" she said. \"Ramazan is a month of blessings, patience, and compassion, and in line with this spirit, BISP is extending maximum possible relief to deserving families.\"\nShe further emphasised the rightful entitlements of beneficiaries, urging women to ensure that they received the full amount due to them and not accept any unauthorised deductions. “The stipend is your lawful right, and BISP will initiate strict action against any attempt at unjust deduction or malpractice,” she warned.\nSenator Rubina also encouraged women to be confident in raising their voices against injustice. She reiterated that no compromises would be made regarding the rights of BISP beneficiaries.\nIn case of any complaints, beneficiaries were urged to contact the BISP helpline at 0800-26477 or visit the nearest BISP office.\nDuring the live e-Katcheri, 31 callers from across Pakistan directly reached out to the BISP chairperson to raise their concerns. The session lasted for an hour, and BISP’s director generals and relevant officers were present to ensure swift resolution of the complaints. The most common issues raised by callers included matters related to re-surveying, biometric verification, program enrollment, and stipend disbursements.\nSenator Rubina attentively listened to all grievances and issued clear directives to concerned authorities, emphasising that any negligence in addressing public complaints would not be tolerated. She stressed that all issues must be resolved within the stipulated timeframe, ensuring that no delay or oversight occurs in meeting the needs of the beneficiaries.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
    "content_length": 3822,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "PK",
      "Islamabad",
      "اسلام آباد"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "PK",
      "Islamabad",
      "اسلام آباد"
    ],
    "keywords_threat_matched": [],
    "national_relevant": true,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [
      "Pakistan",
      "PK",
      "Islamabad",
      "اسلام آباد"
    ],
    "kw_threat_hits": [],
    "relevance_score": 83.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 24.0,
    "prepriority_score": 77.9,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://tribune.com.pk/feed/home",
      "fetched_at": "2026-02-18T18:40:03.932107+00:00",
      "rss": {
        "published_at": "2026-02-18T10:26:17+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "PK",
        "Islamabad",
        "اسلام آباد"
      ],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "d6d8b543f83bc99baac2b34f",
    "country": "PAKISTAN",
    "source_name": "The Express Tribune",
    "source_slug": "the_express_tribune",
    "url": "https://tribune.com.pk/story/2593284/ihc-takes-up-mazari-chattha-pleas-challenging-conviction-under-peca",
    "title": "IHC takes up Mazari, Chattha pleas challenging conviction under PECA",
    "published_at": "2026-02-18T09:05:53+00:00",
    "author": "Fiaz Mehmood",
    "summary": "Applications seeking suspension of their sentences in controversial tweets case have been set for hearing on Thursday",
    "content_text": "IHC takes up Mazari, Chattha pleas challenging conviction under PECA\nApplications seeking suspension of their sentences in controversial tweets case have been set for hearing on Thursday\nThe Islamabad High Court has fixed for hearing on Thursday the appeals filed by rights activist and lawyer Imaan Mazari and her husband, advocate Hadi Ali Chattha, against their 17-year prison sentences in the controversial social media posts case.\nJustice Muhammad Asif will hear the appeals. The Registrar’s Office of the high court scheduled the pleas, along with their applications seeking suspension of thesentences.\nThe case was registered in August last year over posts and reposts on X, formerly Twitter, which investigators described as undermining state institutions and aligning with proscribed organisations.\nIn a detailed 22-page judgment authored by District and Sessions Judge Islamabad Afzal Majoka, the court convicted both accused on multiple charges linked to social media posts that the prosecution argued amounted to an anti-state narrative under cybercrime laws, while acquitting them of one charge related to hate speech.\nThe court convicted both under Section 9 of the Prevention of Electronic Crimes Act and sentenced them to five years of rigorous imprisonment each, along with a fine of Rs5 million each. In case of default on payment, they would undergo one year of simple imprisonment.\nThey were also convicted under Section 10 of the same law and awarded 10 years of rigorous imprisonment each, with a fine of Rs30 million each. Failure to pay the fine would entail an additional two years of simple imprisonment. The court also convicted them under Section 26-A of the act and sentenced them to two years of rigorous imprisonment each, coupled with a fine of Rs1 million each. In default of payment, they would have to undergo six months of simple imprisonment.\nIn their petitions, the couple has requested the court to suspend their sentences and release them on bail.\nThe two subsequently challenged the trial court’s January 24 order that was widely criticised by politicians, lawyers and civil society.\nThe conviction has also drawn international attention. Amnesty International issued an urgent action appeal to Prime Minister Shehbaz Sharif on February 2, calling for the couple’s immediate and unconditional release.\nOn February 4, United Nations experts also expressed alarm over the verdict. Five UN special rapporteurs said the couple had been sentenced to lengthy prison terms for “simply exercising rights guaranteed by international human rights law”.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
    "content_length": 2732,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "PK",
      "Islamabad",
      "High Court",
      "Islamabad High Court"
    ],
    "keywords_national_matched": [
      "PK",
      "Islamabad",
      "High Court",
      "Islamabad High Court"
    ],
    "keywords_threat_matched": [],
    "national_relevant": true,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [
      "PK",
      "Islamabad",
      "High Court",
      "Islamabad High Court"
    ],
    "kw_threat_hits": [],
    "relevance_score": 75.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 24.0,
    "prepriority_score": 78.4,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://tribune.com.pk/feed/home",
      "fetched_at": "2026-02-18T18:40:03.932096+00:00",
      "rss": {
        "published_at": "2026-02-18T09:05:53+00:00"
      },
      "kw_national_hits": [
        "PK",
        "Islamabad",
        "High Court",
        "Islamabad High Court"
      ],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  }
]