[
  {
    "id": "a126881127d51e58407fd36d",
    "country": "PAKISTAN",
    "source_name": "The News International",
    "source_slug": "the_news_international",
    "url": "https://www.thenews.com.pk/latest/1381918-notices-served-on-minister-sapm-for-violating-election-code-of-conduct",
    "title": "Punjab by-polls: Notices served on minister, SAPM for 'violating' election code of conduct",
    "published_at": "2025-11-21T01:33:00+00:00",
    "author": "Shahid Farooq",
    "summary": "<img src=\"https://www.thenews.com.pk/assets/uploads/updates/2025-11-21/l_1381918_062710_updates.jpg\" />\n                \t\t\t\tThis collage of pictures show Federal Minister of Power Sardar Awais Ahmad Khan Leghari  and Special Assistant to the Prime Minister Huzaifa Rehman. &mdash;APP/NA website/FileShow-cause notices have been issued to Minister for Power Sardar Awais Ahmad Khan Leghari and Special Assistant to the...",
    "content_text": "Punjab by-polls: Notices served on minister, SAPM for ‘violating’ election code of conduct\nTalal Chaudhry violating election code despite two previous notices, official tells electoral watchdog\nShow-cause notices have been issued to Minister for Power Sardar Awais Ahmad Khan Leghari and Special Assistant to the Prime Minister (SAPM) Huzaifa Rehman for allegedly violating the code of conduct under the Election Act 2017, Punjab Election Commissioner Sharifullah said on Thursday.\nA spokesperson for the provincial election commissioner said that the federal minister and the SAPM were directed to submit their explanations by November 21 (today).\n“No minister or advisor is allowed to run an election campaign,” the spokesperson said, warning that swift action will be taken against any code violations to ensure free, fair, and impartial elections.\nBy-elections in six national and seven provincial assembly seats in Punjab are scheduled for November 23.\nAccording to the Dera Ghazi Khan district monitoring officer, Leghari reportedly participated in the election campaign of PML-N candidate Mahmood Leghari in the NA-185 constituency.\nThe monitoring officer said that, by taking part in the campaign as a federal minister, Leghari breached official instructions. The minister has been asked to appear before the authorities and clarify his position regarding the alleged ECP violations.\nThe monitoring officer further said that SAPM Rehman has been violating the election code of conduct. The officer said that the SAPM intends to participate in the election campaign of the PML-N candidate.\nMeanwhile, Faisalabad’s district monitoring officer wrote to the election commission, alleging that State Minister for Interior Talal Chaudhry had been repeatedly violating the election code of conduct.\nThe monitoring officer told the election watchdog that the state minister had been warned over the phone about his conduct, but failed to comply with the ECP code of conduct despite two previous notices.\nThe state minister was fined Rs50,000 for breaching the ECP’s code of conduct, the officer said, adding that the matter was being forwarded to the election body for \"further action\".\nIt is pertinent to mention here that the by-election campaigns for 13 constituencies of Punjab’s national and provincial assemblies will officially conclude at midnight on November 21.\nArrangements have almost been completed to hold the by-elections in six National and seven provincial assembly constituencies in Punjab, on November 23.\nThe ECP warned that candidates who continue engaging in political activities after this deadline will face legal consequences.\nThe ECP cautioned that those who breach these regulations could be subject to penalties such as imprisonment for a maximum of two years, a fine of up to Rs100,000, or both.\nNational Assembly constituencies included NA-18 Haripur, NA-96 Faisalabad-Il, NA-104 Faisalabad-X, NA-129 Lahore-XIll, NA-143 Sahiwal-IlI, NA-185 D.G. Khan-ll, PP-73 Sargodha-llI, PP-87 Mianwali-lII, PP-98 Faisalabad-I, PP-115 Faisalabad-XVIll, PP-116 Faisalabad-XIX, PP-203 Sahiwal-VI and PP-269 Muzaffargarh-ll.\n-\nMQM-P calls for new province in Sindh\n-\nUS report validates Pakistan military edge over India: PM\n-\nBanned TTP poses serious threat to Pakistan security: UNSC panel\n-\nCM Afridi clarifies remarks on by-poll after ECP requests army deployment\n-\nDubai sees 3.2m Pakistani passengers in 2025 as airport sets new milestone\n-\nSecurity forces kill 23 Indian proxy terrorists in KP's Kurram\n-\nPakistan to construct island to boost oil exploration: report\n-\nRussia ready to mediate Pakistan's issues with India, Afghanistan: envoy",
    "content_length": 3662,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Lahore",
      "Faisalabad",
      "Sargodha",
      "Sahiwal",
      "Mianwali",
      "Dera Ghazi Khan",
      "Muzaffargarh",
      "Punjab",
      "Sindh",
      "KP",
      "National Assembly",
      "ECP",
      "Military",
      "PML-N",
      "MQM",
      "terrorists",
      "threat",
      "warning"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Lahore",
      "Faisalabad",
      "Sargodha",
      "Sahiwal",
      "Mianwali",
      "Dera Ghazi Khan",
      "Muzaffargarh",
      "Punjab",
      "Sindh",
      "KP",
      "National Assembly",
      "ECP",
      "Military",
      "PML-N",
      "MQM"
    ],
    "keywords_threat_matched": [
      "terrorists",
      "threat",
      "warning"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Lahore",
      "Faisalabad",
      "Sargodha",
      "Sahiwal",
      "Mianwali",
      "Dera Ghazi Khan",
      "Muzaffargarh",
      "Punjab",
      "Sindh",
      "KP",
      "National Assembly",
      "ECP",
      "Military",
      "PML-N",
      "MQM"
    ],
    "kw_threat_hits": [
      "terrorists",
      "threat",
      "warning"
    ],
    "relevance_score": 100.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 10.0,
    "keyword_intensity": 87.0,
    "prepriority_score": 74.7,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.thenews.com.pk/rss/1/1",
      "fetched_at": "2026-02-18T18:40:26.577741+00:00",
      "rss": {
        "published_at": "2025-11-21T01:33:00+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Pakistani",
        "PK",
        "Lahore",
        "Faisalabad",
        "Sargodha",
        "Sahiwal",
        "Mianwali",
        "Dera Ghazi Khan",
        "Muzaffargarh",
        "Punjab",
        "Sindh",
        "KP",
        "National Assembly",
        "ECP",
        "Military",
        "PML-N",
        "MQM"
      ],
      "kw_threat_hits": [
        "terrorists",
        "threat",
        "warning"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "cc955674ffcb4781107cc3eb",
    "country": "PAKISTAN",
    "source_name": "The News International",
    "source_slug": "the_news_international",
    "url": "https://www.thenews.com.pk/latest/1381786-27th-amendment-empowers-fcc-to-hear-all-constitutional-cases-minister",
    "title": "27th Amendment empowers FCC to hear all constitutional cases: minister",
    "published_at": "2025-11-20T19:59:00+00:00",
    "author": "Shahid Farooq",
    "summary": "<img src=\"https://www.thenews.com.pk/assets/uploads/updates/2025-11-21/l_1381786_010142_updates.jpg\" />\n                \t\t\t\tMinister of State for Law and Justice Barrister Aqeel Malik addressing an event on December 21, 2024. &mdash; Facebook@BarristerAqeelMalikState Minister for Law Aqeel Malik said on Thursday that the 27th Amendment has vested authority to hear constitutional matters in the Federal Constitutional...",
    "content_text": "27th Amendment empowers FCC to hear all constitutional cases: minister\nJudges attempted to file their petition in SC, but apex court isn’t correct forum for this request, says Aqeel Malik\nState Minister for Law Aqeel Malik said on Thursday that the 27th Amendment has vested authority to hear constitutional matters in the Federal Constitutional Court (FCC), not the Supreme Court (SC).\n“Judges have attempted to file their petition in the Supreme Court, but the court is not the correct forum for this request,” he said while speaking on Geo News’ programme “Aaj Shahzeb Khanzada Kay Saath”.\nMalik said the Supreme Court and the FCC had adopted their respective rules, adding: “The constitutional court has been established, and all cases of constitutional nature will now be heard by it.” He questioned why the judges had submitted their plea to the Supreme Court in the first place.\nAccording to him, the judges’ petition “should have been filed in the constitutional court”, as only the FCC is empowered to hear it after the amendment.\nMalik also rejected claims about any compromise on judicial independence, stating that the authority for transferring judges — previously held by the president — had now been assigned to the Judicial Commission.\n“Resigning is the judges’ prerogative,” he said, adding that a misleading impression was being created regarding judicial resignations.\nMeanwhile, sources said four Islamabad High Court judges have decided to challenge the 27th Amendment in the Supreme Court, with a draft of their petition prepared and sent ahead. Justice Mohsin Akhtar Kayani, Justice Babar Sattar, Justice Saman Rafat Imtiaz, and Justice Sardar Ejaz Ishaq Khan are among the petitioners, the sources added.\nHowever, Supreme Court sources confirmed no petition from the judges had yet been filed against the amendment. Sources in the Federal Constitutional Court also said no such plea had been submitted there either.\nThe Pakistan Muslim League-Nawaz (PML-N)-led ruling coalition passed the 27th Amendment earlier this month, which brought changes to the judicial structure and military command.\nA major structural change came in the form of the FCC, which was established as a new judicial forum with equal representation from all provinces. The amendment empowered the FCC to exercise suo motu authority upon petitions.\nThe judicial overhaul, part of the latest amendments, not only paved the way for dissolving the Constitutional Benches but also, through the Supreme Court Practice and Procedure (Amendment) Bill 2025, transferred the authority to constitute case-hearing benches to a three-member committee headed by the chief justice.\nThe amendment assigns the president and prime minister key roles in judicial appointments, while reducing certain powers of the Supreme Court and shifting some of its authority to the newly established FCC.\nFollowing the passage of the amendment, Supreme Court judges Justice Mansoor Ali Shah and Justice Athar Minallah resigned from their posts in separate letters to President Asif Ali Zardari.\nThe jurists had criticised the 27th Amendment, describing it as a \"grave assault on the Constitution of Pakistan\". However, the federal government called the judges' resignations \"political speeches\" and the latter's allegations \"unconstitutional\".\nTwo days later, LHC judge Shams Mehmood Mirza followed the jurists' footsteps and quit from his position \"in protest against the newly-enacted 27th Constitutional Amendment.\"\n-\nMQM-P calls for new province in Sindh\n-\nUS report validates Pakistan military edge over India: PM\n-\nBanned TTP poses serious threat to Pakistan security: UNSC panel\n-\nCM Afridi clarifies remarks on by-poll after ECP requests army deployment\n-\nDubai sees 3.2m Pakistani passengers in 2025 as airport sets new milestone\n-\nSecurity forces kill 23 Indian proxy terrorists in KP's Kurram\n-\nPakistan to construct island to boost oil exploration: report\n-\nRussia ready to mediate Pakistan's issues with India, Afghanistan: envoy",
    "content_length": 4007,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Sindh",
      "KP",
      "High Court",
      "Islamabad High Court",
      "Federal Government",
      "ECP",
      "Military",
      "PML-N",
      "MQM",
      "assault",
      "terrorists",
      "threat"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Sindh",
      "KP",
      "High Court",
      "Islamabad High Court",
      "Federal Government",
      "ECP",
      "Military",
      "PML-N",
      "MQM"
    ],
    "keywords_threat_matched": [
      "assault",
      "terrorists",
      "threat"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Sindh",
      "KP",
      "High Court",
      "Islamabad High Court",
      "Federal Government",
      "ECP",
      "Military",
      "PML-N",
      "MQM"
    ],
    "kw_threat_hits": [
      "assault",
      "terrorists",
      "threat"
    ],
    "relevance_score": 100.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 10.0,
    "keyword_intensity": 87.0,
    "prepriority_score": 74.7,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.thenews.com.pk/rss/1/1",
      "fetched_at": "2026-02-18T18:40:26.577763+00:00",
      "rss": {
        "published_at": "2025-11-20T19:59:00+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Pakistani",
        "PK",
        "Islamabad",
        "Sindh",
        "KP",
        "High Court",
        "Islamabad High Court",
        "Federal Government",
        "ECP",
        "Military",
        "PML-N",
        "MQM"
      ],
      "kw_threat_hits": [
        "assault",
        "terrorists",
        "threat"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "3ab2ddb7f3f2eb9b8250f2d2",
    "country": "PAKISTAN",
    "source_name": "The News International",
    "source_slug": "the_news_international",
    "url": "https://www.thenews.com.pk/latest/1381731-jf-17-attracts-strong-attention-at-dubai-airshow-as-friendly-country-inks-procurement-mou",
    "title": "JF-17 attracts strong attention at Dubai Airshow as friendly country inks procurement MoU",
    "published_at": "2025-11-20T17:25:16+00:00",
    "author": "Latif ur Rehman",
    "summary": "<img src=\"https://www.thenews.com.pk/assets/uploads/updates/2025-11-20/l_1381731_103041_updates.jpg\" />\n                \t\t\t\tPakistan Air Force  JF-17 Thunder fighter jet during World Defence Air Show 2024 held in Riyadh, Saudi Arabia, February 7, 2024. &mdash; PPI Pakistan's JF-17 Thunder garnered significant attention at the Dubai Airshow 2025, leading to the signing of a memorandum of understanding  with a...",
    "content_text": "JF-17 attracts strong attention at Dubai Airshow as friendly country inks procurement MoU\nISPR terms development \"significant milestone in Pakistan's expanding defence and industrial partnerships\"\nPakistan's JF-17 Thunder garnered significant attention at the Dubai Airshow 2025, leading to the signing of a memorandum of understanding (MoU) with a friendly country for its procurement, the Inter-Services Public Relations (ISPR) said on Thursday.\nIn its statement, the military's media wing termed the MoU signing \"another significant milestone in Pakistan's expanding defence and industrial partnerships\".\nThe interest in JF-17 Thunder underscored rising global confidence in Pakistan's aviation sector, it added.\nThe development comes as Chief of the Air Staff, Air Chief Marshal Zaheer Ahmed Baber Sidhu, held a series of meetings with his counterparts from friendly countries on the sidelines of the Dubai Airshow 2025.\n\"Chief of the Air Staff also held comprehensive discussions with Lieutenant General Pilot Ibrahim Nasser Al-Alawi, Undersecretary of Defence UAE [United Arab Emirates], and Major General Rashid Mohammed Al-Shamsi, Commander UAE Air Force and Air Defence,\" the ISPR statement read.\nThe talks were focused on strengthening cooperation in advanced training, fostering collaboration in emerging aerospace technologies and enhancing the mechanisms for effective operational coordination, it added.\nThe UAE military leadership praised the Pakistan Air Force's (PAF) modernisation initiatives and growing indigenous capabilities.\nPAF's contingent for the Dubai Airshow 2025 includes the advanced JF-17 Thunder Block-III and the Super Mushshak trainer aircraft.\nThe JF-17 Thunder Block-III's operational performance in Marka-e-Haq — Pakistan's response to Indian aggression in May — has reinforced its reputation as a highly capable and cost-effective multirole fighter.\nPakistan had used JF-17 Thunder jets to destroy India's S-400 air defence system in Adampur by using hypersonic missiles during the four-day war.\nPakistan, in addition to downing multiple Indian fighter jets, struck over 20 Indian military sites across multiple regions in response to India's missile strikes inside Pakistan during the night of May 5 and 6.\nNew Delhi had claimed its strikes were aimed at \"terrorist targets\" in response to the Pahalgam attack.\nHowever, the unlawful strikes had resulted in the martyrdom of several civilians and security personnel.\n-\nMQM-P calls for new province in Sindh\n-\nUS report validates Pakistan military edge over India: PM\n-\nBanned TTP poses serious threat to Pakistan security: UNSC panel\n-\nCM Afridi clarifies remarks on by-poll after ECP requests army deployment\n-\nDubai sees 3.2m Pakistani passengers in 2025 as airport sets new milestone\n-\nSecurity forces kill 23 Indian proxy terrorists in KP's Kurram\n-\nPakistan to construct island to boost oil exploration: report\n-\nRussia ready to mediate Pakistan's issues with India, Afghanistan: envoy",
    "content_length": 2978,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Sindh",
      "KP",
      "ISPR",
      "ECP",
      "Pakistan Air Force",
      "PAF",
      "Defence",
      "Military",
      "MQM",
      "attack",
      "terrorist",
      "terrorists",
      "missile",
      "threat"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Sindh",
      "KP",
      "ISPR",
      "ECP",
      "Pakistan Air Force",
      "PAF",
      "Defence",
      "Military",
      "MQM"
    ],
    "keywords_threat_matched": [
      "attack",
      "terrorist",
      "terrorists",
      "missile",
      "threat"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Sindh",
      "KP",
      "ISPR",
      "ECP",
      "Pakistan Air Force",
      "PAF",
      "Defence",
      "Military",
      "MQM"
    ],
    "kw_threat_hits": [
      "attack",
      "terrorist",
      "terrorists",
      "missile",
      "threat"
    ],
    "relevance_score": 100.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 10.0,
    "keyword_intensity": 100.0,
    "prepriority_score": 76.0,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.thenews.com.pk/rss/1/1",
      "fetched_at": "2026-02-18T18:40:26.577776+00:00",
      "rss": {
        "published_at": "2025-11-20T17:25:16+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Pakistani",
        "PK",
        "Sindh",
        "KP",
        "ISPR",
        "ECP",
        "Pakistan Air Force",
        "PAF",
        "Defence",
        "Military",
        "MQM"
      ],
      "kw_threat_hits": [
        "attack",
        "terrorist",
        "terrorists",
        "missile",
        "threat"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "78341b872f4a58318c7fad45",
    "country": "PAKISTAN",
    "source_name": "The News International",
    "source_slug": "the_news_international",
    "url": "https://www.thenews.com.pk/latest/1381705-us-lawmakers-laud-punjab-govts-initiative-to-modernise-brick-kiln",
    "title": "US lawmakers laud Punjab govt's initiative to modernise brick-kiln",
    "published_at": "2025-11-20T16:39:48+00:00",
    "author": "Abbas Ali",
    "summary": "<img src=\"https://www.thenews.com.pk/assets/uploads/updates/2025-11-20/l_1381705_094430_updates.jpg\" />\n                \t\t\t\tPunjab Chief Minister Maryam Nawaz attends ceremony in this undated image. &mdash; Facebook/@MaryamNSharifISLAMABAD: The Congressional Pakistan Caucus has applauded Punjab&rsquo;s drive to modernise its brick-kiln sector, saying the reforms could serve as a pilot for eliminating bonded labour and...",
    "content_text": "US lawmakers laud Punjab govt's initiative to modernise brick-kiln\n“Reforms will strengthen the overall Pakistan-US partnership,” say US lawmakers\nISLAMABAD: The Congressional Pakistan Caucus has applauded Punjab’s drive to modernise its brick-kiln sector, saying the reforms could serve as a pilot for eliminating bonded labour and attracting ethical foreign investment.\n“...we extend our sincere appreciation for your government’s visionary efforts to moderni[s]e Punjab’s brick kiln industry as a means to address environmental challenges and eliminate bonded labo[u]r,” wrote Congressmen Thomas Suozzi and Jack Bergman in a letter addressed to Punjab Chief Minister Maryam Nawaz Sharif.\nCiting the US State Department’s 2022 Trafficking in Persons Report, the lawmakers noted that more than 4.5 million people in Pakistan remain trapped in the peshgi system, an entrenched bonded-labour practice.\nThey said the briefings they received highlighted the provincial administration’s “strong commitment to this transformative initiative”.\nThe letter emphasised that mechanising and modernising the brick kiln sector would help Pakistan meet international obligations while making Punjab “a more attractive destination for foreign direct investment”, particularly from American businesses seeking ethical and sustainable partnerships.\n“These reforms will enhance bilateral economic relations and strengthen the overall Pakistan-US partnership,” the caucus wrote, adding that Punjab is well placed to serve as a pilot province for the initiative.\nThe lawmakers reaffirmed their support, stating: “The Pakistan Caucus wholeheartedly supports all efforts to end bonded labo[u]r,” and encouraged the provincial leadership to reach out for assistance whenever needed.\n-\nMQM-P calls for new province in Sindh\n-\nUS report validates Pakistan military edge over India: PM\n-\nBanned TTP poses serious threat to Pakistan security: UNSC panel\n-\nCM Afridi clarifies remarks on by-poll after ECP requests army deployment\n-\nDubai sees 3.2m Pakistani passengers in 2025 as airport sets new milestone\n-\nSecurity forces kill 23 Indian proxy terrorists in KP's Kurram\n-\nPakistan to construct island to boost oil exploration: report\n-\nRussia ready to mediate Pakistan's issues with India, Afghanistan: envoy",
    "content_length": 2284,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Punjab",
      "Sindh",
      "KP",
      "Chief Minister",
      "ECP",
      "Military",
      "MQM",
      "terrorists",
      "trafficking",
      "threat"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Punjab",
      "Sindh",
      "KP",
      "Chief Minister",
      "ECP",
      "Military",
      "MQM"
    ],
    "keywords_threat_matched": [
      "terrorists",
      "trafficking",
      "threat"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Punjab",
      "Sindh",
      "KP",
      "Chief Minister",
      "ECP",
      "Military",
      "MQM"
    ],
    "kw_threat_hits": [
      "terrorists",
      "trafficking",
      "threat"
    ],
    "relevance_score": 100.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 10.0,
    "keyword_intensity": 87.0,
    "prepriority_score": 74.7,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.thenews.com.pk/rss/1/1",
      "fetched_at": "2026-02-18T18:40:26.577788+00:00",
      "rss": {
        "published_at": "2025-11-20T16:39:48+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Pakistani",
        "PK",
        "Islamabad",
        "Punjab",
        "Sindh",
        "KP",
        "Chief Minister",
        "ECP",
        "Military",
        "MQM"
      ],
      "kw_threat_hits": [
        "terrorists",
        "trafficking",
        "threat"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "fe3cecdf84e889d757d165ce",
    "country": "PAKISTAN",
    "source_name": "The News International",
    "source_slug": "the_news_international",
    "url": "https://www.thenews.com.pk/latest/1381698-security-forces-gun-down-30-terrorists-in-multiple-ibos-in-kp-ispr",
    "title": "Security forces gun down 30 terrorists in multiple IBOs in KP: ISPR",
    "published_at": "2025-11-20T16:38:00+00:00",
    "author": "Zarmeen Zehra",
    "summary": "<img src=\"https://www.thenews.com.pk/assets/uploads/updates/2025-11-20/l_1381698_085702_updates.jpg\" />\n                \t\t\t\tFrontier Constabulary and army personnel gather stand guard in Kurram, January 17, 2025. &mdash; AFPSecurity forces killed 30 Indian proxy Fitna al-Khawarij terrorists during multiple intelligence-based operations  carried out by security forces in Khyber Pakhtunkhwa , the military's media wing...",
    "content_text": "Security forces gun down 30 terrorists in multiple IBOs in KP: ISPR\nIntelligence-based operations conducted in Kurram, Mohmand and Tank districts, says ISPR\nSecurity forces killed 30 Indian proxy Fitna al-Khawarij terrorists during multiple intelligence-based operations (IBOs) carried out by security forces in Khyber Pakhtunkhwa (KP), the military's media wing said on Thursday.\nThe Inter-Services Public Relations (ISPR), in a statement, said that an IBO, conducted in Mohmand district on November 18-19, resulted in the killing of four terrorists.\n\"Another intelligence-based operation was conducted in Lakki Marwat district. In ensuing fire exchange, two khawarij were effectively neutralised by the security forces,\" it added.\nSecurity forces killed another Fitna al-Khawarij terrorist during the third encounter that took place in the Tank district.\nIn the Kurram district, as many as 12 terrorists were neutralised after an intense exchange of fire during a targeted operation conducted on the reported presence of militants on November 19.\n\"Capitalising on intelligence with respect to presence of another group of khawarij, in same general area, in another intelligence-based operation, own troops successfully neutralised 11 more,\" the ISPR's statement added.\nSanitisation operations were underway to eliminate any other India-backed terrorists found in the areas.\nThe successful IBOs come as armed forces have intensified efforts to eradicate terrorism under the Azm-e-Istehkam operation.\nTerrorist attacks have seen a sharp increase in Pakistan, particularly in the bordering provinces of KP and Balochistan, since 2021, when the Afghan Taliban regime came into power.\nA police report noted that KP alone recorded over 600 terror incidents, in which at least 79 police personnel were martyred alongside 138 civilians, during the first eight months of 2025.\nThe violence spread to other regions of the country, including Islamabad, where a suicide bombing on November 11 resulted in the martyrdom of 12 and 36 others were injured, among them lawyers and petitioners.\nIslamabad has repeatedly urged Kabul and the international community to address the presence of terrorist safe havens in Afghanistan, including those of the outlawed Tehreek-e-Taliban Pakistan (TTP).\nDespite Pakistan’s efforts to engage the Taliban regime on the issue of cross-border terrorism, Kabul has remained largely unresponsive to its concerns.\nThe recent talks, mediated by Qatar and Turkiye, about regional peace ended without a result due to what Islamabad said were the Taliban's \"illogical arguments\" and their views far from reality.\nPakistan's position on terrorism emanating from Afghanistan also received support from the head of the UN Security Council's Daesh and Al-Qaeda Sanctions Committee.\nDenmark's Deputy Permanent Representative to the UN, Sandra Jensen Landi — who also serves as the committee's chair — presented a report to the UNSC, stating that the TTP carried out multiple high-profile attacks in Pakistan from Afghan soil.\nShe termed the TTP \"a serious threat\" emanating from the region, saying that the terrorist group was receiving constant logistical and substantial support from the \"de facto\" authorities in Afghanistan.\n-\nMQM-P calls for new province in Sindh\n-\nUS report validates Pakistan military edge over India: PM\n-\nBanned TTP poses serious threat to Pakistan security: UNSC panel\n-\nCM Afridi clarifies remarks on by-poll after ECP requests army deployment\n-\nDubai sees 3.2m Pakistani passengers in 2025 as airport sets new milestone\n-\nSecurity forces kill 23 Indian proxy terrorists in KP's Kurram\n-\nPakistan to construct island to boost oil exploration: report\n-\nRussia ready to mediate Pakistan's issues with India, Afghanistan: envoy",
    "content_length": 3761,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Sindh",
      "Khyber Pakhtunkhwa",
      "KP",
      "Balochistan",
      "ISPR",
      "ECP",
      "Police",
      "Armed Forces",
      "Military",
      "MQM",
      "armed",
      "militants",
      "terror",
      "terrorism",
      "terrorist",
      "terrorists",
      "bombing",
      "suicide",
      "suicide bombing",
      "killed",
      "killing",
      "injured",
      "operation",
      "intelligence-based operation",
      "IBO",
      "threat"
    ],
    "keywords_national_matched": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Sindh",
      "Khyber Pakhtunkhwa",
      "KP",
      "Balochistan",
      "ISPR",
      "ECP",
      "Police",
      "Armed Forces",
      "Military",
      "MQM"
    ],
    "keywords_threat_matched": [
      "armed",
      "militants",
      "terror",
      "terrorism",
      "terrorist",
      "terrorists",
      "bombing",
      "suicide",
      "suicide bombing",
      "killed",
      "killing",
      "injured",
      "operation",
      "intelligence-based operation",
      "IBO",
      "threat"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Pakistan",
      "Pakistani",
      "PK",
      "Islamabad",
      "Sindh",
      "Khyber Pakhtunkhwa",
      "KP",
      "Balochistan",
      "ISPR",
      "ECP",
      "Police",
      "Armed Forces",
      "Military",
      "MQM"
    ],
    "kw_threat_hits": [
      "armed",
      "militants",
      "terror",
      "terrorism",
      "terrorist",
      "terrorists",
      "bombing",
      "suicide",
      "suicide bombing",
      "killed",
      "killing",
      "injured",
      "operation",
      "intelligence-based operation",
      "IBO",
      "threat"
    ],
    "relevance_score": 100.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 10.0,
    "keyword_intensity": 100.0,
    "prepriority_score": 76.0,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.thenews.com.pk/rss/1/1",
      "fetched_at": "2026-02-18T18:40:26.577799+00:00",
      "rss": {
        "published_at": "2025-11-20T16:38:00+00:00"
      },
      "kw_national_hits": [
        "Pakistan",
        "Pakistani",
        "PK",
        "Islamabad",
        "Sindh",
        "Khyber Pakhtunkhwa",
        "KP",
        "Balochistan",
        "ISPR",
        "ECP",
        "Police",
        "Armed Forces",
        "Military",
        "MQM"
      ],
      "kw_threat_hits": [
        "armed",
        "militants",
        "terror",
        "terrorism",
        "terrorist",
        "terrorists",
        "bombing",
        "suicide",
        "suicide bombing",
        "killed",
        "killing",
        "injured",
        "operation",
        "intelligence-based operation",
        "IBO",
        "threat"
      ],
      "kw_shortlisted": true
    }
  }
]