[
  {
    "id": "3f0015029cfd46660b8eabf7",
    "country": "UNITED KINGDOM",
    "source_name": "Sky News",
    "source_slug": "sky_news",
    "url": "https://news.sky.com/story/children-can-claim-damages-for-lost-years-caused-by-medical-negligence-supreme-court-rules-paving-the-way-for-multi-million-pound-pay-outs-13509192",
    "title": "Children can claim 'lost years' damages caused by medical negligence, Supreme Court rules",
    "published_at": "2026-02-18T18:28:00+00:00",
    "author": null,
    "summary": "Children can receive damages for the years of their life that will be lost because of medical negligence, the Supreme&#160;Court&#160;has ruled.",
    "content_text": "Children can claim damages for 'lost years' caused by medical negligence, Supreme Court rules - paving the way for multi-million-pound pay outs\nThe decision comes more than four decades after a Court of Appeal judgment stating children cannot receive damages under the law.\nWednesday 18 February 2026 18:34, UK\nChildren can receive damages for the years of their life that will be lost because of medical negligence, the Supreme Court has ruled.\nThe decision by the UK's highest court overturns a legal ruling from 45 years ago and could lead to the NHS having to pay millions of pounds to patients harmed by botched procedures.\nA 1981 Court of Appeal judgment stated children cannot receive damages despite adults and teenagers being allowed to do so under the law.\nIt found that children could not receive damages on the basis they did not have any \"dependants\".\nBut the Supreme Court's ruling in London on Wednesday said this was \"incorrect\" and was \"inconsistent…with legal principle\".\nThe decision comes after a child, known only as CCC, sued Sheffield Teaching Hospitals NHS Foundation Trust in 2020.\nCCC was diagnosed with cerebral palsy following a severe brain injury, which was caused by clinical negligence by the trust and left the child requiring 24-hour care.\nIn the High Court ruling in 2023, Mr Justice Ritchie said that CCC suffered a severe shortage of oxygen to the brain before and during her birth, which caused cerebral palsy, with her life expectancy reduced to 29.\nMr Justice Ritchie awarded CCC a total of £6,866,615, which included the costs of care and equipment, but declined to order that the trust pay \"lost years\" damages, stating that he was \"bound\" by the 1981 Court of Appeal decision.\nRead more from Sky News:\nBig fall in household energy bills predicted from April\nWarmer weather is on its way to the UK, say forecasters\nCCC's mother then took the case to the Supreme Court on behalf of the child, with the challenge heard over two days in February last year.\nBy a four-to-one majority, the Supreme Court allowed the appeal and ordered that the case be sent back to the High Court so \"lost years\" damages could be assessed.\nIn his ruling, Lord Reed said \"whatever the age of the claimant\", the court has to \"assess just compensation as best it can on the material which is reasonably available\".\nFollowing the ruling, CCC's mother said: \"I feel elated that my little girl has changed the law and that this will help lots of other children who have been injured through no fault of their own.\"\nJane McNicholas, chief medical officer at the trust, said a review showed \"there were clearly aspects of the care which should have been done differently, and we are so very sorry that this happened\".",
    "content_length": 2729,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "High Court",
      "injured"
    ],
    "keywords_national_matched": [
      "High Court"
    ],
    "keywords_threat_matched": [
      "injured"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "High Court"
    ],
    "kw_threat_hits": [
      "injured"
    ],
    "relevance_score": 10.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 15.0,
    "prepriority_score": 45.0,
    "prepriority_bucket": "MEDIUM",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://feeds.skynews.com/feeds/rss/home.xml",
      "fetched_at": "2026-02-18T19:07:15.648477+00:00",
      "rss": {
        "published_at": "2026-02-18T18:28:00+00:00"
      },
      "kw_national_hits": [
        "High Court"
      ],
      "kw_threat_hits": [
        "injured"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "91c4d76467a1767a3adf64ef",
    "country": "UNITED KINGDOM",
    "source_name": "Sky News",
    "source_slug": "sky_news",
    "url": "https://news.sky.com/story/cctv-shows-the-moments-before-saudi-cambridge-student-mohammed-algasim-is-fatally-stabbed-13509182",
    "title": "CCTV shows the moments before Saudi student fatally stabbed",
    "published_at": "2026-02-18T17:20:00+00:00",
    "author": null,
    "summary": "CCTV shows the moments before a Saudi student was fatally stabbed in the neck by a stranger as he sat with friends outside his university accommodation.&#160;",
    "content_text": "CCTV shows the moments before Saudi Cambridge student Mohammed Algasim is fatally stabbed\nMohammed Algasim died of a single stab wound after an interaction with Chas Corrigan on 1 August last year.\nWednesday 18 February 2026 17:28, UK\nCCTV shows the moments before a Saudi student was fatally stabbed in the neck by a stranger as he sat with friends outside his university accommodation.\nMohammed Algasim, 20, died of a single stab wound across his jugular vein after an altercation on the evening of 1 August last year.\nChas Corrigan, 22, who denies murder and is on trial at Cambridge Crown Court, is seen in CCTV approaching the student and his friends as they sit on a low wall.\nAbdullah Bin Shuail, one of Mr Algasim's fellow students, said he heard the pair exchange words but could not make out what they were saying.\nNicholas Hearn, prosecuting, previously told the court the pair had never met before.\nCorrigan then walked towards the train station before Mr Algasim said something to him.\nMr Bin Shuail could only make out one word, \"centre\", Mr Hearn said.\n\"When Mr Algasim said this, the defendant turned and started to come back towards them,\" he continued.\nThe prosecutor said the defendant said \"what did you say, what did you say?\" in a \"very angry and aggressive way\".\nHe said Mr Bin Shuail \"saw the defendant punch Mr Algasim hard to the left side of his neck\" and \"then saw that the defendant was holding a large knife in his right hand\".\nThe stab wound, which also cut across his carotid artery, caused \"massive bleeding\", Mr Hearn said.\nBe the first to get Breaking News\nInstall the Sky News app for free\nJane Osborne KC, opening the defence case, said Corrigan \"had a kitchen knife - tucked into his waistband rather than in the pocket\".\n\"He will tell you he had no intention of using that knife,\" she said.\n\"He had it with him so if he was attacked, as he had been in the past, he could frighten off any attacker.\n\"He wanted to prevent himself being a victim of violence again.\"\nRead more from Sky News:\nBritish man killed in avalanche in French Alps\nMasseuse charged with multiple sex offences\nShe said Corrigan will say \"in the incident Mr Algasim was standing in front of him, he thought Mr Algasim was acting aggressively\".\n\"He thought he (Corrigan) was imminently going to be attacked so he produced the knife,\" she said.\n\"Having produced the knife Mr Corrigan had no intention of using it to cause Mr Algasim any harm.\n\"He intended to wave it between them.\n\"He will say he had no idea he had made contact with Mr Algasim with the knife.\"\nThe trial, estimated to last around two weeks, continues.",
    "content_length": 2624,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Defence",
      "attacked",
      "killed",
      "wanted"
    ],
    "keywords_national_matched": [
      "Defence"
    ],
    "keywords_threat_matched": [
      "attacked",
      "killed",
      "wanted"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Defence"
    ],
    "kw_threat_hits": [
      "attacked",
      "killed",
      "wanted"
    ],
    "relevance_score": 10.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 33.0,
    "prepriority_score": 46.8,
    "prepriority_bucket": "MEDIUM",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://feeds.skynews.com/feeds/rss/home.xml",
      "fetched_at": "2026-02-18T19:07:15.648415+00:00",
      "rss": {
        "published_at": "2026-02-18T17:20:00+00:00"
      },
      "kw_national_hits": [
        "Defence"
      ],
      "kw_threat_hits": [
        "attacked",
        "killed",
        "wanted"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "81603f11991fd1fb7c303610",
    "country": "UNITED KINGDOM",
    "source_name": "Sky News",
    "source_slug": "sky_news",
    "url": "https://news.sky.com/story/ex-council-worker-who-stole-163900k-from-vulnerable-claimants-to-fund-luxury-lifestyle-is-jailed-13509178",
    "title": "Ex-council worker who stole &#163;900k from vulnerable claimants to fund luxury lifestyle jailed",
    "published_at": "2026-02-18T15:56:00+00:00",
    "author": null,
    "summary": "A former council employee who stole nearly &#163;900,000 from the accounts of vulnerable benefit claimants to fund a luxury lifestyle has been jailed.",
    "content_text": "Ex-council worker who stole £900k from vulnerable claimants to fund luxury lifestyle is jailed\nRichard Shaw wired money to his own accounts to purchase two BMW cars and a holiday home in Lancashire.\nWednesday 18 February 2026 16:56, UK\nA former council employee who stole nearly £900,000 from the accounts of vulnerable benefit claimants to fund a luxury lifestyle has been jailed.\nRichard Shaw, 46, transferred the money to his own bank accounts while working for Bolton Council's financial protection team between 2015 and 2023.\nHe was jailed on Wednesday for four years and eight months.\nIn his role, he managed state benefits on behalf of service workers who were unable to manage their own finances and had no one else to assist them.\nBut investigations in 2023 revealed several bank transfers, totalling £893,296, to nine personal accounts held in his name.\nTwo BMW cars worth nearly £120,000 and other high-value items, including computers and bikes, were seized during a warrant at Shaw's home in Harrier Close, Bolton, when he was arrested on suspicion of fraud by abuse of position and money laundering.\nIt was established during the investigation that he spent £100,000 buying a holiday lodge in Ribble Valley, Lancashire, and almost £18,000 on garden improvements.\nRead more:\nMasseuse charged with multiple sexual offences\nVan driver guilty over fatal crash on smart motorway\nThere were also more than £53,000 in payments to different women with references including \"treat\", \"allowance\", \"nice\" and \"ass\" which totalled hundreds of pounds every week, the court heard.\nHe was sacked for gross misconduct in March 2023, when the council identified and reported the possible fraud to Greater Manchester Police.\nShaw pleaded guilty at an earlier hearing to one count of fraud by abuse of position.\nA Greater Manchester Police spokesperson said there would be a proceeds of crime hearing to reclaim the rest of the money to reimburse the council.\n'Cases like these are exceptionally rare'\nA spokesperson for Bolton Council said: \"Bolton Council has robust measures in place to detect, prevent and deter corruption and this crime was first uncovered via our own internal safeguards.\n\"We have worked closely with Greater Manchester Police to build the case that has resulted in this sentence which reflects the gravity and impact of the crime committed.\n\"Cases like this are exceptionally rare and the actions of one person do not reflect a wider workforce that is conscientious, diligent, and committed to public service.\n\"Any identified financial losses to individuals as a result of this fraud have been refunded by the council, and benefit losses rectified.\"",
    "content_length": 2668,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Police",
      "fatal",
      "arrested",
      "seized"
    ],
    "keywords_national_matched": [
      "Police"
    ],
    "keywords_threat_matched": [
      "fatal",
      "arrested",
      "seized"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Police"
    ],
    "kw_threat_hits": [
      "fatal",
      "arrested",
      "seized"
    ],
    "relevance_score": 35.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 33.0,
    "prepriority_score": 59.3,
    "prepriority_bucket": "MEDIUM",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://feeds.skynews.com/feeds/rss/home.xml",
      "fetched_at": "2026-02-18T19:07:15.648467+00:00",
      "rss": {
        "published_at": "2026-02-18T15:56:00+00:00"
      },
      "kw_national_hits": [
        "Police"
      ],
      "kw_threat_hits": [
        "fatal",
        "arrested",
        "seized"
      ],
      "kw_shortlisted": true
    }
  }
]