[
  {
    "id": "42864241e780a4e32eb7cafc",
    "country": "UNITED KINGDOM",
    "source_name": "The Guardian",
    "source_slug": "the_guardian",
    "url": "https://www.theguardian.com/world/live/2026/feb/18/ukraine-russia-peace-talks-zelenskyy-trump-putin-denmark-greenland-europe-live",
    "title": "Zelenskyy says no agreement on key issues in peace talks as he accuses Russia of ‘dragging out negotiations’ – as it happened",
    "published_at": "2026-02-18T16:07:54+00:00",
    "author": "Tom Ambrose (now) and Taz Ali (earlier)",
    "summary": "<p>Unresolved ‘sensitive’ issues in peace talks are fate of occupied territories in east Ukraine and Zaporizhzhia nuclear power plant</p><p>The peace talks ended abruptly today after about two hours, according to reports, in contrast with yesterday’s negotiations that apparently took place over six hours.</p><p>Neither side have offered any public sign of progress, but instead said the talks were <a href=\"https://www.theguardian.com/world/live/2026/feb/18/ukraine-russia-peace-talks-zelenskyy-trump-putin-denmark-greenland-europe-live?page=with%3Ablock-69958c638f08c412945d6f2d#block-69958c638f08c412945d6f2d\">“difficult” </a>with Russian news agencies quoting sources describing the negotiations as “very tense”.</p> <a href=\"https://www.theguardian.com/world/live/2026/feb/18/ukraine-russia-peace-talks-zelenskyy-trump-putin-denmark-greenland-europe-live\">Continue reading...</a>",
    "content_text": "Zelenskyy: No agreement on key issues in Geneva talks\nZelenskyy said there has been no agreement between Ukraine and Russia on the key issues at the US-mediated talks in Geneva.\n“We can see that some groundwork has been done, but for now the positions differ, because the negotiations were not easy,” the Ukrainian president told reporters after the talks had finished, according to the AFP news agency.\nHe listed the fate of occupied territories in Ukraine’s east and the future of the Zaporizhzhia nuclear power plant, which Russia has taken control of, as the unresolved “sensitive” issues in the peace talks.\nVolodymyrZelenskyy said there has been no agreement between Ukraine and Russia on the key issues at the US-mediated talks in Geneva. “We can see that some groundwork has been done, but for now the positions differ, because the negotiations were not easy,” the Ukrainian president told reporters after the talks had finished, according to the AFP news agency.\nThe latest round of US-mediated peace talks between Russia and Ukraine in Geneva on Wednesday ended without a major breakthrough, as fighting continues in a war that will enter its fifth year next week. Ukraine’s president, Volodymyr Zelenskyy, said no agreement had been reached on the thorniest questions at the negotiations in Switzerland, accusing Moscow of “trying to drag out” the process.\nUkraine has sanctioned the Belarusian president Alexander Lukashenko for providing military support to Russia and enabling “the killing of Ukrainians”, Zelenskyy has announced. Lukashenko, one of Russian president Vladimir Putin’s closest allies, has allowed Moscow to use Belarusian territory as a launchpad for its invasion of Ukraine.\nRussia has demanded for evidence after five European countries accused Moscow of poisoning the outspoken Russian opposition leader Alexei Navalny with a dart frog poison. The UK, France, Germany Sweden and the Netherlands said on Saturday that laboratory testing of samples from Navalny’s body had confirmed the presence of epibatidine, a toxin found in poison dart frogs in South America and not found naturally in Russia.\nSlovakia has threatened to cut emergency electricity supplies to Kyiv if it does not reopen a pipeline that brings Russian oil to Slovakia and Hungary. Slovakian prime minister Robert Fico, who is a close ally of Putin’s along with Hungary’s Viktor Orbán, declared a state of emergency over oil supplies.\nFour South African men who were lured into fighting alongside Russian forces in Ukraine landed at Johannesburg’s main airport on Wednesday, public broadcaster the South African Broadcasting Corporation reported. Police were waiting at OR Tambo International Airport, the SABC said. A police spokesperson declined comment, directing enquiries to the foreign affairs ministry.\nUkraine’s sports minister has condemned the decision to allow six Russians and four Belarusians to compete under their nation’s flags at next month’s Winter Paralympics as “disappointing and outrageous” and said Ukraine officials will not attend the opening ceremony or other official events as a result. “The flags of Russia and Belarus have no place at international sporting events that stand for fairness, integrity, and respect,” said Matvii Bidnyi in response to the International Paralympic Committee’s decision on Monday.\nRussia and Cuba on Wednesday criticised the US energy blockade of the Caribbean island in a show of solidarity in Moscow, where Havana’s foreign minister was due to meet with president Vladimir Putin. Cuba’s top diplomat Bruno Rodriguez travelled to traditional ally Russia seeking help as his country reels from a severe fuel crisis – intensified by Washington’s de-facto oil blockade.\nSlovakia has threatened to cut emergency electricity supplies to Kyiv if it does not reopen a pipeline that brings Russian oil to Slovakia and Hungary. Slovakian prime minister Robert Fico, who is a close ally of Putin’s along with Hungary’s Viktor Orbán, declared a state of emergency over oil supplies.\nChancellor Friedrich Merz said he was open to a social media ban for children. “If children today, at the age of 14, have up to five hours or more of screen time a day, if their entire socialisation takes place only through this medium, then we shouldn’t be surprised by personality deficits and problems in the social behaviour of young people,” he said in an interview with the podcast Machtwechsel.\nHeavy snow and rain across Romania left 200,000 homes without electricity on Wednesday, energy minister Bogdan Ivan said, with traffic blocked on motorways and national roads and dozens of trains delayed. Public transport in the capital, Bucharest, was struggling under 40 cm (16 inches) of snow, Reuters reported. Fallen trees halted road and rail traffic, schools closed in several towns and 10 ambulances in six counties were snowed in, the national emergency response agency said.\nFrance has launched wide-ranging investigations into human trafficking and financial fraud among contacts of the late convicted US sex offender Jeffrey Epstein following the release of a trove of files on his activities. Paris prosecutor Laure Beccuau told France Info radio on Wednesday that the investigations will rely on publicly available material alongside complaints filed by child protection groups.\n“The greatness of America,” wrote the 19th-century French diplomat, political philosopher and historian Alexis de Tocqueville, “lies not in her being more enlightened than any other nation, but rather in her ability to repair her faults.”\nFor a brief moment at the Munich Security Conference (MSC) last weekend, European leaders half-thought that their most heartfelt wish – the return of the old US, that believed in the EU ideal and backed a rules-based world order – had been granted.\nThe previous year on this same stage, US vice-president JD Vance had delivered a gut punch: a brutal ideological assault accusing Europe of abandoning “fundamental values”, and questioning whether the US and EU still had a common agenda.\nRubio played a soothing tune. The US and Europe “belong together”, he said: if Americans came across as direct and urgent, it was because they know European and US destinies were forever intertwined. The US would “always be a child of Europe”.\nFour South African men who were lured into fighting alongside Russian forces in Ukraine landed at Johannesburg’s main airport on Wednesday, public broadcaster the South African Broadcasting Corporation reported.\nPolice were waiting at OR Tambo International Airport, the SABC said. A police spokesperson declined comment, directing enquiries to the foreign affairs ministry.\nA foreign ministry spokesperson did not immediately respond to a message seeking comment, Reuters reported.\nSouth Africa’s government said in November that it would investigate how 17 of its citizens joined mercenary forces in the Russia-Ukraine conflict after the men sent distress calls for help to return home.\nPresident Cyril Ramaphosa spoke to Russian president Vladimir Putin by telephone earlier this month, and Ramaphosa’s office said after the call that the two leaders had “pledged their support to the process of returning South Africans fighting alongside Russian forces in Ukraine“.\nUnder South African law, it is illegal for citizens to provide military assistance to foreign governments or participate in foreign armies unless authorised by South Africa.\nHeavy snow and rain across Romania left 200,000 homes without electricity on Wednesday, energy minister Bogdan Ivan said, with traffic blocked on motorways and national roads and dozens of trains delayed.\nPublic transport in the capital, Bucharest, was struggling under 40 cm (16 inches) of snow, Reuters reported. Fallen trees halted road and rail traffic, schools closed in several towns and 10 ambulances in six counties were snowed in, the national emergency response agency said.\n“Of the 200,000 homes affected so far, roughly 86,000 were reconnected to power, there are ... 266 towns affected,” Ivan told reporters.\nHe added Romania’s power consumption was 7.4GW on average, with surplus wind and hydro production being exported. Production and consumption were up 11% and 6% on the year, respectively, he said.\nWe have some images from the newswires of Denmark’s King Frederik in Greenland. He is expected to attend a luncheon hosted by Greenland’s prime minister Jens-Frederik Nielsen and take a tour of a school in Nuuk and the headquarters of the Joint Arctic Command. He is also scheduled to visit a factory of Royal Greenland, the island’s largest company.\n‘Not easy’: Russia-Ukraine peace talks in Geneva end with no breakthrough\nThe latest round of US-mediated peace talks between Russia and Ukraine in Geneva on Wednesday ended without a major breakthrough, as fighting continues in a war that will enter its fifth year next week.\nUkraine’s president, Volodymyr Zelenskyy, said no agreement had been reached on the thorniest questions at the negotiations in Switzerland, accusing Moscow of “trying to drag out” the process.\n“We can see that some groundwork has been done, but for now the positions differ, because the negotiations were not easy,” he told reporters after the talks.\nZelenskyy said the status of Russian-occupied territories in eastern Ukraine and the future of the Zaporizhzhia nuclear power plant, which remains under Moscow’s control, were among the most contentious unresolved issues.\nThe second day of talks ended after just two hours, signalling scant progress and underscoring how distant a deal still appears, despite Donald Trump’s promises to end the war on the first day of his presidency.\nRead the full report by our Russian affairs reporter Pjotr Sauer here:\nSlovakia warns Ukraine of reprisals over blocked pipeline\nBack in Ukraine news, Slovakia has threatened to cut emergency electricity supplies to Kyiv if it does not reopen a pipeline that brings Russian oil to Slovakia and Hungary.\nSlovakian prime minister Robert Fico, who is a close ally of Putin’s along with Hungary’s Viktor Orbán, declared a state of emergency over oil supplies. He said he had ordered the release of 250,000 tonnes of oil from emergency reserves in response to the interruption of oil supplies via the Druzhba pipeline.\nFico claimed the repair work had finished and accused Ukraine of blocking oil supplies in order to “blackmail” Hungary, which opposes Kyiv from joining the EU. Orbán repeated this accusation, saying on social media that Ukraine was “trying to pressure us to support their EU membership”.\n“Thankfully, Hungary has a government that doesn’t bow to blackmail,” he said.\nFico threatened to end electricity supplies to Ukraine, saying: “If the president (Zelenskyy) believes these supplies are not important, we can decide to withdraw from the electricity supply accord.”\nFrance has launched wide-ranging investigations into human trafficking and financial fraud among contacts of the late convicted US sex offender Jeffrey Epstein following the release of a trove of files on his activities.\nParis prosecutor Laure Beccuau told France Info radio on Wednesday that the investigations will rely on publicly available material alongside complaints filed by child protection groups.\nOne will focus on human trafficking, the other on crimes including money laundering, corruption and tax fraud.\nRussia and Cuba on Wednesday criticised the US energy blockade of the Caribbean island in a show of solidarity in Moscow, where Havana’s foreign minister was due to meet with president Vladimir Putin.\nCuba’s top diplomat Bruno Rodriguez travelled to traditional ally Russia seeking help as his country reels from a severe fuel crisis – intensified by Washington’s de-facto oil blockade.\nUS president Donald Trump cut off key supplies of Venezuelan oil to Cuba after ousting Venezuela’s Nicolas Maduro and has threatened sanctions on states that sell oil to Havana.\nRodriguez met with his Russian counterpart Sergei Lavrov ahead of seeing Putin, with the long-serving Russian diplomat using Soviet-era language to criticise Washington.\n“We call on the US to show common sense and refrain from the military-maritime blockade of the island of freedom,” Lavrov said.\nUkraine officials to boycott Winter Paralympics opening ceremony over Russian athletes\nUkrainian officials will not attend the opening ceremony or other official events of the Winter Paralympics over the decision to allow six Russians and four Belarusians to compete under their nation’s flags, Ukraine’s sports minister said.\n“We thank every official from the free world who will do the same. We will keep fighting,” Matvii Bidnyi said.\nThe Guardian’s chief sports reporter, Sean Ingle, has more on this story here:\nRussia has demanded for evidence after five European countries accused Moscow of poisoning the outspoken Russian opposition leader Alexei Navalny with a dart frog poison.\nThe UK, France, Germany Sweden and the Netherlands said on Saturday that laboratory testing of samples from Navalny’s body had confirmed the presence of epibatidine, a toxin found in poison dart frogs in South America and not found naturally in Russia. In a joint statement, the five countries said Russia “had the means, motive and opportunity” to administer the poison to Navalny, who was in a remote Arctic penal colony serving a 19-year sentence. He died in February 2024 which the Kremlin said at the time was of natural causes.\nRussia’s foreign ministry spokesperson Maria Zakharova said: “All the accusations against Russia were of the ‘highly likely’ variety. There were no specific details. It was purely a proclamation to become the opening act of the Munich (security) conference and to overshadow the Epstein files.\n“We demand they hand over concrete data on this issue.”\nMerz open to social media ban for children in Germany\nIn Germany, chancellor Friedrich Merz said he was open to a social media ban for children.\n“If children today, at the age of 14, have up to five hours or more of screen time a day, if their entire socialisation takes place only through this medium, then we shouldn’t be surprised by personality deficits and problems in the social behaviour of young people,” he said in an interview with the podcast Machtwechsel.\nHe said he was generally sceptical of bans but saw the consequences of mobile phone use. “I think the priority must be how to protect children at an age when they also need time to play, learn, and concentrate at school,” he added.\nMerz said his government is considering “various ways of handling it in a more restrictive manner”, including an age limit and forcing platforms to verify users’ ages.\nIt follows moves made by several countries to ban social media to children under the age of 16. The first to introduce such a measure was Australia, where platforms such as TikTok, YouTube and Snapchat were required to remove accounts held by under-16s or face heavy fines since December.\nIndia said it was discussing age restrictions with social media firms, while France’s National Assembly backed a bill that would ban social media access for under-15s.\nParis prosecutors open two new probes on Epstein and call for victims to come forward\nOutside of Ukraine, prosecutors in France have opened two new investigations linked to Jeffrey Epstein as they urged potential victims to come forward.\nParis prosecutor Laure Beccuau said the probes were launched to examine the alleged sexual offences and possible financial crimes connected to the convicted sex offender. The investigations are seeking to use the millions of files released by the US government related to Epstein, Beccuau added.\n“All that data … some will shed light on others to be able to get a well-informed, very broad, panoramic view,” Beccuau told the French broadcaster France Info.\nBeccuau called on all potential French victims to come forward, saying: “We want to stand with these victims. We will receive all statements they wish to make.”\nBrunel was found dead in his cell in a Paris prison in 2022 after having been charged with raping minors. The case against him was dropped in 2023 in the wake of his death, with no other person charged.\nZelenskyy: No agreement on key issues in Geneva talks\nZelenskyy said there has been no agreement between Ukraine and Russia on the key issues at the US-mediated talks in Geneva.\n“We can see that some groundwork has been done, but for now the positions differ, because the negotiations were not easy,” the Ukrainian president told reporters after the talks had finished, according to the AFP news agency.\nHe listed the fate of occupied territories in Ukraine’s east and the future of the Zaporizhzhia nuclear power plant, which Russia has taken control of, as the unresolved “sensitive” issues in the peace talks.\nUkraine sports minister slams Russia’s Winter Paralympics entry as ‘deeply outrageous’\nUkraine’s sports minister has condemned the decision to allow six Russians and four Belarusians to compete under their nation’s flags at next month’s Winter Paralympics as “disappointing and outrageous”.\n“The flags of Russia and Belarus have no place at international sporting events that stand for fairness, integrity, and respect,” said Matvii Bidnyi in response to the International Paralympic Committee’s decision on Monday.\n“These are the flags of regimes that have turned sport into a tool of war, lies, and contempt. In Russia, Paralympic sport has been made a pillar for those whom Putin sent to Ukraine to kill – and who returned from Ukraine with injuries and disabilities,” he added.",
    "content_length": 17586,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "National Assembly",
      "Police",
      "Military",
      "assault",
      "killing",
      "dead",
      "death",
      "emergency",
      "trafficking"
    ],
    "keywords_national_matched": [
      "National Assembly",
      "Police",
      "Military"
    ],
    "keywords_threat_matched": [
      "assault",
      "killing",
      "dead",
      "death",
      "emergency",
      "trafficking"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "National Assembly",
      "Police",
      "Military"
    ],
    "kw_threat_hits": [
      "assault",
      "killing",
      "dead",
      "death",
      "emergency",
      "trafficking"
    ],
    "relevance_score": 55.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 72.0,
    "prepriority_score": 73.2,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.theguardian.com/world/rss",
      "fetched_at": "2026-02-18T19:07:30.196021+00:00",
      "rss": {
        "published_at": "2026-02-18T16:07:54+00:00"
      },
      "kw_national_hits": [
        "National Assembly",
        "Police",
        "Military"
      ],
      "kw_threat_hits": [
        "assault",
        "killing",
        "dead",
        "death",
        "emergency",
        "trafficking"
      ],
      "kw_shortlisted": true
    }
  }
]