[
  {
    "id": "00ae0202d4950e64430e600e",
    "country": "MIDDLE EAST (REGIONAL)",
    "source_name": "Al Jazeera",
    "source_slug": "al_jazeera",
    "url": "https://www.aljazeera.com/news/2026/2/18/russia-ukraine-war-list-of-key-events-day-1455",
    "title": "Russia",
    "published_at": "2026-02-18T00:00:00+00:00",
    "author": "Lyndal Rowlands",
    "summary": null,
    "content_text": "Russia-Ukraine war: List of key events, day 1,455\nThese are the key developments from day 1,455 of Russia’s war on Ukraine.\nPublished On 18 Feb 2026\nHere is where things stand on Wednesday, February 18:\nFighting\n- Three people were killed in a Russian drone attack on a civilian car in the city of Mykolaivka in the Kramatorsk district of Ukraine’s Donetsk region, the state’s emergency service said in a statement.\n- The three people, as well as another person injured in the attack, were workers at the Sloviansk Thermal Power Station, the Kyiv Independent news outlet reported.\n- A woman died after being injured in a Russian drone attack in Ukraine’s Zaporizhia region, Governor Ivan Fedorov wrote on the Telegram messaging app. Six people, including two children, were also injured in the attack, Fedorov said.\n- Russian-appointed official Yevhen Balitsky, in a Russian-occupied area of Ukraine’s Zaporizhia region, said that a woman was killed by Ukrainian shelling in the village of Vodyane, Russia’s TASS state news agency reported.\n- A Ukrainian drone attack killed one person in the village of Kalinovka, in Russia’s Kursk region, Governor Alexander Khinshtein said, according to TASS.\n- Three people were killed when part of a building collapsed following reports of an explosion at a military police facility in the town of Sertolovo in Russia’s Leningrad region, Governor Alexander Drozdenko said. The cause of the blast remained unclear.\n-\nUkraine’s General Staff said that the army’s forces struck the Ilsky oil refinery in Russia’s Krasnodar region, causing a fire.\n- Russian authorities in Krasnodar later said that a fire at an oil reservoir in the Black Sea port of Taman had been extinguished after it was damaged in a drone attack.\n- Russian forces shot down 151 Ukrainian drones overnight Monday and into Tuesday morning across several Russian regions, as well as over the Black and Azov Seas, Russia’s Ministry of Defence said, according to TASS.\n- Russian Deputy Defence Minister Aleksei Krivoruchko has acknowledged that Starlink satellite internet terminals used by the Russian military to communicate “have been down for two weeks”, nearly two weeks after Ukrainian officials said the terminals used by Russian forces had been disconnected on the instructions of Starlink’s owner, Elon Musk.\n- Krivoruchko said the loss of Starlink had “not affected the intensity or effectiveness” of Russia’s drone operations.\nAdvertisement\nPeace talks\n- Russian and Ukrainian negotiators concluded the first of two days of US-mediated peace talks in Geneva, Switzerland, on Tuesday, with negotiations set to continue on Wednesday. The talks in Geneva follow two previous rounds of negotiations in Abu Dhabi.\n- Ukrainian President Volodymyr Zelenskyy said in his daily evening address that he was ready “to move quickly towards a worthy agreement to end the war”, but he also questioned whether Russia was serious about peace. “What do they want?” he added, accusing them of prioritising missile strikes over “real diplomacy”.\n- Kremlin spokesman Dmitry Peskov had earlier told journalists he did not think there would be any updates to share after day one of the talks in Geneva. “I don’t think we should expect any news today,” he said.\nPolitics and diplomacy\n- The Vatican will not participate in US President Donald Trump’s Board of Peace, Cardinal Pietro Parolin said on Tuesday.\n- “For us, there are… some critical issues that should be resolved, let’s say,” Parolin said, noting the Vatican has “insisted” that “it is above all the UN that manages these crisis situations”.\n- Trump’s peace board has drawn criticism, including for inviting Russian President Vladimir Putin to join, despite Moscow’s full-scale invasion of Ukraine in 2022 and Russia’s leader being wanted by the International Criminal Court for alleged war crimes.\n- French authorities have let the suspected Russian shadow fleet oil tanker Grinch leave French territorial waters after the company owning the vessel paid a penalty of “several million euros”, French Minister of Foreign Affairs Jean-Noel Barrot said on Tuesday.",
    "content_length": 4112,
    "extraction_method": "sitemap",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Ministry of Defence",
      "Police",
      "Defence",
      "Military",
      "attack",
      "blast",
      "explosion",
      "missile",
      "shelling",
      "killed",
      "injured",
      "emergency",
      "wanted"
    ],
    "keywords_national_matched": [
      "Ministry of Defence",
      "Police",
      "Defence",
      "Military"
    ],
    "keywords_threat_matched": [
      "attack",
      "blast",
      "explosion",
      "missile",
      "shelling",
      "killed",
      "injured",
      "emergency",
      "wanted"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Ministry of Defence",
      "Police",
      "Defence",
      "Military"
    ],
    "kw_threat_hits": [
      "attack",
      "blast",
      "explosion",
      "missile",
      "shelling",
      "killed",
      "injured",
      "emergency",
      "wanted"
    ],
    "relevance_score": 65.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 100.0,
    "prepriority_score": 81.0,
    "prepriority_bucket": "CRITICAL",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "sitemap",
      "endpoint_used": "https://www.aljazeera.com/sitemap.xml",
      "fetched_at": "2026-02-18T19:11:50.209434+00:00",
      "kw_national_hits": [
        "Ministry of Defence",
        "Police",
        "Defence",
        "Military"
      ],
      "kw_threat_hits": [
        "attack",
        "blast",
        "explosion",
        "missile",
        "shelling",
        "killed",
        "injured",
        "emergency",
        "wanted"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "3ab9435415536df81bbc531b",
    "country": "MIDDLE EAST (REGIONAL)",
    "source_name": "Al Jazeera",
    "source_slug": "al_jazeera",
    "url": "https://www.aljazeera.com/news/2026/2/18/jesse-jackson-helped-empower-us-arabs-and-raise-palestinian-cause",
    "title": "How Jesse Jackson helped empower US Arabs and lift up the Palestinian cause",
    "published_at": "2026-02-18T00:00:00+00:00",
    "author": "Ali Harb",
    "summary": null,
    "content_text": "How Jesse Jackson helped empower US Arabs and lift up the Palestinian cause\nArab American advocates eulogise Jackson as a civil rights giant who embraced their communities and defended Palestine.\nWashington, DC – More than 40 years ago, United States civil rights leader Jesse Jackson called on the Democratic Party to open its doors and welcome “the desperate, the damned, the disinherited, the disrespected and the despised”.\nThis included Arab Americans and Palestinian rights supporters, who have suffered from decades of racism, demonisation and marginalisation.\nRecommended Stories\nlist of 3 items- list 1 of 3US civil rights leader Jesse Jackson dies aged 84\n- list 2 of 3Jesse Jackson, civil rights icon, dies at age 84\n- list 3 of 3Tributes pour in after US civil rights icon Jesse Jackson dies at 84\nAdvocates in those communities say that Jackson, who died on Tuesday at the age of 84, helped elevate their voices over his decades-long career.\n“I don’t think there’s a way to tell the Arab Americans’ political empowerment story without understanding the path that Reverend Jackson created for us,” said Maya Berry, executive director of the Arab American Institute (AAI).\nIn 1984, Jackson appointed Arab American activist James Zogby as one of his deputy campaign managers as he mounted a bid for the presidency. Zogby would later found the AAI.\nJackson’s campaign also actively courted Arab Americans and amplified calls for Palestinian self-determination in an era when unquestioning support for Israel was the default position in US politics.\nBerry said Jackson always rejected pressure to disassociate from Arab Americans who view Palestine as a focal issue.\n“He understood that the fight for justice was one that had to be done when it was both hard and easy. Our country has lost a giant,” she told Al Jazeera.\nThe party platform\nJackson launched a second campaign for president in 1988, winning 13 states, including Michigan and much of the South, in the Democratic primary.\nHe ultimately lost the nomination to then-Massachusetts Governor Michael Dukakis. Still, Jackson’s campaign catapulted Palestinian rights into the national discourse.\nZogby and other Jackson delegates at the Democratic National Convention rallied to include support for Palestinian statehood in the party’s platform that year.\nWhile the push eventually fell short at the national level, 11 state parties adopted platforms expressing support for “the rights of the Palestinian people to safety, self-determination and an independent state”.\nJackson’s relative success in the primary also led to the appointment of an Arab-American activist, Texan Ruth Ann Skaff, to the Democratic National Committee (DNC), the party’s executive board.\nAt the time, Skaff faced unfounded accusations of anti-Semitism for her pro-Palestinian stance, not to mention calls to be removed from the committee.\nBut in an interview with Al Jazeera, she said she was just a local organiser from Houston, Texas, not a high-level political operative.\nShe explained that Jackson’s embrace of the Arab-American community rang “true to his message of wanting to empower those who do not have power or who are excluded”.\nShe also recalled him being humorous and approachable.\n“We were learning how to organise, how to spread the message and then take it to the next step of being active politically at the very local level. And he guided us and inspired us the entire way,” Skaff said.\nBorn in South Carolina in 1941, under the racial segregation of the Jim Crow laws, Jackson was dedicated to civil rights from a young age.\nHe was considered a talented public speaker, and as a pre-teen, he became a protege of the civil rights icon Martin Luther King Jr.\nA central part of his national platform was to stress the need for a broad coalition of communities to come together and demand equal rights.\nJackson moved to Chicago in 1965, where he founded the civil rights and community empowerment movement that became known as the Rainbow/PUSH Coalition.\nEven after his presidential run, Jackson remained close with the Arab community.\nHatem Abudayyeh, the executive director of the Arab American Action Network (AAAN) in Illinois, praised Jackson as “a tried-and-true Chicagoan, one of us, who opened the doors to Rainbow/PUSH for Palestinians and Arabs in Chicagoland”.\n“Under his leadership, Black, Latino, Asian, Arab and so many other communities worked together for racial, economic, and social justice,” Abudayyeh told Al Jazeera in a statement.\n“He never shied away from solid and principled solidarity with our Palestinian and Arab communities,” he added. “We mourn today with our friends in the Black community, and with all those who will carry on his fight.”\nSupport for Gaza protesters\nNabih Ayad, the founder of the Arab American Civil Rights League (ACRL), said Jackson was one of the first leaders to shine light on the plight of Palestinians at the national stage.\nHe also worked on other issues related to the Arab community. In 2015, for instance, Jackson lobbied for the admission and resettlement of Syrian refugees, despite opposition from Republican governors.\nThe ACRL, based in the Michigan suburb of Dearborn, hosted Jackson on a panel to highlight the refugees’ plight. Ayad said Jackson’s message was that “justice is universal”.\n“It was an honour to cross his path and be able to see a giant like Jesse Jackson really caring about the little people, the small guys, about injustice wherever it happens, no matter where it is around the world,” Ayad told Al Jazeera.\nThis drive to address injustice drove Jackson to speak up for Palestinians even when it may have cost him politically, according to Ayad.\nJackson’s Rainbow/PUSH Coalition organised an emergency summit in 2024 to call for a ceasefire during Israel’s genocidal war on Gaza.\nLater that year, he voiced support for pro-Palestine protests on college campuses, writing in the University of Chicago’s newspaper, The Chicago Maroon, that the student leaders “represent the best of our nation”.\nMatthew Jaber Stiffler, the director of the Center for Arab Narratives, a research institution, said Jackson helped the Arab community feel “seen”. He, too, highlighted the political costs of championing Palestinian rights.\n“Even just saying, ‘I support the rights for Palestinians to exist in the national political sphere,’ could get you branded as a radical, could get you pushed to the margins,” Stiffler told Al Jazeera.\n“Mainstream candidates didn’t – and still don’t – really want that plank in their platform. And I think that’s why there was such love for Jesse Jackson and what he stood for, because he was not afraid.”\n‘Work that has to be done’\nIn the decades since Jackson’s presidential campaigns, Palestine has become less of a taboo subject in US politics. Congress members, mayors and celebrities have become vocal in criticising Israeli abuses.\nStill, the leadership of the Democratic and Republican parties have avoided publicly supporting Palestinian rights. During the 2024 presidential race, for instance, both major parties adopted staunchly pro-Israel platforms.\nThe campaign of Democratic presidential nominee Kamala Harris even refused to allow a Palestinian speaker at the party’s convention that year.\nThe flow of US money and weapons to Israel has also continued uninterrupted, despite the horrific atrocities in Gaza.\nFurthermore, since taking office in January 2025, the administration of President Donald Trump has led a crackdown on Palestinian rights advocates, threatening foreign-born activists with deportation and other penalties.\nBerry said that while the current conditions are challenging, Jackson taught the community to overcome barriers and build its power.\n“I think that the lessons and the legacy of someone like Reverend Jackson teaches us that this is work that has to be done,” she told Al Jazeera.\nFor her part, Skaff said Jackson wanted Arab Americans to stand up and let their message be known.\n“We’re stronger when we’re united and when we exercise our rights and responsibilities as American citizens: to stand up, to speak out, to run for office, to vote, vote, vote, vote,” she told Al Jazeera.",
    "content_length": 8188,
    "extraction_method": "sitemap",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 38.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "sitemap",
      "endpoint_used": "https://www.aljazeera.com/sitemap.xml",
      "fetched_at": "2026-02-18T19:11:50.209459+00:00",
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "f07fe23331faa933aea6063e",
    "country": "MIDDLE EAST (REGIONAL)",
    "source_name": "Al Jazeera",
    "source_slug": "al_jazeera",
    "url": "https://www.aljazeera.com/news/2026/2/18/france-arrests-nine-over-killing-of-far-right-activist-quentin-deranque",
    "title": "France arrests nine over far",
    "published_at": "2026-02-18T00:00:00+00:00",
    "author": "AFP; Reuters",
    "summary": null,
    "content_text": "France arrests nine over killing of far-right activist Quentin Deranque\nThe 23-year-old was beaten to death by far-left activists in France’s Lyon last week.\nHundreds rally in Paris after far-right activist dies following assault in Lyon\nPolice in France have arrested nine suspects, including an aide to a far-left lawmaker, over the killing of a far-right activist in the southeastern city of Lyon, according to a prosecutor.\nThe arrests come as France mourns Quentin Deranque, 23, who was beaten to death last week by far-left activists outside a Lyon venue where Member of the European Parliament Rima Hassan was speaking.\nRecommended Stories\nlist of 4 items- list 1 of 4EU opens probe into online global retailer Shein after sex-doll scandal\n- list 2 of 4Train derails in Switzerland, injuring five amid avalanches in the Alps\n- list 3 of 4Russia-Ukraine war: List of key events, day 1,454\n- list 4 of 4Robert Duvall, Oscar-winning actor and star of The Godfather, dies aged 95\nThe incident has jolted France’s political class and fuelled tensions between the far-right and far-left ahead of municipal elections in March and the presidential race in 2027.\nLyon prosecutor Thierry Dran announced the arrests of four suspects, followed shortly after by five more, bringing the total to nine.\nThe AFP news agency, citing a source following the case, said six of the detainees are suspected of participating in the beating, while three are suspected of aiding them. Seven were men, and two were women, the source told the agency.\nAn assistant to Raphael Arnault, a lawmaker of the far-left France Unbowed (LFI) party, was among the first four detained. Arnault said the aide had “stopped all parliamentary work”.\n“It is now up to the investigation to determine responsibility”, he added on X.\nThe head of the LFI, Jean-Luc Melenchon, said those who had attacked Deranque had “dishonoured” themselves by acting with apparent lethal intent.\n“When it comes to violence, whether it be defensive or offensive… not all blows are allowed,” he said.\nThe beating of Deranque took place on Thursday, on the sidelines of a far-right protest against Hassan’s appearance in Lyon. An anti-immigration collective called Nemesis said Deranque had been at the protest in Lyon to protect its members.\nNemesis has blamed the killing on La Jeune Garde (The Young Guard), an anti-fascist youth group co-founded by Arnault before he was elected to parliament.\nLa Jeune Garde, which was dissolved in June, has denied any links to the “tragic events”, while Arnault has called the killing horrific.\nAccording to the AFP, another source close to the probe described Thursday’s attack as “a pitched battle between members of the far left and the far right”.\nA video of the alleged attack broadcast by TF1 television shows a dozen people hitting three others lying on the ground, two of whom manage to escape.\nA witness told AFP that “people were hitting each other with iron bars”.\nLawmakers held a minute of silence on Tuesday afternoon at France’s National Assembly in memory of Deranque, while a march is expected to be held in Lyon next Saturday in his honour.\nWhile the government has singled out the LFI and La Jeune Garde, the Lyon prosecutor on Monday declined to comment on those claims, only specifying that the incident was being investigated as a voluntary homicide and aggravated assault.\nOn the far right, the presidential hopeful from the National Rally, three-time contender Marine Le Pen, has condemned the “barbarians responsible for this lynching”.\nHer lieutenant, Jordan Bardella, who heads her party, said after the arrests that the LFI’s Melenchon had “moral and political responsibility” for what happened, claiming he had “opened the doors of the National Assembly to suspected murderers”.\nOpinion polls put the far right in the lead for the presidency in 2027, when centrist President Emmanuel Macron will have to step down after the maximum two consecutive terms in office.",
    "content_length": 3974,
    "extraction_method": "sitemap",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "National Assembly",
      "Police",
      "attack",
      "attacked",
      "assault",
      "killing",
      "death",
      "arrested",
      "detained",
      "suspects"
    ],
    "keywords_national_matched": [
      "National Assembly",
      "Police"
    ],
    "keywords_threat_matched": [
      "attack",
      "attacked",
      "assault",
      "killing",
      "death",
      "arrested",
      "detained",
      "suspects"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "National Assembly",
      "Police"
    ],
    "kw_threat_hits": [
      "attack",
      "attacked",
      "assault",
      "killing",
      "death",
      "arrested",
      "detained",
      "suspects"
    ],
    "relevance_score": 45.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 84.0,
    "prepriority_score": 69.4,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "sitemap",
      "endpoint_used": "https://www.aljazeera.com/sitemap.xml",
      "fetched_at": "2026-02-18T19:11:50.209472+00:00",
      "kw_national_hits": [
        "National Assembly",
        "Police"
      ],
      "kw_threat_hits": [
        "attack",
        "attacked",
        "assault",
        "killing",
        "death",
        "arrested",
        "detained",
        "suspects"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "3abedf180bb1b7d2af706fcc",
    "country": "MIDDLE EAST (REGIONAL)",
    "source_name": "Al Jazeera",
    "source_slug": "al_jazeera",
    "url": "https://www.aljazeera.com/news/2026/2/18/stephen-colbert-says-cbs-barred-his-interview-with-texas-senate-candidate",
    "title": "Stephen Colbert says CBS pulled interview with Texas Democratic candidate",
    "published_at": "2026-02-18T00:00:00+00:00",
    "author": "Al Jazeera Staff",
    "summary": null,
    "content_text": "Stephen Colbert says CBS pulled interview with Texas Democratic candidate\nUS late-night show host says CBS pulled interview from Monday’s broadcast over fears it could violate new regulatory guidance.\nLate-night show host Stephen Colbert has alleged that the CBS broadcaster blocked him from airing an interview with Democratic Texas Senate candidate James Talarico, citing fears it would violate new regulatory guidance from the United States government.\nColbert’s comment on Monday overshadowed the start of early voting for Texas primaries, which feature a heated Democratic race between Talarico and US Representative Jasmine Crockett.\nRecommended Stories\nlist of 4 items- list 1 of 4How Jesse Jackson helped empower US Arabs and lift up the Palestinian cause\n- list 2 of 4US immigration judge rejects Trump bid to deport Columbia student Mahdawi\n- list 3 of 4Warner Bros rejects latest Paramount bid but open to ‘best and final’ offer\n- list 4 of 4US president’s son Eric Trump invests in drone maker with gov’t contracts\nColbert said that CBS lawyers told him in “no uncertain terms” that Talarico could not appear on The Late Show on Monday.\n“Donald Trump’s administration wants to silence anyone who says anything bad about Trump on TV, because all Trump does is watch TV,” Colbert said.\n“I was told, in some uncertain terms, that not only could I not have him [Talarico] on, I could not mention me not having him on,” Colbert said.\n“And because my network clearly doesn’t want us to talk about this, let’s talk about this,” he said.\nCBS disputed Colbert’s account, saying its lawyers only “provided legal guidance” that broadcasting an interview with Talarico could trigger the Federal Communications Commission’s (FCC) equal-time rule.\nEqual time rule\nThe rule requires broadcast networks to give equal time to political candidates, but it has not traditionally been applied to talk shows.\nHowever, the Republican-led FCC said in January that daytime and late-night television talk shows are no longer considered “bona fide” news programmes that are exempt from equal time rules.\nUS media reported earlier this month that the FCC has opened an investigation into whether ABC’s The View daytime talk show violated equal time rules for interviews with political candidates after an appearance by Talarico.\nTrump has repeatedly pushed FCC Chair Brendan Carr to take action against US broadcasters and criticised networks for what he views as one-sided coverage.\nColbert criticised Carr and CBS’s lawyers, saying they were unilaterally enforcing Carr’s directive for “purely financial reasons”.\nHis words echoed the explanation that CBS’s parent company, Paramount, provided when it announced in July that Colbert’s programme would go off the air in May, as it was seeking approval from the FCC for its $8.4bn merger with Skydance Media.\nColbert posted the interview with Talarico on the programme’s YouTube page, because online material does not fall under the equal-time rule.\nThe clip had about 2 million views as of 3pm local time, and millions more views on other platforms.\nCBS said in a statement that its lawyers had presented options for how the equal time for other candidates, including Crockett, could be fulfilled. It added that the show “decided to present the interview through its YouTube channel with on-air promotion on the broadcast rather than potentially providing the equal-time options”.\nTalarico posted a nearly minute-long clip of his interview with Colbert on X, calling it “the interview Donald Trump didn’t want you to see”.\n“I think Donald Trump is worried we’re about to flip Texas,” Talarico told Colbert during their interview. “This is the most dangerous kind of cancel culture, the kind that comes from the top.”\nCrockett, meanwhile, suggested that Colbert could have avoided an issue with the FCC by having her on the show, as he has in the past. Both she and Talarico have also appeared on The View.\nThere was no immediate comment from Paramount Skydance, Carr or the White House.\n‘Another troubling example’\nUntil January, talk shows were deemed to have qualified for the equal opportunities exemption as genuine news interviews, ever since the FCC Media Bureau granted an exemption to the interview portion of Jay Leno’s The Tonight Show in 2006.\nNetworks have relied on the ruling as a precedent for recent interviews with political candidates.\nFCC Commissioner Anna Gomez, a Democrat, criticised CBS’s decision not to air the interview, calling it censorship.\nShe said the FCC has no lawful authority to pressure broadcasters for political purposes, and that CBS has free speech rights to air the interview.\n“This is yet another troubling example of corporate capitulation in the face of this administration’s broader campaign to censor and control speech,” Gomez said. “It is no secret that Paramount, CBS’s parent company, has regulatory matters before the government, but corporate interests cannot justify retreating from airing newsworthy content.”\nParamount Skydance is seeking to buy Warner Bros Discovery.\nSince Trump’s return to the White House last year, CBS has been accused of seeking to appease the president by appointing Bari Weiss, a conservative opinion writer with no television experience, to lead the storied broadcast network, as well as naming a former Trump appointee to oversee and address allegations of bias.\nIt also settled a lawsuit filed by Trump over an interview with his rival in the 2024 presidential race, Kamala Harris, which he alleged had been deceptively edited to benefit the Democratic Party before the election.\nThe FCC’s Carr, meanwhile, has faced bipartisan criticism after he pressured broadcasters to take ABC late-night talk show host Jimmy Kimmel off the air in September, warning they could face fines or loss of licences.\nTwo major broadcasters said they would pull Kimmel off the air, and Disney briefly suspended Kimmel before restoring the show.\nIn December, Democratic US Senator Tammy Baldwin of Wisconsin told Carr, “You used your position within the federal government to take Jimmy Kimmel off the air in a clear attempt to chill free speech.”",
    "content_length": 6145,
    "extraction_method": "sitemap",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Federal Government",
      "warning"
    ],
    "keywords_national_matched": [
      "Federal Government"
    ],
    "keywords_threat_matched": [
      "warning"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Federal Government"
    ],
    "kw_threat_hits": [
      "warning"
    ],
    "relevance_score": 10.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 15.0,
    "prepriority_score": 45.0,
    "prepriority_bucket": "MEDIUM",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "sitemap",
      "endpoint_used": "https://www.aljazeera.com/sitemap.xml",
      "fetched_at": "2026-02-18T19:11:50.209482+00:00",
      "kw_national_hits": [
        "Federal Government"
      ],
      "kw_threat_hits": [
        "warning"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "b5d1e8b3a56ca1fafc72e816",
    "country": "MIDDLE EAST (REGIONAL)",
    "source_name": "Al Jazeera",
    "source_slug": "al_jazeera",
    "url": "https://www.aljazeera.com/news/2026/2/18/un-panel-says-epstein-abuses-may-constitute-crimes-against",
    "title": "UN panel says Epstein abuses may constitute ‘crimes against humanity’",
    "published_at": "2026-02-18T00:00:00+00:00",
    "author": "Al Jazeera Staff",
    "summary": null,
    "content_text": "UN panel says Epstein abuses may constitute ‘crimes against humanity’\nExperts say newly recently released documents show the need for an independent investigation into Epstein’s sex-trafficking ring.\nA group of United Nations experts have suggested that abuses carried out by convicted sex offender Jeffrey Epstein could meet the definition of crimes against humanity.\nOn Tuesday, the independent experts appointed by the UN Human Rights Council (UNHRC) released a statement in response to the millions of files released by the United States government related to criminal investigations into Epstein.\nRecommended Stories\nlist of 3 items- list 1 of 3New Mexico lawmakers launch probe into Epstein’s Zorro Ranch\n- list 2 of 3Former Israeli PM Barak responds to criticism over close Epstein links\n- list 3 of 3Logistics giant DP World replaces chief named in Epstein files\nThey explained that the records tell a story of dehumanisation, racism and corruption.\n“So grave is the scale, nature, systematic character, and transnational reach of these atrocities against women and girls, that a number of them may reasonably meet the legal threshold of crimes against humanity,” the experts wrote.\nThe UNHRC panel called for an investigation into allegations around Epstein and his associates, who include prominent figures in global politics, business, science and culture.\nThey added that the revelations from the files suggest a “global criminal enterprise”.\n“All the allegations contained in the ‘Epstein Files’ are egregious in nature and require independent, thorough, and impartial investigation, as well as inquiries to determine how such crimes could have taken place for so long,” the experts said.\nThe latest condemnation follows the January 30 release of 3.5 million pages of files from the US government’s records on Epstein.\nThe files were required to be released as part of the Epstein Files Transparency Act, a bipartisan piece of legislation signed into law in November.\nThe act gave the US government 30 days to publish all of its Epstein-related documents in a searchable format, obscuring information only to protect victims’ privacy.\nBut the 30-day deadline came and went, with only a partial release of the files. Even the January 30 publication has been criticised as incomplete, with reports indicating that there could be more than 6 million files in the government’s possession.\nThe newly released documents have revealed new details about Epstein’s relationships with influential figures, but few have faced accountability.\nCritics have argued that Epstein himself faced scant legal consequences for the sex crimes he perpetuated. He reached a plea deal in Florida in 2008, wherein he pleaded guilty to soliciting a child for prostitution and sex trafficking, but he only served 13 months in custody.\nHe was in jail in 2019, facing federal charges, when he died by suicide in his cell.\nEpstein’s ex-girlfriend, Ghislaine Maxwell, has been sentenced to more than 20 years for her role in the sex trafficking scheme.\nIn Tuesday’s statement, the experts on the UN panel slammed the heavy redactions in the Epstein files that appear to shield the identities of powerful figures.\n“The reluctance to fully disclose information or broaden investigations, has left many survivors feeling retraumatized and subjected to what they describe as ‘institutional gaslighting’,” the UN experts said.\nTheir criticism echoes similar accusations in the US. Lawmakers there have argued that the administration of President Donald Trump, a former friend of Epstein, has defied the November law by redacting documents beyond the guidelines set out by Congress.\nThe experts also noted that there appeared to be “botched redactions that exposed sensitive victim information”. They added that more must be done to ensure justice for the survivors.\n“Any suggestion that it is time to move on from the ‘Epstein files’ is unacceptable. It represents a failure of responsibility towards victims,” they said.",
    "content_length": 3998,
    "extraction_method": "sitemap",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 38.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "sitemap",
      "endpoint_used": "https://www.aljazeera.com/sitemap.xml",
      "fetched_at": "2026-02-18T19:11:50.209491+00:00",
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  }
]