[
  {
    "id": "8e787cc30b7d917501ca4fc8",
    "country": "AFGHANISTAN",
    "source_name": "Pajhwok Afghan News",
    "source_slug": "pajhwok_afghan_news",
    "url": "https://pajhwok.com/2026/02/18/astana-meeting-afghanistan-shifts-to-economic-transit-opportunity/",
    "title": "Astana meeting: Afghanistan shifts from threat to economic, transit opportunity",
    "published_at": "2026-02-18T15:47:51+00:00",
    "author": "Sher Ahmad Usmani",
    "summary": "KABUL(Pajhwok): At a meeting of the Central Asian Contact Group in Astana, participants emphasized that the regional perception of Afghanistan has shifted from viewing it",
    "content_text": "KABUL(Pajhwok): At a meeting of the Central Asian Contact Group in Astana, participants emphasized that the regional perception of Afghanistan has shifted from viewing it as a security threat to recognizing it as an economic and transit opportunity, with the potential to serve as a bridge between Central and South Asia.\nKazakhstan’s capital hosted an extraordinary session of the Regional Contact Group of Special Representatives of Central Asian Countries on Afghanistan, where trade, economic cooperation, and transit connectivity topped the agenda.\nAccording to The Astana Times, representatives from Kazakhstan, Kyrgyzstan, Tajikistan, and Uzbekistan attended the meeting.\nYerkin Tokumov, Special Representative of the President of Kazakhstan for Afghanistan, described the agenda as highly significant both substantively and strategically.\nHe noted that although Kazakhstan—like much of the international community—has not formally recognized the Islamic Emirate, Astana continues to engage with Afghanistan in the fields of trade, economic cooperation, and humanitarian assistance.\n“Humanitarian aid is especially important,” Tokumov said, adding that Kazakhstan has consistently provided assistance, including flour, tents, and food supplies during emergencies.\nFrom an economic standpoint, he described Afghanistan’s population of approximately 45 million as a promising market.\nHe also underscored Afghanistan’s strategic value as a transit corridor for Kazakhstan, a landlocked country seeking access to the Indian Ocean.\n“Kazakhstan’s perception of Afghanistan is changing,” he said. “In the past, we viewed Afghanistan solely through the lens of security threats. Today, we also see economic opportunities.”\nTurdakun Sydykov, Kyrgyzstan’s ambassador to Afghanistan, said his country views the Astana meeting and continued dialogue within the Contact Group framework as vital for addressing Afghanistan-related issues.\n“The primary focus is on reviewing trade, economic, and transport projects,” he told reporters, “as their implementation is essential for ensuring a peaceful and stable future for Afghanistan and the broader region.”\nIsmatilla Ergashev, Special Representative of the President of Uzbekistan for Afghanistan, said Central Asian countries may soon move toward implementing joint projects in Afghanistan, describing the country as a land bridge between Central and South Asia.\nHighlighting growing economic ties, he noted that Uzbekistan’s trade volume with Afghanistan reached nearly $1.7 billion last year.\nHe added that Kazakhstan and Uzbekistan have elevated Afghanistan to the status of an important trading partner.\n“We are all aware of the existing challenges,” he said, “and that is why we want to exchange views and coordinate our efforts to ensure regional security.”\nHe emphasized that regional powers should take a leading role in shaping approaches toward Afghanistan’s market.\nHe added that, from this perspective, the work of the Contact Group is particularly significant, as it aligns with broader strategic agreements reached by Central Asian leaders.\nsa",
    "content_length": 3100,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://pajhwok.com/rss.xml",
      "fetched_at": "2026-02-18T18:53:51.427976+00:00",
      "rss": {
        "published_at": "2026-02-18T15:47:51+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "71b1ac8b02e1ece23bc9a419",
    "country": "AFGHANISTAN",
    "source_name": "Pajhwok Afghan News",
    "source_slug": "pajhwok_afghan_news",
    "url": "https://pajhwok.com/2026/02/18/omans-foreign-minister-second-round-of-iran-u-s-talks-in-geneva-ends-with-good-progress/",
    "title": "Oman’s Foreign Minister: Second round of Iran-U.S. talks in Geneva ends with good progress",
    "published_at": "2026-02-18T10:46:39+00:00",
    "author": "Danish",
    "summary": "KABUL (Pajhwok): Oman’s Foreign Minister, who is mediating the nuclear negotiations between Iran and the United States, says the second round of talks between the two",
    "content_text": "KABUL (Pajhwok): Oman’s Foreign Minister, who is mediating the nuclear negotiations between Iran and the United States, says the second round of talks between the two countries ended with “good progress in identifying shared objectives and the relevant technical issues.”\nThe second round of negotiations between Iran and the United States, mediated by Oman, concluded last night in Geneva, Switzerland.\nFollowing the talks, Iran’s Foreign Minister Seyed Abbas Araghchi said Tehran and Washington had reached a common understanding during the second round of nuclear negotiations on the “main guiding principles,” but stressed that reaching a final outcome still requires further efforts.\nHe noted that this progress does not mean an immediate agreement, but indicates that the negotiations have entered an operational and practical phase.\nMeanwhile, Oman’s Foreign Minister Badr Albusaidi wrote in a post on X: “Today’s indirect talks between the Islamic Republic of Iran and the United States in Geneva ended with good progress in identifying shared objectives and the related technical issues.”\nHe described the atmosphere of the sessions as constructive and said: “Together, we made serious efforts to define a number of guiding principles for the final agreement.”\nAlbusaidi also expressed appreciation for the role of Rafael Grossi, Director General of the International Atomic Energy Agency (IAEA), in this round of talks.\nThe Omani foreign minister said much work still remains, but both sides have taken clear steps ahead of the next meeting.\nIt is worth noting that the first round of Iran-U.S. nuclear talks was held 11 days ago in Muscat, the capital of Oman.",
    "content_length": 1671,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://pajhwok.com/rss.xml",
      "fetched_at": "2026-02-18T18:53:51.428011+00:00",
      "rss": {
        "published_at": "2026-02-18T10:46:39+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "572ac551e3b802f7bbc024c5",
    "country": "AFGHANISTAN",
    "source_name": "Pajhwok Afghan News",
    "source_slug": "pajhwok_afghan_news",
    "url": "https://pajhwok.com/2026/02/18/plans-for-commercial-markets-in-sar-i-pul-jawzjan/",
    "title": "Plans for commercial markets in Sar-i-Pul, Jawzjan",
    "published_at": "2026-02-18T08:34:24+00:00",
    "author": "Sher Ahmad Usmani",
    "summary": "KABUL (Pajhwok): The Economic Deputy of the Office of the Prime Minister said that in the latest meeting of the Interministerial Investment Committee, plans for",
    "content_text": "KABUL (Pajhwok): The Economic Deputy of the Office of the Prime Minister said that in the latest meeting of the Interministerial Investment Committee, plans for constructing commercial markets in northern Sar-I-Pul and Jawzjan provinces were approved.\nAccording to a statement from the Economic Deputy’s office, the committee’s report on building a commercial market on municipal land in Gosfandi district, Sar-I-Pul, under an Islamic contract (Istisna’a), was presented and approved. The market will have two floors and 148 shops.\nIn the same session, the committee also approved a plan for a commercial market on municipal land in District 3 of Jawzjan provincial center, which will feature five floors and 79 shops.\nThe office further noted that a proposal to install screens on city taxis for broadcasting commercial, religious, social, and governmental announcements was also discussed.\nThe source added that the appointed committee has been tasked with thoroughly evaluating all aspects of the plans and submitting its report to the Interministerial Investment Committee within the set timeframe.\nsa",
    "content_length": 1105,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 38.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://pajhwok.com/rss.xml",
      "fetched_at": "2026-02-18T18:53:51.428033+00:00",
      "rss": {
        "published_at": "2026-02-18T08:34:24+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "13f21bb90f70c98f90fbcbdc",
    "country": "AFGHANISTAN",
    "source_name": "Pajhwok Afghan News",
    "source_slug": "pajhwok_afghan_news",
    "url": "https://pajhwok.com/2026/02/18/500000-afghan-refugees-supported-in-2025-unhcr/",
    "title": "500,000 Afghan refugees supported in 2025: UNHCR",
    "published_at": "2026-02-18T08:08:54+00:00",
    "author": "Sher Ahmad Usmani",
    "summary": "KABUL (Pajhwok): The United Nations High Commissioner for Refugees (UNHCR) reported that it supported 500,000 Afghan refugees returning to the country in 2025. In a",
    "content_text": "KABUL (Pajhwok): The United Nations High Commissioner for Refugees (UNHCR) reported that it supported 500,000 Afghan refugees returning to the country in 2025.\nIn a message posted on X, UNHCR said it assisted nearly 500,000 returnees last year and provided support to more than 78,000 women and girls.\nThe agency added: “The situation of over 57,000 individuals was assessed through monitoring in 34 provinces, an effort that has strengthened community-based protection.”\nMeanwhile, returning migrants have also received cash, food, and non-food assistance from the government and aid organizations and have been relocated to their home provinces.\nsa",
    "content_length": 650,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 38.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://pajhwok.com/rss.xml",
      "fetched_at": "2026-02-18T18:53:51.428051+00:00",
      "rss": {
        "published_at": "2026-02-18T08:08:54+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "be7e034af40be26688a68785",
    "country": "AFGHANISTAN",
    "source_name": "Pajhwok Afghan News",
    "source_slug": "pajhwok_afghan_news",
    "url": "https://pajhwok.com/2026/02/18/over-500-musical-instruments-set-alight-in-parwan/",
    "title": "Over 500 musical instruments set alight in Parwan",
    "published_at": "2026-02-18T08:00:14+00:00",
    "author": "Sher Ahmad Usmani",
    "summary": "CHARIKAR (Pajhwok): The Department for the Promotion of Virtue, Prevention of Vice, and Hearing Complaints in central Parwan province reported the burning of more than",
    "content_text": "CHARIKAR (Pajhwok): The Department for the Promotion of Virtue, Prevention of Vice, and Hearing Complaints in central Parwan province reported the burning of more than 500 musical instruments and related items.\nMawlawi Maqbool Ahmad Waqas, head of the department, told Pajhwok that these items, used for dancing and celebrations at ceremonies, had been collected over the past year from the provincial center and districts.\nHe said that today (Wednesday), the instruments were burned in the Gulghandi area in the presence of officials from the provincial government, intelligence department, and other relevant authorities.\nWaqas emphasized that the action was part of ongoing efforts to combat vice and urged residents to refrain from using items considered contrary to Sharia law.\nsa",
    "content_length": 785,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Provincial Government",
      "burning"
    ],
    "keywords_national_matched": [
      "Provincial Government"
    ],
    "keywords_threat_matched": [
      "burning"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Provincial Government"
    ],
    "kw_threat_hits": [
      "burning"
    ],
    "relevance_score": 10.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 15.0,
    "prepriority_score": 40.5,
    "prepriority_bucket": "MEDIUM",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://pajhwok.com/rss.xml",
      "fetched_at": "2026-02-18T18:53:51.428068+00:00",
      "rss": {
        "published_at": "2026-02-18T08:00:14+00:00"
      },
      "kw_national_hits": [
        "Provincial Government"
      ],
      "kw_threat_hits": [
        "burning"
      ],
      "kw_shortlisted": true
    }
  }
]