[
  {
    "id": "34b471c415cb99829f6bad25",
    "country": "UNITED KINGDOM",
    "source_name": "BBC News",
    "source_slug": "bbc_news",
    "url": "https://www.bbc.com/news/articles/cly8q62qe71o?at_medium=RSS&at_campaign=rss",
    "title": "Iran security official appears to fire on crowd at cemetery",
    "published_at": "2026-02-18T18:14:39+00:00",
    "author": "Jake Horton",
    "summary": "It happened as people gathered to commemorate those killed during the government’s brutal crackdown on protesters",
    "content_text": "Iran security official appears to fire on crowd at cemetery\nCrowds of mourners appear to have been fired on by a security official at a cemetery in Iran.\nThe incident happened in Abdanan, in west Iran, on Tuesday as people gathered to commemorate those killed during the government's brutal crackdown on protesters last month.\nIranians usually hold commemoration ceremonies on the 40th day after someone dies. The events have been held in several cities across the country to mourn the thousands killed during the deadliest nights of protests on 8 and 9 January.\nVerified video also shows people shouting anti-government chants at events in Tehran, Mashhad and Abdanan on Tuesday as crowds gathered at cemeteries and in the streets for commemorations.\nState-organised ceremonies were broadcast on TV and attended by senior government and military officials where people were led by organisers to chant \"death to America\".\nBBC Verify and BBC Persian have verified footage of people chanting \"death to Khamenei\", referencing Iran's supreme leader, Ayatollah Ali Khamenei.\nAn armoured vehicle is then seen driving past the crowd of mourners as an apparent security official opens fire. People are heard screaming and seen fleeing the area as two gunshots ring out.\nThe person who appears to be in uniform is seen pointing the gun away from the camera when the first shot is fired, before pointing the gun towards the crowd when a second shot can be heard. A puff of smoke near the gun is visible after each shot.\nAnother verified video from the cemetery shows smoke in the distance as people run away from the scene and several gunshots can be heard.\nState-run IRIB News claimed that the event was peaceful and reports of people injured or killed were not true.\nA billboard in the background of one the videos shows a picture of Alireza Seydi, a teenager from Abdanan who was understood to have been killed during the protests in Tehran last month and appears to be one of those commemorated during the ceremony.\nWeeks of anti-government protests started in late December which began over the economy but rapidly escalated. It peaked on 8 and 9 January after Reza Pahlavi, the exiled son of the late shah, called for nationwide protests to take place.\nThousands of people were killed in one of the deadliest government crackdowns in recent years. BBC Verify previously reported that it had spread to more than 68 towns and cities across the country.\nThe number of people killed during the protests is not fully known, but US-based Human Rights Activists News Agency (HRANA) has confirmed the deaths of 7,015 people, and the arrests of more than 53,000.\nKhamenei last month acknowledged that thousands had been killed during the protests and blamed the US for the deaths.\nAdditional reporting by Daniele Palumbo and Shayan Sardarizadeh",
    "content_length": 2831,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "Military",
      "killed",
      "death",
      "injured"
    ],
    "keywords_national_matched": [
      "Military"
    ],
    "keywords_threat_matched": [
      "killed",
      "death",
      "injured"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "Military"
    ],
    "kw_threat_hits": [
      "killed",
      "death",
      "injured"
    ],
    "relevance_score": 10.0,
    "evidence_strength": "LOW",
    "evidence_numeric": 25.0,
    "urgency_score": 100.0,
    "keyword_intensity": 33.0,
    "prepriority_score": 37.05,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://feeds.bbci.co.uk/news/world/rss.xml",
      "fetched_at": "2026-02-18T19:07:03.329101+00:00",
      "rss": {
        "published_at": "2026-02-18T18:14:39+00:00"
      },
      "kw_national_hits": [
        "Military"
      ],
      "kw_threat_hits": [
        "killed",
        "death",
        "injured"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "f8ae674b89ec8f28476e8c9f",
    "country": "UNITED KINGDOM",
    "source_name": "BBC News",
    "source_slug": "bbc_news",
    "url": "https://www.bbc.com/news/articles/cly23mrv68ro?at_medium=RSS&at_campaign=rss",
    "title": "You're never too old, says dancer, 71, cast in Taylor Swift video",
    "published_at": "2026-02-18T18:03:08+00:00",
    "author": "Amelia Shone-Adams",
    "summary": "Denise Sides  was selected from hundreds of applicants to take part in the Opalite video.",
    "content_text": "You're never too old, says dancer, 71, cast in Taylor Swift video\nA 71-year-old ballroom dancer said she had no idea she had been cast in a Taylor Swift music video until ten minutes before filming.\nDenise Sides, from Wrexham, was selected by the global megastar to appear in Opalite - a 90s-inspired rom-com that brought together the cast of an episode of the Graham Norton show.\nThe dance teacher said she auditioned for an \"unknown artist\" and once cast, the top-secret job involved being sent to the filming location in discreet transport.\n\"Then this young girl walks in, all dressed up, and she comes over and says, 'Hi, I'm Taylor,\" said Sides. \"I was like, no way. Oh my God.\"\nSides, who has been dancing for 60 years and teaches ballroom dancing classes, said she had signed up for TV extra work with an agency, and responded to a call-out for senior dancers on behalf of an \"unknown artist\".\nAfter being shortlisted, Sides received a call confirming she had been specifically chosen by the artist out of hundreds of applications.\nBut she had no idea record-breaking Swift was behind the request.\nSides said the whole experience was \"hush-hush\" and all she had been told was that the job involved recreating a dance competition.\nIt was only ten minutes before filming began that she found out the video was for a track from Swift's latest album, The Life of a Showgirl.\nSides, a Swiftie herself, said she was in shock when the singer walked in.\n\"I still feel excited now [remembering it],\" she said.\nSides said Swift, who sang in and directed the video, put everyone at ease during filming and thanked dancers for their time.\n\"She knew exactly what she wanted. She'd say, 'try this, try that,' and she was really nice about it,\" said the dance teacher.\n\"Some can be a bit abrupt but she wasn't. She was lovely and so talented.\"\nIn the video, Sides can be seen wearing a royal blue ballroom dancing outfit she has owned since becoming a professional dancer in 1988.\nShe said Swift complimented her outfit and said: \"I love your dress. It really fits the set.\"\nWhen Sides saw the video, which was filmed in November but released earlier this month, she said she was gobsmacked.\n\"You just can't believe it's you,\" she said.\nIt was difficult to keep the experience a secret too, she added: \"It was hard, I only told a few people in my dance class and my family.\"\nOpalite features Domhnall Gleeson, Lewis Capaldi, Greta Lee and a cameo voiceover from Cillian Murphy, all of whom appeared on the Graham Norton show with Swift in October.\nIt tells the story of a lonely woman who uses a magical spray to improve her life and finds romance with a fellow loner.\nDespite dancing her whole life and with decades of acting experience, Sides said the shoot with Swift was the most important of her career.\nShe said she hoped her experience would inspire others to try dancing.\n\"Maybe people will think, 'Well, if Taylor chose her, why don't we?',\" she said.\n\"You're never too old. It was an experience I will never, ever forget.\"\nIn addition to running Dens Dance Studio since the 1990s, Sides also hosts inclusive workshops for those with disabilities.\n\"If I'm not teaching, I'm dancing myself,\" she said. \"That's my happy place, my passion.\"",
    "content_length": 3238,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://feeds.bbci.co.uk/news/world/rss.xml",
      "fetched_at": "2026-02-18T19:07:03.329137+00:00",
      "rss": {
        "published_at": "2026-02-18T18:03:08+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "43a1d57bfa53d3be583693d3",
    "country": "UNITED KINGDOM",
    "source_name": "BBC News",
    "source_slug": "bbc_news",
    "url": "https://www.bbc.com/news/articles/cwyk6nr80kxo?at_medium=RSS&at_campaign=rss",
    "title": "Suspected carbon-monoxide leak kills at least 30 miners in Nigeria - witnesses",
    "published_at": "2026-02-18T17:29:23+00:00",
    "author": "Mansur Abubakar",
    "summary": "People at the scene say it happened just before sunrise as the workers neared the end of their shift.",
    "content_text": "Suspected carbon-monoxide leak kills at least 30 miners in Nigeria - witnesses\nAt least 33 miners have died in a suspected carbon-monoxide leak at a lead and zinc mine in central Nigeria's Plateau state, witnesses have told the BBC.\nThe tragedy is believed to have happened just before sunrise at a site outside the town of Wase run by the mining company Solid Unity Nigeria Ltd.\nToxic gas is believed to have built up underground in poorly ventilated tunnels, causing the workers to collapse just before the end of their night shift.\nThey were discovered by those reporting to work in the morning - more than 20 other miners were rescued and rushed to hospital for treatment.\nSecurity personnel have sealed off the mine, which is about 200km (124 miles) south-east of the state capital of Jos, as investigations get under way to find out the cause of the leak.\nState officials are yet to visit the area and response efforts have reportedly been slow because of security concerns - armed criminal gangs, known locally as \"bandits\", have been active there in recent years.\nSafiyanu Haruna, one of the miners who found the bodies at the start of his shift, told the BBC that some of the miners who were underground survived and were taken to a hospital in Wase for treatment.\nAccording to Haruna, the incident occurred at around 06:30 local time (05:30 GMT) killing 37 miners.\nHe said the miners had just finished performing their early morning Muslim prayers and had returned underground to finish their shift.\nThe Plateau state government has issued a statement saying that according to its preliminary investigation 33 miners were killed in a blast at the mine - but workers at the scene say this is not the case.\n\"It was carbon-monoxide gas that leaked and killed them,\" Haruna said.\n\"There was no rescue for them at the time because those who were coming for the morning shift had yet to arrive,\" he said.\n\"It is sad to lose 37 miners who were struggling to make ends meet. We're disturbed by the incident.\"\nThe victims, believed to be men aged between 20 and 40, were buried shortly afterwards in accordance with local tradition, another local resident told the BBC.\nThe news has devastated the mainly Muslim community.\nMining disasters occur relatively frequently in Nigeria.\nLess than two years ago, dozens of gold miners died after being trapped underground when a pit collapsed in neighbouring Niger state.\nOfficials believe that incident was caused by torrential rains which had softened the soil.\nThe tragedy is likely to renew concerns over safety standards in Nigeria's mining sector.\nAdditional reporting by Ado Musa in Wase and Madina Maishanu\nMore BBC stories on Nigeria:\nGo to BBCAfrica.com for more news from the African continent.\nFollow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica",
    "content_length": 2836,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://feeds.bbci.co.uk/news/world/rss.xml",
      "fetched_at": "2026-02-18T19:07:03.329111+00:00",
      "rss": {
        "published_at": "2026-02-18T17:29:23+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "a0cdadb0c4e6df9008818f6e",
    "country": "UNITED KINGDOM",
    "source_name": "BBC News",
    "source_slug": "bbc_news",
    "url": "https://www.bbc.com/news/articles/c62dzgy0q37o?at_medium=RSS&at_campaign=rss",
    "title": "Wave of arrests over killing of French nationalist piles pressure on far left",
    "published_at": "2026-02-18T17:26:04+00:00",
    "author": "Paul Kirby",
    "summary": "Eleven people are in detention in connection with the killing of far-right student activist Quentin Deranque.",
    "content_text": "Wave of arrests over killing of French nationalist piles pressure on far left\nTwo more people have been detained by French authorities investigating the killing of a far-right student activist by suspected radical left militants in Lyon, bringing the total in custody to 11.\nQuentin Deranque, 23, suffered a fatal brain injury when he was beaten and kicked during a demonstration last week on the sidelines of a conference held by Rima Hassan, a member of the European Parliament for hard-left party France Unbowed (LFI).\nThe wave of arrests began on Wednesday, and included a parliamentary aide to LFI politician Raphaël Arnault.\nArnault said his assistant, Jacques-Elie Favrot, had halted all his work in parliament and his contract was being terminated.\nEven before his arrest, Favrot's lawyer said he formally denied responsibility for the activist's death and was unable to continue his duties because of death threats.\nAlthough the radical left party leader Jean-Luc Mélenchon has sought to distance the party from Deranque's violent death, LFI has come under attack from rivals across the political spectrum, less than a month before France votes in key municipal elections.\nGovernment spokesperson Maud Bregeon has urged the party to suspend Raphaël Arnault from its parliamentary group because of the MP's links to Anti-Fascist Young Guard, which has been blamed for the violence a short distance from Sciences Po University in Lyon.\nThe political climate is febrile ahead of the March votes - seen as the last test of public opinion before next year's presidential elections. Within the past month Sébastien Lecornu's minority government had to survive two no-confidence motions to push through this year's budget.\nLFI party co-ordinator Manuel Bompard announced on Wednesday that the party's Paris HQ was briefly evacuated because of a bomb threat, and went on to accuse a large cross-section of the political and media classes of making days of false and defamatory statements.\n\"I call for an end to this absolutely despicable exploitation of the tragedy that took place last Thursday evening in Lyon, for which France Unbowed bears absolutely no responsibility,\" he told reporters. \"This climate should worry everybody.\"\nVideos captured from the scene show three people lying on the ground coming under attack from a larger group, all of them wearing hoods.\nA feminist anti-immigration group called Némésis said Deranque had been outside the venue to protect its members. Némésis has blamed Young Guard for the attack - an allegation it denies.\nA minute's silence was held in the National Assembly on Tuesday for the young activist, and politicians lined up to criticise the radical-left leader and his colleagues.\nJordan Bardella of the far-right National Rally said Mélenchon had \"moral and political responsibility\" for what had happened and even former LFI MP Alexis Corbière called on the party to take stock politically of what had happened.\nSébastien Lecornu said that \"without undermining the presumption of innocence\" LFI had to \"clean up\" its statements, ideas and its ranks fast.\nMélenchon hit back, saying he refused to take lessons from Lecornu.\nHowever, more moderate figures on the left such as Socialist ex-President François Hollande have accused LFI of being responsible for lowering the tone of politics in France.\n\"It's clear there can be no alliance in the municipal elections between the Socialists or reformist left-wing parties and LFI in the second round,\" Hollande said on Wednesday. \"The relationship is over.\"\nFor months the party had indulged in a kind of \"brutalisation\" of debate so there was no political space between the far left and far right, said Hollande.\nThe actions of police have also come in for criticism, as local forces were warned that Rima Hassan's event was due to take place but riot police were not on the scene at the time of the fatal attack.\nThe death of Deranque has prompted reaction across the border in Italy, where Prime Minister Giorgia Meloni has described the attack as deeply shocking and \"a wound for the whole of Europe\".",
    "content_length": 4098,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "National Assembly",
      "Police",
      "attack",
      "militants",
      "radical",
      "bomb",
      "killing",
      "death",
      "fatal",
      "riot",
      "arrest",
      "detained",
      "detention",
      "custody",
      "threat",
      "threats"
    ],
    "keywords_national_matched": [
      "National Assembly",
      "Police"
    ],
    "keywords_threat_matched": [
      "attack",
      "militants",
      "radical",
      "bomb",
      "killing",
      "death",
      "fatal",
      "riot",
      "arrest",
      "detained",
      "detention",
      "custody",
      "threat",
      "threats"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "National Assembly",
      "Police"
    ],
    "kw_threat_hits": [
      "attack",
      "militants",
      "radical",
      "bomb",
      "killing",
      "death",
      "fatal",
      "riot",
      "arrest",
      "detained",
      "detention",
      "custody",
      "threat",
      "threats"
    ],
    "relevance_score": 45.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 100.0,
    "prepriority_score": 66.5,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://feeds.bbci.co.uk/news/world/rss.xml",
      "fetched_at": "2026-02-18T19:07:03.329090+00:00",
      "rss": {
        "published_at": "2026-02-18T17:26:04+00:00"
      },
      "kw_national_hits": [
        "National Assembly",
        "Police"
      ],
      "kw_threat_hits": [
        "attack",
        "militants",
        "radical",
        "bomb",
        "killing",
        "death",
        "fatal",
        "riot",
        "arrest",
        "detained",
        "detention",
        "custody",
        "threat",
        "threats"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "4f4de943a71f64d59f7a07fa",
    "country": "UNITED KINGDOM",
    "source_name": "BBC News",
    "source_slug": "bbc_news",
    "url": "https://www.bbc.com/news/articles/cpd8zx4qdz6o?at_medium=RSS&at_campaign=rss",
    "title": "Air Force One set for makeover paint job with new colours",
    "published_at": "2026-02-18T17:17:56+00:00",
    "author": "Kwasi Gyamfi Asiedu",
    "summary": "The presidential jet, along with other aircraft used for high-level officials, is being painted with some of Trump's preferred palette.",
    "content_text": "Air Force One set for makeover paint job with new colours\nThe US presidential jet is getting a new paint design that will include one of President Donald Trump's preferred colour choices for the White House and his hotels, gold.\nAir Force One and other planes used by high level US officials, including First Lady Melania Trump, are being repainted gold, deep red and navy blue as they undergo scheduled repairs and maintenance, according to the US Air Force.\nThe colours will also feature on a new luxury 747-8i Boeing plane donated to the presidential fleet by Qatar, an Air Force spokesperson told CBS.\nThe white, blue and robin's egg blue associated with the presidential jet have been in use since the 1960s, when John F Kennedy was president.\nTrump has called for updates to the executive fleet since his first term. His successor, former President Joe Biden, cancelled a broad makeover Trump had initially planned.\nThe new colours have already been spotted on model aircraft seen at the White House, where Trump is also making his aesthetic imprint, from the large-scale plans for a new ballroom to the more subtle installation of signs in a curling font in gold.\nThe private plane Trump travelled on during his 2024 campaign, sometimes called \"Trump Force One\", used the same colour palette that will be given to the presidential fleet.\nWhile it is not clear how much the paint jobs will cost, the US Air Force, which operates the executive planes, said in a statement to the BBC that the new colour requirements were \"not expected to result in additional delays or costs to the program.\"\nIt added that it was implementing the new colour scheme on the Boeing VC-25B (a variation of the Boeing 747) currently used to transport the president, as well as four C-32 jets often used as \"Air Force Two\" for the vice-president, and the jet donated by Qatar. Painting has been completed on of the C-32 aircraft.\nPreparations began last summer for the Pentagon to refit the Qatari jumbo jet that is expected to serve as Air Force One. The Boeing aircraft - valued at $400m (£300m) - was donated by Qatar as an \"unconditional\" gift, with any necessary retrofitting costs being borne by the US government.\nWhile any plane where the president is a passenger is called \"Air Force One\", the holder of the highest office in the country most often flies on a specialised jet that includes an office, a bedroom suite, two kitchen galleys that can prepare 100 meals, office space and a medical facility, according to Boeing.",
    "content_length": 2514,
    "extraction_method": "rss",
    "extraction_notes": [
      "ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 38.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://feeds.bbci.co.uk/news/world/rss.xml",
      "fetched_at": "2026-02-18T19:07:03.329146+00:00",
      "rss": {
        "published_at": "2026-02-18T17:17:56+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  }
]