[
  {
    "id": "86906741ab254a6463a6e0ba",
    "country": "UNITED KINGDOM",
    "source_name": "The Guardian",
    "source_slug": "the_guardian",
    "url": "https://www.theguardian.com/politics/2026/feb/18/countries-do-not-embrace-ai-left-behind-george-osborne",
    "title": "Countries that do not embrace AI could be left behind, says OpenAI’s George Osborne",
    "published_at": "2026-02-18T17:57:22+00:00",
    "author": "Robert Booth in Delhi",
    "summary": "<p>Without AI you will be a ‘weaker and poorer nation’, says former UK chancellor two months into job at US firm</p><p>The former chancellor George Osborne has said countries that do not embrace the kind of powerful AI systems made by his new employer, OpenAI, risk “Fomo” and could be left weaker and poorer.</p><p>Osborne, who is <a href=\"https://www.theguardian.com/commentisfree/2025/dec/18/george-osborne-openai-big-tech-political-hires\">two months into a job</a> as head of the $500bn San Francisco AI company’s “for countries” programme, told leaders gathered for the AI Impact summit in Delhi: “Don’t be left behind.” He said that without AI rollouts they could end up with a workforce “less willing to stay put” because they might want to seek AI-enabled fortunes elsewhere.</p> <a href=\"https://www.theguardian.com/politics/2026/feb/18/countries-do-not-embrace-ai-left-behind-george-osborne\">Continue reading...</a>",
    "content_text": "The former chancellor George Osborne has said countries that do not embrace the kind of powerful AI systems made by his new employer, OpenAI, risk “Fomo” and could be left weaker and poorer.\nOsborne, who is two months into a job as head of the $500bn San Francisco AI company’s “for countries” programme, told leaders gathered for the AI Impact summit in Delhi: “Don’t be left behind.” He said that without AI rollouts they could end up with a workforce “less willing to stay put” because they might want to seek AI-enabled fortunes elsewhere.\nOsborne framed the choice facing countries as one between adopting AI systems produced either in the US – such as Open AI’s – or China. The two superpowers have so far developed the most powerful AI systems.\nThe fourth intergovernmental AI summit, hosted by India’s prime minister, Narendra Modi, follows editions in the UK, Korea and France and is focusing on harnessing AI to the benefit of countries in the global south, for example by embracing more regional languages and applying AI to improving agriculture and public health.\nIt is also aiming to improve safety standards, which some experts fear are falling short of addressing the potential catastrophic risks being posed by the most advanced AIs amid White House opposition to red tape.\n“A lot of countries who aren’t the United States of America and who aren’t the People’s Republic of China essentially face two kind of slightly contradictory feelings at the same time,” Osborne said. “The first is a Fomo: are we missing out on this huge technological revolution? How to be part of it? How do we make sure that our companies feel the benefits of it? How do we make sure our societies feel the benefits of it?”\nAt the same time, he said, these countries wanted to safeguard their national sovereignty while relying on powerful AIs controlled in the US and China.\nOsborne said: “There’s another kind of sovereignty, which is: don’t be left behind, because then you will be a weaker nation, a poorer nation, a nation whose workforce will be less willing to stay put.”\nHis comments came as the White House’s senior AI adviser, Sriram Krishnan, emphasised the Trump administration’s desire for AI supremacy, telling the summit: “We want to make sure the world uses our AI model.”\nHe also took a fresh swipe at the EU’s attempts to regulate AI, saying he would continue to “rant” against them.\n“The EU AI Act is not really very conducive to an entrepreneur who wants to build innovative technology,” he said.\nBut other technologists, and AI leaders in Africa, said the case for reliance on the two AI superpowers was not so clearcut.\n“The idea that countries other than China and the US won’t be able to build big things – and we [hear] that a lot – is actually a false premise,” Mark Surman, the head of Mozilla, said. “It benefits the companies within those two countries.”\n“For us, it’s not a US or China thing,” said Kevin Degila, in charge of of AI and data at the Benin government’s digital agency. “We are Africans and our job is to collaborate [with each other] to build our own AI.”\nHe said 64 languages were spoken in his country of 15 million people and the government agency was building AIs for the public that fuse both American and Chinese AI technologies and their own large language datasets.\n“Anthropic and OpenAI don’t reach the farmers,” he said.\nPaula Ingabire, Rwanda’s minister of ICT and innovation, said her country was looking at partnerships with AI companies “that are going to be progressively less necessary”, with Rwanda not wishing to be “locked into very dependent partnerships”.\nAlso speaking at the summit was Rishi Sunak, the former UK prime minister, who now advises one of OpenAI’s main rivals, Anthropic, and Microsoft.\nHe urged political leaders to take bolder steps to lead the rollout of AI, saying: “If you are a prime minister you can only do a few things that you drive personally, and this has to be one of them.”\n“One of my concerns is that I think some political leaders think that AI is going to be tomorrow’s issue, where I think they need to recognise that it’s an ‘action this day’ issue,” Sunak said. “AI needs to go to a centralised responsibility so we can realise the benefits.”",
    "content_length": 4235,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "MED",
    "evidence_numeric": 60.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 34.0,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.theguardian.com/world/rss",
      "fetched_at": "2026-02-18T19:07:30.195782+00:00",
      "rss": {
        "published_at": "2026-02-18T17:57:22+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "d31f1523448d48a6e6977884",
    "country": "UNITED KINGDOM",
    "source_name": "The Guardian",
    "source_slug": "the_guardian",
    "url": "https://www.theguardian.com/world/2026/feb/18/climber-manslaughter-charge-girlfriend-austria-highest-peak",
    "title": "Climber faces manslaughter charge after leaving girlfriend on Austria’s tallest peak",
    "published_at": "2026-02-18T17:35:56+00:00",
    "author": "Kate Connolly in Berlin",
    "summary": "<p>Kerstin G froze to death on Großglockner when Thomas P descended mountain to fetch help</p><p>An Austrian mountaineer is to appear in court accused of gross negligent manslaughter after his girlfriend died of hypothermia when he left her close to the summit on a climb that went dramatically wrong.</p><p>The 33-year-old woman, identified only as Kerstin G, froze to death on 19 January 2025, about 50 metres below the summit of the Großglockner, Austria’s tallest mountain, after an ascent of more than 17 hours with her boyfriend, Thomas P, 36.</p> <a href=\"https://www.theguardian.com/world/2026/feb/18/climber-manslaughter-charge-girlfriend-austria-highest-peak\">Continue reading...</a>",
    "content_text": "An Austrian mountaineer is to appear in court accused of gross negligent manslaughter after his girlfriend died of hypothermia when he left her close to the summit on a climb that went dramatically wrong.\nThe 33-year-old woman, identified only as Kerstin G, froze to death on 19 January 2025, about 50 metres below the summit of the Großglockner, Austria’s tallest mountain, after an ascent of more than 17 hours with her boyfriend, Thomas P, 36.\nProsecutors argue that Thomas P’s alleged poor judgment and willingness as the more experienced climber to take risks make him criminally liable for her death, in a case that could have implications for mountain sports and which has prompted debate in Austria and beyond.\nIf found guilty, Thomas P could spend three years in prison.\nThe couple had set out on the morning of 18 January but conditions deteriorated, leaving them struggling in darkness against a temperature that fell to almost -9C, a wind chill of -20C, and gusts of up to 45mph, the court in Innsbruck will hear when the trial opens on Thursday.\nThomas P left Kerstin G at about 2am in a state of exhaustion and unprotected when he descended the mountain to fetch help.\nHe denies manslaughter. His lawyer, Kurt Jelinek, called Kerstin G’s death “a tragic accident”.\nThe senior public prosecutor Hansjörg Mayr and his team are citing the legal concept of the “tour guide acting as a courtesy” in the case, which designates the person with more experience and knowledge and the key decision-maker as having most responsibility.\nThe prosecutors therefore accuse Thomas P of failing in his responsibility as the more experienced climber, listing nine major errors. These include forging ahead with the climb despite the fact Kirsten G had “never undertaken an Alpine tour of this length, difficulty and altitude and despite the challenging weather conditions”.\nThe couple had started out two hours later than advised and had not been sufficiently equipped with emergency bivouac equipment, the prosecutors said. Neither had Thomas P advised Kerstin G that the snowboard boots she was wearing were inadequate for the terrain.\nProsecutors also allege Thomas P was negligent in failing to turn back and question why, despite his partner’s exhaustion, he failed to make an emergency call before nightfall and did not send distress signals to a passing rescue helicopter.\n“Around 2am, the defendant left his girlfriend unprotected, exhausted, hypothermic, and disoriented approximately 50 metres below the summit cross of the Großglockner,” Mayr said.\nJelinek disputes the prosecutor’s version, saying the couple had organised the tour together, and were “sufficiently experienced, adequately prepared and well-equipped”, with “relevant Alpine experience” and “in very good physical condition”.\nMore than 7,000 people climb the 3,798-metre-high (12,461ft) Großglockner every year. About 200 deaths of mountaineers have been recorded there, but none has attracted as much attention as that of Kerstin G.\nHer mother, Gertraud G, who is due to give evidence, has said she does not hold Thomas P responsible for her daughter’s death and has spoken of a “witch-hunt” against him.\nIn a recent interview with the German weekly Die Zeit, Gertraud G said she was upset at the way in which her daughter, who she said had discovered her passion for mountain climbing during the pandemic, had been depicted.\n“It makes me angry that Kerstin is being portrayed as a stupid little thing,” she said. “Kerstin was in top physical condition. And she had already mastered far more difficult climbing tours, both alone and with her boyfriend.”",
    "content_length": 3627,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 38.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.theguardian.com/world/rss",
      "fetched_at": "2026-02-18T19:07:30.196011+00:00",
      "rss": {
        "published_at": "2026-02-18T17:35:56+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "42864241e780a4e32eb7cafc",
    "country": "UNITED KINGDOM",
    "source_name": "The Guardian",
    "source_slug": "the_guardian",
    "url": "https://www.theguardian.com/world/live/2026/feb/18/ukraine-russia-peace-talks-zelenskyy-trump-putin-denmark-greenland-europe-live",
    "title": "Zelenskyy says no agreement on key issues in peace talks as he accuses Russia of ‘dragging out negotiations’ – as it happened",
    "published_at": "2026-02-18T16:07:54+00:00",
    "author": "Tom Ambrose (now) and Taz Ali (earlier)",
    "summary": "<p>Unresolved ‘sensitive’ issues in peace talks are fate of occupied territories in east Ukraine and Zaporizhzhia nuclear power plant</p><p>The peace talks ended abruptly today after about two hours, according to reports, in contrast with yesterday’s negotiations that apparently took place over six hours.</p><p>Neither side have offered any public sign of progress, but instead said the talks were <a href=\"https://www.theguardian.com/world/live/2026/feb/18/ukraine-russia-peace-talks-zelenskyy-trump-putin-denmark-greenland-europe-live?page=with%3Ablock-69958c638f08c412945d6f2d#block-69958c638f08c412945d6f2d\">“difficult” </a>with Russian news agencies quoting sources describing the negotiations as “very tense”.</p> <a href=\"https://www.theguardian.com/world/live/2026/feb/18/ukraine-russia-peace-talks-zelenskyy-trump-putin-denmark-greenland-europe-live\">Continue reading...</a>",
    "content_text": "Zelenskyy: No agreement on key issues in Geneva talks\nZelenskyy said there has been no agreement between Ukraine and Russia on the key issues at the US-mediated talks in Geneva.\n“We can see that some groundwork has been done, but for now the positions differ, because the negotiations were not easy,” the Ukrainian president told reporters after the talks had finished, according to the AFP news agency.\nHe listed the fate of occupied territories in Ukraine’s east and the future of the Zaporizhzhia nuclear power plant, which Russia has taken control of, as the unresolved “sensitive” issues in the peace talks.\nVolodymyrZelenskyy said there has been no agreement between Ukraine and Russia on the key issues at the US-mediated talks in Geneva. “We can see that some groundwork has been done, but for now the positions differ, because the negotiations were not easy,” the Ukrainian president told reporters after the talks had finished, according to the AFP news agency.\nThe latest round of US-mediated peace talks between Russia and Ukraine in Geneva on Wednesday ended without a major breakthrough, as fighting continues in a war that will enter its fifth year next week. Ukraine’s president, Volodymyr Zelenskyy, said no agreement had been reached on the thorniest questions at the negotiations in Switzerland, accusing Moscow of “trying to drag out” the process.\nUkraine has sanctioned the Belarusian president Alexander Lukashenko for providing military support to Russia and enabling “the killing of Ukrainians”, Zelenskyy has announced. Lukashenko, one of Russian president Vladimir Putin’s closest allies, has allowed Moscow to use Belarusian territory as a launchpad for its invasion of Ukraine.\nRussia has demanded for evidence after five European countries accused Moscow of poisoning the outspoken Russian opposition leader Alexei Navalny with a dart frog poison. The UK, France, Germany Sweden and the Netherlands said on Saturday that laboratory testing of samples from Navalny’s body had confirmed the presence of epibatidine, a toxin found in poison dart frogs in South America and not found naturally in Russia.\nSlovakia has threatened to cut emergency electricity supplies to Kyiv if it does not reopen a pipeline that brings Russian oil to Slovakia and Hungary. Slovakian prime minister Robert Fico, who is a close ally of Putin’s along with Hungary’s Viktor Orbán, declared a state of emergency over oil supplies.\nFour South African men who were lured into fighting alongside Russian forces in Ukraine landed at Johannesburg’s main airport on Wednesday, public broadcaster the South African Broadcasting Corporation reported. Police were waiting at OR Tambo International Airport, the SABC said. A police spokesperson declined comment, directing enquiries to the foreign affairs ministry.\nUkraine’s sports minister has condemned the decision to allow six Russians and four Belarusians to compete under their nation’s flags at next month’s Winter Paralympics as “disappointing and outrageous” and said Ukraine officials will not attend the opening ceremony or other official events as a result. “The flags of Russia and Belarus have no place at international sporting events that stand for fairness, integrity, and respect,” said Matvii Bidnyi in response to the International Paralympic Committee’s decision on Monday.\nRussia and Cuba on Wednesday criticised the US energy blockade of the Caribbean island in a show of solidarity in Moscow, where Havana’s foreign minister was due to meet with president Vladimir Putin. Cuba’s top diplomat Bruno Rodriguez travelled to traditional ally Russia seeking help as his country reels from a severe fuel crisis – intensified by Washington’s de-facto oil blockade.\nSlovakia has threatened to cut emergency electricity supplies to Kyiv if it does not reopen a pipeline that brings Russian oil to Slovakia and Hungary. Slovakian prime minister Robert Fico, who is a close ally of Putin’s along with Hungary’s Viktor Orbán, declared a state of emergency over oil supplies.\nChancellor Friedrich Merz said he was open to a social media ban for children. “If children today, at the age of 14, have up to five hours or more of screen time a day, if their entire socialisation takes place only through this medium, then we shouldn’t be surprised by personality deficits and problems in the social behaviour of young people,” he said in an interview with the podcast Machtwechsel.\nHeavy snow and rain across Romania left 200,000 homes without electricity on Wednesday, energy minister Bogdan Ivan said, with traffic blocked on motorways and national roads and dozens of trains delayed. Public transport in the capital, Bucharest, was struggling under 40 cm (16 inches) of snow, Reuters reported. Fallen trees halted road and rail traffic, schools closed in several towns and 10 ambulances in six counties were snowed in, the national emergency response agency said.\nFrance has launched wide-ranging investigations into human trafficking and financial fraud among contacts of the late convicted US sex offender Jeffrey Epstein following the release of a trove of files on his activities. Paris prosecutor Laure Beccuau told France Info radio on Wednesday that the investigations will rely on publicly available material alongside complaints filed by child protection groups.\n“The greatness of America,” wrote the 19th-century French diplomat, political philosopher and historian Alexis de Tocqueville, “lies not in her being more enlightened than any other nation, but rather in her ability to repair her faults.”\nFor a brief moment at the Munich Security Conference (MSC) last weekend, European leaders half-thought that their most heartfelt wish – the return of the old US, that believed in the EU ideal and backed a rules-based world order – had been granted.\nThe previous year on this same stage, US vice-president JD Vance had delivered a gut punch: a brutal ideological assault accusing Europe of abandoning “fundamental values”, and questioning whether the US and EU still had a common agenda.\nRubio played a soothing tune. The US and Europe “belong together”, he said: if Americans came across as direct and urgent, it was because they know European and US destinies were forever intertwined. The US would “always be a child of Europe”.\nFour South African men who were lured into fighting alongside Russian forces in Ukraine landed at Johannesburg’s main airport on Wednesday, public broadcaster the South African Broadcasting Corporation reported.\nPolice were waiting at OR Tambo International Airport, the SABC said. A police spokesperson declined comment, directing enquiries to the foreign affairs ministry.\nA foreign ministry spokesperson did not immediately respond to a message seeking comment, Reuters reported.\nSouth Africa’s government said in November that it would investigate how 17 of its citizens joined mercenary forces in the Russia-Ukraine conflict after the men sent distress calls for help to return home.\nPresident Cyril Ramaphosa spoke to Russian president Vladimir Putin by telephone earlier this month, and Ramaphosa’s office said after the call that the two leaders had “pledged their support to the process of returning South Africans fighting alongside Russian forces in Ukraine“.\nUnder South African law, it is illegal for citizens to provide military assistance to foreign governments or participate in foreign armies unless authorised by South Africa.\nHeavy snow and rain across Romania left 200,000 homes without electricity on Wednesday, energy minister Bogdan Ivan said, with traffic blocked on motorways and national roads and dozens of trains delayed.\nPublic transport in the capital, Bucharest, was struggling under 40 cm (16 inches) of snow, Reuters reported. Fallen trees halted road and rail traffic, schools closed in several towns and 10 ambulances in six counties were snowed in, the national emergency response agency said.\n“Of the 200,000 homes affected so far, roughly 86,000 were reconnected to power, there are ... 266 towns affected,” Ivan told reporters.\nHe added Romania’s power consumption was 7.4GW on average, with surplus wind and hydro production being exported. Production and consumption were up 11% and 6% on the year, respectively, he said.\nWe have some images from the newswires of Denmark’s King Frederik in Greenland. He is expected to attend a luncheon hosted by Greenland’s prime minister Jens-Frederik Nielsen and take a tour of a school in Nuuk and the headquarters of the Joint Arctic Command. He is also scheduled to visit a factory of Royal Greenland, the island’s largest company.\n‘Not easy’: Russia-Ukraine peace talks in Geneva end with no breakthrough\nThe latest round of US-mediated peace talks between Russia and Ukraine in Geneva on Wednesday ended without a major breakthrough, as fighting continues in a war that will enter its fifth year next week.\nUkraine’s president, Volodymyr Zelenskyy, said no agreement had been reached on the thorniest questions at the negotiations in Switzerland, accusing Moscow of “trying to drag out” the process.\n“We can see that some groundwork has been done, but for now the positions differ, because the negotiations were not easy,” he told reporters after the talks.\nZelenskyy said the status of Russian-occupied territories in eastern Ukraine and the future of the Zaporizhzhia nuclear power plant, which remains under Moscow’s control, were among the most contentious unresolved issues.\nThe second day of talks ended after just two hours, signalling scant progress and underscoring how distant a deal still appears, despite Donald Trump’s promises to end the war on the first day of his presidency.\nRead the full report by our Russian affairs reporter Pjotr Sauer here:\nSlovakia warns Ukraine of reprisals over blocked pipeline\nBack in Ukraine news, Slovakia has threatened to cut emergency electricity supplies to Kyiv if it does not reopen a pipeline that brings Russian oil to Slovakia and Hungary.\nSlovakian prime minister Robert Fico, who is a close ally of Putin’s along with Hungary’s Viktor Orbán, declared a state of emergency over oil supplies. He said he had ordered the release of 250,000 tonnes of oil from emergency reserves in response to the interruption of oil supplies via the Druzhba pipeline.\nFico claimed the repair work had finished and accused Ukraine of blocking oil supplies in order to “blackmail” Hungary, which opposes Kyiv from joining the EU. Orbán repeated this accusation, saying on social media that Ukraine was “trying to pressure us to support their EU membership”.\n“Thankfully, Hungary has a government that doesn’t bow to blackmail,” he said.\nFico threatened to end electricity supplies to Ukraine, saying: “If the president (Zelenskyy) believes these supplies are not important, we can decide to withdraw from the electricity supply accord.”\nFrance has launched wide-ranging investigations into human trafficking and financial fraud among contacts of the late convicted US sex offender Jeffrey Epstein following the release of a trove of files on his activities.\nParis prosecutor Laure Beccuau told France Info radio on Wednesday that the investigations will rely on publicly available material alongside complaints filed by child protection groups.\nOne will focus on human trafficking, the other on crimes including money laundering, corruption and tax fraud.\nRussia and Cuba on Wednesday criticised the US energy blockade of the Caribbean island in a show of solidarity in Moscow, where Havana’s foreign minister was due to meet with president Vladimir Putin.\nCuba’s top diplomat Bruno Rodriguez travelled to traditional ally Russia seeking help as his country reels from a severe fuel crisis – intensified by Washington’s de-facto oil blockade.\nUS president Donald Trump cut off key supplies of Venezuelan oil to Cuba after ousting Venezuela’s Nicolas Maduro and has threatened sanctions on states that sell oil to Havana.\nRodriguez met with his Russian counterpart Sergei Lavrov ahead of seeing Putin, with the long-serving Russian diplomat using Soviet-era language to criticise Washington.\n“We call on the US to show common sense and refrain from the military-maritime blockade of the island of freedom,” Lavrov said.\nUkraine officials to boycott Winter Paralympics opening ceremony over Russian athletes\nUkrainian officials will not attend the opening ceremony or other official events of the Winter Paralympics over the decision to allow six Russians and four Belarusians to compete under their nation’s flags, Ukraine’s sports minister said.\n“We thank every official from the free world who will do the same. We will keep fighting,” Matvii Bidnyi said.\nThe Guardian’s chief sports reporter, Sean Ingle, has more on this story here:\nRussia has demanded for evidence after five European countries accused Moscow of poisoning the outspoken Russian opposition leader Alexei Navalny with a dart frog poison.\nThe UK, France, Germany Sweden and the Netherlands said on Saturday that laboratory testing of samples from Navalny’s body had confirmed the presence of epibatidine, a toxin found in poison dart frogs in South America and not found naturally in Russia. In a joint statement, the five countries said Russia “had the means, motive and opportunity” to administer the poison to Navalny, who was in a remote Arctic penal colony serving a 19-year sentence. He died in February 2024 which the Kremlin said at the time was of natural causes.\nRussia’s foreign ministry spokesperson Maria Zakharova said: “All the accusations against Russia were of the ‘highly likely’ variety. There were no specific details. It was purely a proclamation to become the opening act of the Munich (security) conference and to overshadow the Epstein files.\n“We demand they hand over concrete data on this issue.”\nMerz open to social media ban for children in Germany\nIn Germany, chancellor Friedrich Merz said he was open to a social media ban for children.\n“If children today, at the age of 14, have up to five hours or more of screen time a day, if their entire socialisation takes place only through this medium, then we shouldn’t be surprised by personality deficits and problems in the social behaviour of young people,” he said in an interview with the podcast Machtwechsel.\nHe said he was generally sceptical of bans but saw the consequences of mobile phone use. “I think the priority must be how to protect children at an age when they also need time to play, learn, and concentrate at school,” he added.\nMerz said his government is considering “various ways of handling it in a more restrictive manner”, including an age limit and forcing platforms to verify users’ ages.\nIt follows moves made by several countries to ban social media to children under the age of 16. The first to introduce such a measure was Australia, where platforms such as TikTok, YouTube and Snapchat were required to remove accounts held by under-16s or face heavy fines since December.\nIndia said it was discussing age restrictions with social media firms, while France’s National Assembly backed a bill that would ban social media access for under-15s.\nParis prosecutors open two new probes on Epstein and call for victims to come forward\nOutside of Ukraine, prosecutors in France have opened two new investigations linked to Jeffrey Epstein as they urged potential victims to come forward.\nParis prosecutor Laure Beccuau said the probes were launched to examine the alleged sexual offences and possible financial crimes connected to the convicted sex offender. The investigations are seeking to use the millions of files released by the US government related to Epstein, Beccuau added.\n“All that data … some will shed light on others to be able to get a well-informed, very broad, panoramic view,” Beccuau told the French broadcaster France Info.\nBeccuau called on all potential French victims to come forward, saying: “We want to stand with these victims. We will receive all statements they wish to make.”\nBrunel was found dead in his cell in a Paris prison in 2022 after having been charged with raping minors. The case against him was dropped in 2023 in the wake of his death, with no other person charged.\nZelenskyy: No agreement on key issues in Geneva talks\nZelenskyy said there has been no agreement between Ukraine and Russia on the key issues at the US-mediated talks in Geneva.\n“We can see that some groundwork has been done, but for now the positions differ, because the negotiations were not easy,” the Ukrainian president told reporters after the talks had finished, according to the AFP news agency.\nHe listed the fate of occupied territories in Ukraine’s east and the future of the Zaporizhzhia nuclear power plant, which Russia has taken control of, as the unresolved “sensitive” issues in the peace talks.\nUkraine sports minister slams Russia’s Winter Paralympics entry as ‘deeply outrageous’\nUkraine’s sports minister has condemned the decision to allow six Russians and four Belarusians to compete under their nation’s flags at next month’s Winter Paralympics as “disappointing and outrageous”.\n“The flags of Russia and Belarus have no place at international sporting events that stand for fairness, integrity, and respect,” said Matvii Bidnyi in response to the International Paralympic Committee’s decision on Monday.\n“These are the flags of regimes that have turned sport into a tool of war, lies, and contempt. In Russia, Paralympic sport has been made a pillar for those whom Putin sent to Ukraine to kill – and who returned from Ukraine with injuries and disabilities,” he added.",
    "content_length": 17586,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [
      "National Assembly",
      "Police",
      "Military",
      "assault",
      "killing",
      "dead",
      "death",
      "emergency",
      "trafficking"
    ],
    "keywords_national_matched": [
      "National Assembly",
      "Police",
      "Military"
    ],
    "keywords_threat_matched": [
      "assault",
      "killing",
      "dead",
      "death",
      "emergency",
      "trafficking"
    ],
    "national_relevant": true,
    "threat_relevant": true,
    "shortlisted": true,
    "kw_national_hits": [
      "National Assembly",
      "Police",
      "Military"
    ],
    "kw_threat_hits": [
      "assault",
      "killing",
      "dead",
      "death",
      "emergency",
      "trafficking"
    ],
    "relevance_score": 55.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 72.0,
    "prepriority_score": 73.2,
    "prepriority_bucket": "HIGH",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.theguardian.com/world/rss",
      "fetched_at": "2026-02-18T19:07:30.196021+00:00",
      "rss": {
        "published_at": "2026-02-18T16:07:54+00:00"
      },
      "kw_national_hits": [
        "National Assembly",
        "Police",
        "Military"
      ],
      "kw_threat_hits": [
        "assault",
        "killing",
        "dead",
        "death",
        "emergency",
        "trafficking"
      ],
      "kw_shortlisted": true
    }
  },
  {
    "id": "d54c3bcdcbb3047b09274119",
    "country": "UNITED KINGDOM",
    "source_name": "The Guardian",
    "source_slug": "the_guardian",
    "url": "https://www.theguardian.com/artanddesign/2026/feb/18/chalet-barcelona-confirmed-gaudi-xalet-del-catllaras",
    "title": "Hundred-year reveal: Catalonian chalet confirmed as Gaudí work in centenary year",
    "published_at": "2026-02-18T16:00:55+00:00",
    "author": "Stephen Burgen in Barcelona",
    "summary": "<p>Xalet del Catllaràs contains elements of architect’s naturalistic style, expressed in works such as Park Güell and Sagrada Família</p><p>An elegant modernist building in the mountains north of Barcelona, originally constructed to house engineers establishing a nearby mine, has been confirmed as a work of Antoni Gaudí, Catalonia’s most celebrated and distinctive architect.</p><p>The Xalet del Catllaràs, about 80 miles from Barcelona in the county of Berguedà, was built in 1905 and commissioned by Eusebi Güell, Gaudí’s lifelong patron. Güell was the owner of a cement company with mines in the region and he needed somewhere to house the engineers, many of them British, who would help extract the coal for his factories.</p> <a href=\"https://www.theguardian.com/artanddesign/2026/feb/18/chalet-barcelona-confirmed-gaudi-xalet-del-catllaras\">Continue reading...</a>",
    "content_text": "An elegant modernist building in the mountains north of Barcelona, originally constructed to house engineers establishing a nearby mine, has been confirmed as a work of Antoni Gaudí, Catalonia’s most celebrated and distinctive architect.\nThe Xalet del Catllaràs, about 80 miles from Barcelona in the county of Berguedà, was built in 1905 and commissioned by Eusebi Güell, Gaudí’s lifelong patron. Güell was the owner of a cement company with mines in the region and he needed somewhere to house the engineers, many of them British, who would help extract the coal for his factories.\nIt has long been suspected that the chalet, now not in use, was the work of Gaudí but historians had not firmly established the architect. The building contains elements of Gaudí’s naturalistic style, evoking the forms of plants and animals that would later be expressed in works such as Park Güell and the Casa Batllò in Barcelona. The pointed arch structure also foreshadows Gaudí’s best-known work, the Sagrada Família in Barcelona.\nSònia Hernández Almodóvar, the Catalan culture minister, said the attribution was the fruit of “rigorous research which is of enormous value for our heritage” and enriched Gaudí’s legacy on the centenary of his death.\nThe analysis was carried out by the Catalan heritage department led by the chair of Gaudí studies, Galdric Santana Roma. “After much research we have concluded that the Xalet del Catllaràs is the work of Gaudí,” he said. “However, this attribution is strictly limited to the initial stages of the project as Gaudí didn’t supervise the work which didn’t follow faithfully the original design.”\nSantana said the process of certifying an architectural work is very different from that of a painting and the knowledge acquired in the study of the chalet will contribute to investigating other works attributed to Gaudí.\nGaudí died on 10 June 1926, at the age of 73, three days after being hit by a tram in Barcelona, and numerous commemorative events and exhibitions are planned throughout the centenary year.\nThe installation in June of the final elements of the illuminated cross atop the central Jesus Christ tower of the Sagrada Família, more than 140 years after the project began in 1882, is likely to have the longest-lasting impact on the city’s skyline.\nInitially funded by repentant sinners and more recently by tourism, the completion of the tower will make it, at 172.5 metres, Barcelona’s tallest building. The Sagrada Família is already the world’s tallest church since part of its central tower was lifted into place in October.\nGaudí devoted the latter part of his life to the Sagrada Família, but little of it was completed in the architect’s lifetime, and work practically came to a halt at the outbreak of the Spanish civil war in 1936. The rise of mass tourism after the 1992 Olympic Games helped to make Barcelona a popular tourist destination and work on the church accelerated and moved into its final stages.\nWork on the Glory facade is expected to last another 10 years, and there remains the thorny issue of constructing the grand entrance stairway, in Gaudí’s original plan, that would now entail rehousing 10,000 people and demolishing about 3,000 apartments.",
    "content_length": 3220,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 38.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.theguardian.com/world/rss",
      "fetched_at": "2026-02-18T19:07:30.196031+00:00",
      "rss": {
        "published_at": "2026-02-18T16:00:55+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  },
  {
    "id": "024eb4c64be64ed0ff5730d4",
    "country": "UNITED KINGDOM",
    "source_name": "The Guardian",
    "source_slug": "the_guardian",
    "url": "https://www.theguardian.com/world/2026/feb/18/belgium-investigation-jewish-men-diplomatic-row-us-ambassador",
    "title": "Belgian investigation into three Jewish men sparks diplomatic row with US",
    "published_at": "2026-02-18T15:54:29+00:00",
    "author": "Jon Henley Europe correspondent",
    "summary": "<p>US ambassador accused of interference after labelling inquiry into suspected illegal circumcisions ‘antisemitic’</p><p>A diplomatic row is escalating between Belgium and the US, with Donald Trump’s ambassador refusing to apologise for accusing his host country of antisemitism and reportedly threatening to bar a socialist politician from travelling to the US.</p><p>Bill White, a staunch ally of the president <a href=\"https://www.theguardian.com/us-news/2025/dec/19/trump-european-envoys-charles-kushner-andrew-puzder-stacey-feinberg-kimberly-guilfoyle\">like many US ambassadors</a>, on Monday demanded Belgium drop a “ridiculous” and “antisemitic” investigation into three Jewish men suspected of performing circumcisions without medical qualifications.</p> <a href=\"https://www.theguardian.com/world/2026/feb/18/belgium-investigation-jewish-men-diplomatic-row-us-ambassador\">Continue reading...</a>",
    "content_text": "A diplomatic row is escalating between Belgium and the US, with Donald Trump’s ambassador refusing to apologise for accusing his host country of antisemitism and reportedly threatening to bar a socialist politician from travelling to the US.\nBill White, a staunch ally of the president like many US ambassadors, on Monday demanded Belgium drop a “ridiculous” and “antisemitic” investigation into three Jewish men suspected of performing circumcisions without medical qualifications.\nIn a social media post, White demanded Belgium’s “very rude” socialist health minister, Frank Vandenbroucke, stop the “unacceptable harassment” and “disgusting” treatment of the three men. He also called on Belgium to do “a much better job” on antisemitism.\nCircumcision is legal in Belgium but must be carried out under strict conditions by a medical professional. The investigation concerns three mohels, or ritual circumcisers, in Antwerp suspected of performing circumcisions without any medical training.\nWhite’s post drew an immediate rebuke from Belgium’s foreign minister, Maxime Prévot. “Any suggestion Belgium is antisemitic is false, offensive, and unacceptable,” Prévot said, accusing the ambassador of violating “fundamental diplomatic norms”.\nWhite responded that Belgium should change its law or label the investigation into “three beautiful religiously qualified and wonderful men” antisemitic. Accusations that he was interfering in Belgium’s judicial affairs were a “political distraction”, he said.\nAfter being summoned to the foreign ministry on Tuesday, White insisted there was “no need” for him to apologise. He had “explained our position and that of President Trump and of our country”, he said, and hoped Belgium could “legalise this process”.\nBelgian authorities said White had been reminded of the Vienna convention on diplomatic relations, adding: “Personal attacks on a member of the government and interference in Belgium’s internal affairs are contrary to these basic diplomatic rules.”\nThe ministry said in its statement that while Belgium attached great importance to its relationship with the US, dialogue “must be based on respect for our institutions and our sovereignty”. It reaffirmed its condemnation of antisemitism and racism.\nThe Belgian newspaper De Morgen reported on Wednesday that White had handed an official complaint to Belgium’s top diplomat at the meeting, demanding “immediate condemnation” of statements by Conner Rousseau, the leader of the Flemish socialist Vooruit party.\nRousseau last month posted that the “gruesome” behaviour of Immigration and Customs Enforcement (ICE) in the US showed “history was repeating itself” and “we have not listened” to the calls of “never again” after the horrors of Nazi Germany.\nRousseau said on Wednesday he was unrepentant. “I posted that on social media five weeks ago, and yesterday it suddenly turns out to be a problem,” he said. “I suspect [White’s] intervention regarding the circumcision did not go as he would have liked.”\nRousseau, whom White reportedly threatened with a travel ban to the US, told the Flemish broadcaster VRT: “I can only say that we in Belgium have the right, and I also believe a political duty, to express our concerns about what’s happening in the US.\n“I respect the ambassador’s opinion, but I also ask for respect for ours.”",
    "content_length": 3334,
    "extraction_method": "rss",
    "extraction_notes": [
      "possible botwall content (fetch=requests, status=200); ok (fetch=requests, status=200)"
    ],
    "run_id": null,
    "run_created_at": null,
    "fetched_at": null,
    "keywords_matched": [],
    "keywords_national_matched": [],
    "keywords_threat_matched": [],
    "national_relevant": false,
    "threat_relevant": false,
    "shortlisted": false,
    "kw_national_hits": [],
    "kw_threat_hits": [],
    "relevance_score": 0.0,
    "evidence_strength": "HIGH",
    "evidence_numeric": 90.0,
    "urgency_score": 100.0,
    "keyword_intensity": 0.0,
    "prepriority_score": 38.5,
    "prepriority_bucket": "LOW",
    "threat_score": null,
    "threat_level": null,
    "threat_vector": null,
    "one_liner_threat": null,
    "reasons": [],
    "risk_index": null,
    "truth_score": null,
    "truth_label": null,
    "truth_reasons": [],
    "threat_factors": [],
    "raw": {
      "discovery_method": "rss",
      "endpoint_used": "https://www.theguardian.com/world/rss",
      "fetched_at": "2026-02-18T19:07:30.196040+00:00",
      "rss": {
        "published_at": "2026-02-18T15:54:29+00:00"
      },
      "kw_national_hits": [],
      "kw_threat_hits": [],
      "kw_shortlisted": false
    }
  }
]